Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1e5 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2d34): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x11ea): ../Core/Src/fonts.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x29db): C:/Users/kille/Desktop/Master_provisional/STM32_project/Debug
    <1a>   DW_AT_stmt_list   : 0
    <1e>   DW_AT_macros      : 0
 <1><22>: Abbrev Number: 1 (DW_TAG_base_type)
    <23>   DW_AT_byte_size   : 1
    <24>   DW_AT_encoding    : 6	(signed char)
    <25>   DW_AT_name        : (indirect string, offset: 0x2a94): signed char
 <1><29>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indirect string, offset: 0x2d2a): __uint8_t
    <2e>   DW_AT_decl_file   : 2
    <2f>   DW_AT_decl_line   : 43
    <30>   DW_AT_decl_column : 24
    <31>   DW_AT_type        : <0x35>
 <1><35>: Abbrev Number: 1 (DW_TAG_base_type)
    <36>   DW_AT_byte_size   : 1
    <37>   DW_AT_encoding    : 8	(unsigned char)
    <38>   DW_AT_name        : (indirect string, offset: 0x2ca7): unsigned char
 <1><3c>: Abbrev Number: 1 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 2
    <3e>   DW_AT_encoding    : 5	(signed)
    <3f>   DW_AT_name        : (indirect string, offset: 0x7b8): short int
 <1><43>: Abbrev Number: 3 (DW_TAG_typedef)
    <44>   DW_AT_name        : (indirect string, offset: 0x1189): __uint16_t
    <48>   DW_AT_decl_file   : 2
    <49>   DW_AT_decl_line   : 57
    <4a>   DW_AT_decl_column : 25
    <4b>   DW_AT_type        : <0x4f>
 <1><4f>: Abbrev Number: 1 (DW_TAG_base_type)
    <50>   DW_AT_byte_size   : 2
    <51>   DW_AT_encoding    : 7	(unsigned)
    <52>   DW_AT_name        : (indirect string, offset: 0x5f6): short unsigned int
 <1><56>: Abbrev Number: 1 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 4
    <58>   DW_AT_encoding    : 5	(signed)
    <59>   DW_AT_name        : (indirect string, offset: 0x28e9): long int
 <1><5d>: Abbrev Number: 1 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 7	(unsigned)
    <60>   DW_AT_name        : (indirect string, offset: 0x25e6): long unsigned int
 <1><64>: Abbrev Number: 1 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 8
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : (indirect string, offset: 0x233c): long long int
 <1><6b>: Abbrev Number: 1 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 7	(unsigned)
    <6e>   DW_AT_name        : (indirect string, offset: 0x3761): long long unsigned int
 <1><72>: Abbrev Number: 12 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 4
    <74>   DW_AT_encoding    : 5	(signed)
    <75>   DW_AT_name        : int
 <1><79>: Abbrev Number: 1 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 7	(unsigned)
    <7c>   DW_AT_name        : (indirect string, offset: 0x3426): unsigned int
 <1><80>: Abbrev Number: 3 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x2d2c): uint8_t
    <85>   DW_AT_decl_file   : 3
    <86>   DW_AT_decl_line   : 24
    <87>   DW_AT_decl_column : 19
    <88>   DW_AT_type        : <0x29>
 <1><8c>: Abbrev Number: 2 (DW_TAG_const_type)
    <8d>   DW_AT_type        : <0x80>
 <1><91>: Abbrev Number: 3 (DW_TAG_typedef)
    <92>   DW_AT_name        : (indirect string, offset: 0x6bf14): uint16_t
    <96>   DW_AT_decl_file   : 3
    <97>   DW_AT_decl_line   : 36
    <98>   DW_AT_decl_column : 20
    <99>   DW_AT_type        : <0x43>
 <1><9d>: Abbrev Number: 2 (DW_TAG_const_type)
    <9e>   DW_AT_type        : <0x91>
 <1><a2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a3>   DW_AT_byte_size   : 8
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 6
    <a6>   DW_AT_decl_column : 9
    <a7>   DW_AT_sibling     : <0xd0>
 <2><ab>: Abbrev Number: 6 (DW_TAG_member)
    <ac>   DW_AT_name        : (indirect string, offset: 0x1521): width
    <b0>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 7
    <b1>   DW_AT_decl_column : 19
    <b2>   DW_AT_type        : <0x8c>
    <b6>   DW_AT_data_member_location: 0
 <2><b7>: Abbrev Number: 6 (DW_TAG_member)
    <b8>   DW_AT_name        : (indirect string, offset: 0x2404): height
    <bc>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 8
    <bd>   DW_AT_decl_column : 13
    <be>   DW_AT_type        : <0x80>
    <c2>   DW_AT_data_member_location: 1
 <2><c3>: Abbrev Number: 6 (DW_TAG_member)
    <c4>   DW_AT_name        : (indirect string, offset: 0x1ddad): data
    <c8>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 9
    <c9>   DW_AT_decl_column : 21
    <ca>   DW_AT_type        : <0xd0>
    <ce>   DW_AT_data_member_location: 4
 <2><cf>: Abbrev Number: 0
 <1><d0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d1>   DW_AT_byte_size   : 4
    <d2>   DW_AT_type        : <0x9d>
 <1><d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7>   DW_AT_name        : (indirect string, offset: 0xd9): FontDef
    <db>   DW_AT_decl_file   : 4
    <dc>   DW_AT_decl_line   : 10
    <dd>   DW_AT_decl_column : 3
    <de>   DW_AT_type        : <0xa2>
 <1><e2>: Abbrev Number: 5 (DW_TAG_variable)
    <e3>   DW_AT_name        : (indirect string, offset: 0x6d5): Font_7x10
    <e7>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 13
    <e8>   DW_AT_decl_column : 16
    <e9>   DW_AT_type        : <0xd6>
    <ed>   DW_AT_external    : 1
    <ed>   DW_AT_declaration : 1
 <1><ed>: Abbrev Number: 5 (DW_TAG_variable)
    <ee>   DW_AT_name        : (indirect string, offset: 0x3a82): Font_11x18
    <f2>   DW_AT_decl_file   : 4
    <f2>   DW_AT_decl_line   : 14
    <f3>   DW_AT_decl_column : 16
    <f4>   DW_AT_type        : <0xd6>
    <f8>   DW_AT_external    : 1
    <f8>   DW_AT_declaration : 1
 <1><f8>: Abbrev Number: 5 (DW_TAG_variable)
    <f9>   DW_AT_name        : (indirect string, offset: 0x32b4): Font_16x26
    <fd>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 15
    <fe>   DW_AT_decl_column : 16
    <ff>   DW_AT_type        : <0xd6>
    <103>   DW_AT_external    : 1
    <103>   DW_AT_declaration : 1
 <1><103>: Abbrev Number: 4 (DW_TAG_array_type)
    <104>   DW_AT_type        : <0x9d>
    <108>   DW_AT_sibling     : <0x113>
 <2><10c>: Abbrev Number: 15 (DW_TAG_subrange_type)
 <2><10d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10e>   DW_AT_type        : <0x79>
    <112>   DW_AT_upper_bound : 127
 <2><112>: Abbrev Number: 0
 <1><113>: Abbrev Number: 2 (DW_TAG_const_type)
    <114>   DW_AT_type        : <0x103>
 <1><118>: Abbrev Number: 5 (DW_TAG_variable)
    <119>   DW_AT_name        : (indirect string, offset: 0x1586): saber
    <11d>   DW_AT_decl_file   : 4
    <11d>   DW_AT_decl_line   : 27
    <11e>   DW_AT_decl_column : 23
    <11f>   DW_AT_type        : <0x113>
    <123>   DW_AT_external    : 1
    <123>   DW_AT_declaration : 1
 <1><123>: Abbrev Number: 4 (DW_TAG_array_type)
    <124>   DW_AT_type        : <0x9d>
    <128>   DW_AT_sibling     : <0x134>
 <2><12c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <12d>   DW_AT_type        : <0x79>
    <131>   DW_AT_upper_bound : 949
 <2><133>: Abbrev Number: 0
 <1><134>: Abbrev Number: 2 (DW_TAG_const_type)
    <135>   DW_AT_type        : <0x123>
 <1><139>: Abbrev Number: 9 (DW_TAG_variable)
    <13a>   DW_AT_name        : (indirect string, offset: 0x7a0): Font7x10
    <13e>   DW_AT_decl_file   : 1
    <13e>   DW_AT_decl_line   : 3
    <13f>   DW_AT_decl_column : 23
    <13f>   DW_AT_type        : <0x134>
    <143>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><149>: Abbrev Number: 4 (DW_TAG_array_type)
    <14a>   DW_AT_type        : <0x9d>
    <14e>   DW_AT_sibling     : <0x15a>
 <2><152>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <153>   DW_AT_type        : <0x79>
    <157>   DW_AT_upper_bound : 1709
 <2><159>: Abbrev Number: 0
 <1><15a>: Abbrev Number: 2 (DW_TAG_const_type)
    <15b>   DW_AT_type        : <0x149>
 <1><15f>: Abbrev Number: 9 (DW_TAG_variable)
    <160>   DW_AT_name        : (indirect string, offset: 0x2cf): Font11x18
    <164>   DW_AT_decl_file   : 1
    <164>   DW_AT_decl_line   : 101
    <165>   DW_AT_decl_column : 23
    <165>   DW_AT_type        : <0x15a>
    <169>   DW_AT_location    : 5 byte block: 3 b0 20 1 8 	(DW_OP_addr: 80120b0)
 <1><16f>: Abbrev Number: 4 (DW_TAG_array_type)
    <170>   DW_AT_type        : <0x9d>
    <174>   DW_AT_sibling     : <0x180>
 <2><178>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <179>   DW_AT_type        : <0x79>
    <17d>   DW_AT_upper_bound : 2469
 <2><17f>: Abbrev Number: 0
 <1><180>: Abbrev Number: 2 (DW_TAG_const_type)
    <181>   DW_AT_type        : <0x16f>
 <1><185>: Abbrev Number: 9 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x287f): Font16x26
    <18a>   DW_AT_decl_file   : 1
    <18a>   DW_AT_decl_line   : 199
    <18b>   DW_AT_decl_column : 23
    <18b>   DW_AT_type        : <0x180>
    <18f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><195>: Abbrev Number: 4 (DW_TAG_array_type)
    <196>   DW_AT_type        : <0x9d>
    <19a>   DW_AT_sibling     : <0x1a9>
 <2><19e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <19f>   DW_AT_type        : <0x79>
    <1a3>   DW_AT_upper_bound : 127
 <2><1a3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1a4>   DW_AT_type        : <0x79>
    <1a8>   DW_AT_upper_bound : 127
 <2><1a8>: Abbrev Number: 0
 <1><1a9>: Abbrev Number: 2 (DW_TAG_const_type)
    <1aa>   DW_AT_type        : <0x195>
 <1><1ae>: Abbrev Number: 16 (DW_TAG_variable)
    <1af>   DW_AT_specification: <0x118>
    <1b3>   DW_AT_decl_file   : 1
    <1b4>   DW_AT_decl_line   : 297
    <1b6>   DW_AT_decl_column : 16
    <1b7>   DW_AT_type        : <0x1a9>
    <1bb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1c1>: Abbrev Number: 10 (DW_TAG_variable)
    <1c2>   DW_AT_specification: <0xe2>
    <1c6>   DW_AT_decl_file   : 1
    <1c6>   DW_AT_decl_line   : 1160
    <1c8>   DW_AT_decl_column : 9
    <1c8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1ce>: Abbrev Number: 10 (DW_TAG_variable)
    <1cf>   DW_AT_specification: <0xed>
    <1d3>   DW_AT_decl_file   : 1
    <1d3>   DW_AT_decl_line   : 1161
    <1d5>   DW_AT_decl_column : 9
    <1d5>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1db>: Abbrev Number: 10 (DW_TAG_variable)
    <1dc>   DW_AT_specification: <0xf8>
    <1e0>   DW_AT_decl_file   : 1
    <1e0>   DW_AT_decl_line   : 1162
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1e8>: Abbrev Number: 0
  Compilation Unit @ offset 0x1e9:
   Length:        0x1831 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xd3
   Pointer Size:  4
 <0><1f5>: Abbrev Number: 38 (DW_TAG_compile_unit)
    <1f6>   DW_AT_producer    : (indirect string, offset: 0x2d34): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1fa>   DW_AT_language    : 29	(C11)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x91e5f): ../Core/Src/freertos.c
    <1ff>   DW_AT_comp_dir    : (indirect string, offset: 0x29db): C:/Users/kille/Desktop/Master_provisional/STM32_project/Debug
    <203>   DW_AT_ranges      : 0xc
    <207>   DW_AT_low_pc      : 0
    <20b>   DW_AT_stmt_list   : 0x40a
    <20f>   DW_AT_macros      : 0xf92
 <1><213>: Abbrev Number: 39 (DW_TAG_base_type)
    <214>   DW_AT_byte_size   : 4
    <215>   DW_AT_encoding    : 5	(signed)
    <216>   DW_AT_name        : int
 <1><21a>: Abbrev Number: 12 (DW_TAG_base_type)
    <21b>   DW_AT_byte_size   : 4
    <21c>   DW_AT_encoding    : 7	(unsigned)
    <21d>   DW_AT_name        : (indirect string, offset: 0x3426): unsigned int
 <1><221>: Abbrev Number: 12 (DW_TAG_base_type)
    <222>   DW_AT_byte_size   : 8
    <223>   DW_AT_encoding    : 5	(signed)
    <224>   DW_AT_name        : (indirect string, offset: 0x233c): long long int
 <1><228>: Abbrev Number: 12 (DW_TAG_base_type)
    <229>   DW_AT_byte_size   : 8
    <22a>   DW_AT_encoding    : 4	(float)
    <22b>   DW_AT_name        : (indirect string, offset: 0x799de): long double
 <1><22f>: Abbrev Number: 12 (DW_TAG_base_type)
    <230>   DW_AT_byte_size   : 1
    <231>   DW_AT_encoding    : 6	(signed char)
    <232>   DW_AT_name        : (indirect string, offset: 0x2a94): signed char
 <1><236>: Abbrev Number: 7 (DW_TAG_typedef)
    <237>   DW_AT_name        : (indirect string, offset: 0x2d2a): __uint8_t
    <23b>   DW_AT_decl_file   : 2
    <23c>   DW_AT_decl_line   : 43
    <23d>   DW_AT_decl_column : 24
    <23e>   DW_AT_type        : <0x242>
 <1><242>: Abbrev Number: 12 (DW_TAG_base_type)
    <243>   DW_AT_byte_size   : 1
    <244>   DW_AT_encoding    : 8	(unsigned char)
    <245>   DW_AT_name        : (indirect string, offset: 0x2ca7): unsigned char
 <1><249>: Abbrev Number: 7 (DW_TAG_typedef)
    <24a>   DW_AT_name        : (indirect string, offset: 0x76215): __int16_t
    <24e>   DW_AT_decl_file   : 2
    <24f>   DW_AT_decl_line   : 55
    <250>   DW_AT_decl_column : 24
    <251>   DW_AT_type        : <0x255>
 <1><255>: Abbrev Number: 12 (DW_TAG_base_type)
    <256>   DW_AT_byte_size   : 2
    <257>   DW_AT_encoding    : 5	(signed)
    <258>   DW_AT_name        : (indirect string, offset: 0x7b8): short int
 <1><25c>: Abbrev Number: 7 (DW_TAG_typedef)
    <25d>   DW_AT_name        : (indirect string, offset: 0x1189): __uint16_t
    <261>   DW_AT_decl_file   : 2
    <262>   DW_AT_decl_line   : 57
    <263>   DW_AT_decl_column : 25
    <264>   DW_AT_type        : <0x268>
 <1><268>: Abbrev Number: 12 (DW_TAG_base_type)
    <269>   DW_AT_byte_size   : 2
    <26a>   DW_AT_encoding    : 7	(unsigned)
    <26b>   DW_AT_name        : (indirect string, offset: 0x5f6): short unsigned int
 <1><26f>: Abbrev Number: 12 (DW_TAG_base_type)
    <270>   DW_AT_byte_size   : 4
    <271>   DW_AT_encoding    : 5	(signed)
    <272>   DW_AT_name        : (indirect string, offset: 0x28e9): long int
 <1><276>: Abbrev Number: 7 (DW_TAG_typedef)
    <277>   DW_AT_name        : (indirect string, offset: 0x5e922): __uint32_t
    <27b>   DW_AT_decl_file   : 2
    <27c>   DW_AT_decl_line   : 79
    <27d>   DW_AT_decl_column : 25
    <27e>   DW_AT_type        : <0x282>
 <1><282>: Abbrev Number: 12 (DW_TAG_base_type)
    <283>   DW_AT_byte_size   : 4
    <284>   DW_AT_encoding    : 7	(unsigned)
    <285>   DW_AT_name        : (indirect string, offset: 0x25e6): long unsigned int
 <1><289>: Abbrev Number: 12 (DW_TAG_base_type)
    <28a>   DW_AT_byte_size   : 8
    <28b>   DW_AT_encoding    : 7	(unsigned)
    <28c>   DW_AT_name        : (indirect string, offset: 0x3761): long long unsigned int
 <1><290>: Abbrev Number: 7 (DW_TAG_typedef)
    <291>   DW_AT_name        : (indirect string, offset: 0x2d2c): uint8_t
    <295>   DW_AT_decl_file   : 3
    <296>   DW_AT_decl_line   : 24
    <297>   DW_AT_decl_column : 19
    <298>   DW_AT_type        : <0x236>
 <1><29c>: Abbrev Number: 24 (DW_TAG_const_type)
    <29d>   DW_AT_type        : <0x290>
 <1><2a1>: Abbrev Number: 7 (DW_TAG_typedef)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x76217): int16_t
    <2a6>   DW_AT_decl_file   : 3
    <2a7>   DW_AT_decl_line   : 32
    <2a8>   DW_AT_decl_column : 19
    <2a9>   DW_AT_type        : <0x249>
 <1><2ad>: Abbrev Number: 7 (DW_TAG_typedef)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x6bf14): uint16_t
    <2b2>   DW_AT_decl_file   : 3
    <2b3>   DW_AT_decl_line   : 36
    <2b4>   DW_AT_decl_column : 20
    <2b5>   DW_AT_type        : <0x25c>
 <1><2b9>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <2ba>   DW_AT_type        : <0x2ad>
 <1><2be>: Abbrev Number: 24 (DW_TAG_const_type)
    <2bf>   DW_AT_type        : <0x2ad>
 <1><2c3>: Abbrev Number: 7 (DW_TAG_typedef)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x6b7a7): uint32_t
    <2c8>   DW_AT_decl_file   : 3
    <2c9>   DW_AT_decl_line   : 48
    <2ca>   DW_AT_decl_column : 20
    <2cb>   DW_AT_type        : <0x276>
 <1><2cf>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <2d0>   DW_AT_type        : <0x2c3>
 <1><2d4>: Abbrev Number: 40 (DW_TAG_pointer_type)
    <2d5>   DW_AT_byte_size   : 4
 <1><2d6>: Abbrev Number: 7 (DW_TAG_typedef)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x6c272): StackType_t
    <2db>   DW_AT_decl_file   : 4
    <2dc>   DW_AT_decl_line   : 55
    <2dd>   DW_AT_decl_column : 24
    <2de>   DW_AT_type        : <0x2c3>
 <1><2e2>: Abbrev Number: 7 (DW_TAG_typedef)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x882f2): UBaseType_t
    <2e7>   DW_AT_decl_file   : 4
    <2e8>   DW_AT_decl_line   : 57
    <2e9>   DW_AT_decl_column : 23
    <2ea>   DW_AT_type        : <0x282>
 <1><2ee>: Abbrev Number: 7 (DW_TAG_typedef)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x5293c): TickType_t
    <2f3>   DW_AT_decl_file   : 4
    <2f4>   DW_AT_decl_line   : 63
    <2f5>   DW_AT_decl_column : 19
    <2f6>   DW_AT_type        : <0x2c3>
 <1><2fa>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2fb>   DW_AT_byte_size   : 4
    <2fb>   DW_AT_type        : <0x290>
 <1><2ff>: Abbrev Number: 15 (DW_TAG_typedef)
    <300>   DW_AT_name        : (indirect string, offset: 0x6d00a): wint_t
    <304>   DW_AT_decl_file   : 5
    <305>   DW_AT_decl_line   : 359
    <307>   DW_AT_decl_column : 23
    <308>   DW_AT_type        : <0x21a>
 <1><30c>: Abbrev Number: 7 (DW_TAG_typedef)
    <30d>   DW_AT_name        : (indirect string, offset: 0x9661a): _off_t
    <311>   DW_AT_decl_file   : 6
    <312>   DW_AT_decl_line   : 46
    <313>   DW_AT_decl_column : 14
    <314>   DW_AT_type        : <0x26f>
 <1><318>: Abbrev Number: 7 (DW_TAG_typedef)
    <319>   DW_AT_name        : (indirect string, offset: 0x23180): _fpos_t
    <31d>   DW_AT_decl_file   : 6
    <31e>   DW_AT_decl_line   : 116
    <31f>   DW_AT_decl_column : 14
    <320>   DW_AT_type        : <0x26f>
 <1><324>: Abbrev Number: 41 (DW_TAG_union_type)
    <325>   DW_AT_byte_size   : 4
    <326>   DW_AT_decl_file   : 6
    <327>   DW_AT_decl_line   : 165
    <328>   DW_AT_decl_column : 3
    <329>   DW_AT_sibling     : <0x344>
 <2><32d>: Abbrev Number: 33 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x71858): __wch
    <332>   DW_AT_decl_file   : 6
    <332>   DW_AT_decl_line   : 167
    <333>   DW_AT_decl_column : 12
    <334>   DW_AT_type        : <0x2ff>
 <2><338>: Abbrev Number: 33 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0x4d222): __wchb
    <33d>   DW_AT_decl_file   : 6
    <33d>   DW_AT_decl_line   : 168
    <33e>   DW_AT_decl_column : 19
    <33f>   DW_AT_type        : <0x344>
 <2><343>: Abbrev Number: 0
 <1><344>: Abbrev Number: 9 (DW_TAG_array_type)
    <345>   DW_AT_type        : <0x242>
    <349>   DW_AT_sibling     : <0x354>
 <2><34d>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <34e>   DW_AT_type        : <0x21a>
    <352>   DW_AT_upper_bound : 3
 <2><353>: Abbrev Number: 0
 <1><354>: Abbrev Number: 20 (DW_TAG_structure_type)
    <355>   DW_AT_byte_size   : 8
    <356>   DW_AT_decl_file   : 6
    <357>   DW_AT_decl_line   : 162
    <358>   DW_AT_decl_column : 9
    <358>   DW_AT_sibling     : <0x377>
 <2><35c>: Abbrev Number: 1 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x2b536): __count
    <361>   DW_AT_decl_file   : 6
    <362>   DW_AT_decl_line   : 164
    <363>   DW_AT_decl_column : 7
    <364>   DW_AT_type        : <0x213>
    <368>   DW_AT_data_member_location: 0
 <2><369>: Abbrev Number: 1 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x55caf): __value
    <36e>   DW_AT_decl_file   : 6
    <36f>   DW_AT_decl_line   : 169
    <370>   DW_AT_decl_column : 5
    <371>   DW_AT_type        : <0x324>
    <375>   DW_AT_data_member_location: 4
 <2><376>: Abbrev Number: 0
 <1><377>: Abbrev Number: 7 (DW_TAG_typedef)
    <378>   DW_AT_name        : (indirect string, offset: 0x4e5bf): _mbstate_t
    <37c>   DW_AT_decl_file   : 6
    <37d>   DW_AT_decl_line   : 170
    <37e>   DW_AT_decl_column : 3
    <37f>   DW_AT_type        : <0x354>
 <1><383>: Abbrev Number: 7 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x50ebf): __ULong
    <388>   DW_AT_decl_file   : 7
    <389>   DW_AT_decl_line   : 23
    <38a>   DW_AT_decl_column : 25
    <38b>   DW_AT_type        : <0x282>
 <1><38f>: Abbrev Number: 7 (DW_TAG_typedef)
    <390>   DW_AT_name        : (indirect string, offset: 0x5250a): _LOCK_T
    <394>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 34
    <396>   DW_AT_decl_column : 25
    <397>   DW_AT_type        : <0x39b>
 <1><39b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <39c>   DW_AT_byte_size   : 4
    <39c>   DW_AT_type        : <0x3a0>
 <1><3a0>: Abbrev Number: 28 (DW_TAG_structure_type)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x2f758): __lock
    <3a5>   DW_AT_declaration : 1
 <1><3a5>: Abbrev Number: 7 (DW_TAG_typedef)
    <3a6>   DW_AT_name        : (indirect string, offset: 0x4a151): _flock_t
    <3aa>   DW_AT_decl_file   : 7
    <3ab>   DW_AT_decl_line   : 36
    <3ac>   DW_AT_decl_column : 27
    <3ad>   DW_AT_type        : <0x38f>
 <1><3b1>: Abbrev Number: 22 (DW_TAG_structure_type)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x34d9f): _Bigint
    <3b6>   DW_AT_byte_size   : 24
    <3b7>   DW_AT_decl_file   : 7
    <3b8>   DW_AT_decl_line   : 53
    <3b9>   DW_AT_decl_column : 8
    <3ba>   DW_AT_sibling     : <0x40b>
 <2><3be>: Abbrev Number: 1 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x58c27): _next
    <3c3>   DW_AT_decl_file   : 7
    <3c4>   DW_AT_decl_line   : 55
    <3c5>   DW_AT_decl_column : 19
    <3c6>   DW_AT_type        : <0x40b>
    <3ca>   DW_AT_data_member_location: 0
 <2><3cb>: Abbrev Number: 11 (DW_TAG_member)
    <3cc>   DW_AT_name        : _k
    <3cf>   DW_AT_decl_file   : 7
    <3d0>   DW_AT_decl_line   : 56
    <3d1>   DW_AT_decl_column : 7
    <3d2>   DW_AT_type        : <0x213>
    <3d6>   DW_AT_data_member_location: 4
 <2><3d7>: Abbrev Number: 1 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x69fb2): _maxwds
    <3dc>   DW_AT_decl_file   : 7
    <3dd>   DW_AT_decl_line   : 56
    <3de>   DW_AT_decl_column : 11
    <3df>   DW_AT_type        : <0x213>
    <3e3>   DW_AT_data_member_location: 8
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x3774d): _sign
    <3e9>   DW_AT_decl_file   : 7
    <3ea>   DW_AT_decl_line   : 56
    <3eb>   DW_AT_decl_column : 20
    <3ec>   DW_AT_type        : <0x213>
    <3f0>   DW_AT_data_member_location: 12
 <2><3f1>: Abbrev Number: 1 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x4f61e): _wds
    <3f6>   DW_AT_decl_file   : 7
    <3f7>   DW_AT_decl_line   : 56
    <3f8>   DW_AT_decl_column : 27
    <3f9>   DW_AT_type        : <0x213>
    <3fd>   DW_AT_data_member_location: 16
 <2><3fe>: Abbrev Number: 11 (DW_TAG_member)
    <3ff>   DW_AT_name        : _x
    <402>   DW_AT_decl_file   : 7
    <403>   DW_AT_decl_line   : 57
    <404>   DW_AT_decl_column : 11
    <405>   DW_AT_type        : <0x410>
    <409>   DW_AT_data_member_location: 20
 <2><40a>: Abbrev Number: 0
 <1><40b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <40c>   DW_AT_byte_size   : 4
    <40c>   DW_AT_type        : <0x3b1>
 <1><410>: Abbrev Number: 9 (DW_TAG_array_type)
    <411>   DW_AT_type        : <0x383>
    <415>   DW_AT_sibling     : <0x420>
 <2><419>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <41a>   DW_AT_type        : <0x21a>
    <41e>   DW_AT_upper_bound : 0
 <2><41f>: Abbrev Number: 0
 <1><420>: Abbrev Number: 22 (DW_TAG_structure_type)
    <421>   DW_AT_name        : (indirect string, offset: 0x2a3a4): __tm
    <425>   DW_AT_byte_size   : 36
    <426>   DW_AT_decl_file   : 7
    <427>   DW_AT_decl_line   : 61
    <428>   DW_AT_decl_column : 8
    <429>   DW_AT_sibling     : <0x4a3>
 <2><42d>: Abbrev Number: 1 (DW_TAG_member)
    <42e>   DW_AT_name        : (indirect string, offset: 0x79533): __tm_sec
    <432>   DW_AT_decl_file   : 7
    <433>   DW_AT_decl_line   : 63
    <434>   DW_AT_decl_column : 9
    <435>   DW_AT_type        : <0x213>
    <439>   DW_AT_data_member_location: 0
 <2><43a>: Abbrev Number: 1 (DW_TAG_member)
    <43b>   DW_AT_name        : (indirect string, offset: 0x46cd): __tm_min
    <43f>   DW_AT_decl_file   : 7
    <440>   DW_AT_decl_line   : 64
    <441>   DW_AT_decl_column : 9
    <442>   DW_AT_type        : <0x213>
    <446>   DW_AT_data_member_location: 4
 <2><447>: Abbrev Number: 1 (DW_TAG_member)
    <448>   DW_AT_name        : (indirect string, offset: 0x21e7e): __tm_hour
    <44c>   DW_AT_decl_file   : 7
    <44d>   DW_AT_decl_line   : 65
    <44e>   DW_AT_decl_column : 9
    <44f>   DW_AT_type        : <0x213>
    <453>   DW_AT_data_member_location: 8
 <2><454>: Abbrev Number: 1 (DW_TAG_member)
    <455>   DW_AT_name        : (indirect string, offset: 0x5784d): __tm_mday
    <459>   DW_AT_decl_file   : 7
    <45a>   DW_AT_decl_line   : 66
    <45b>   DW_AT_decl_column : 9
    <45c>   DW_AT_type        : <0x213>
    <460>   DW_AT_data_member_location: 12
 <2><461>: Abbrev Number: 1 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x61d5): __tm_mon
    <466>   DW_AT_decl_file   : 7
    <467>   DW_AT_decl_line   : 67
    <468>   DW_AT_decl_column : 9
    <469>   DW_AT_type        : <0x213>
    <46d>   DW_AT_data_member_location: 16
 <2><46e>: Abbrev Number: 1 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0x899a6): __tm_year
    <473>   DW_AT_decl_file   : 7
    <474>   DW_AT_decl_line   : 68
    <475>   DW_AT_decl_column : 9
    <476>   DW_AT_type        : <0x213>
    <47a>   DW_AT_data_member_location: 20
 <2><47b>: Abbrev Number: 1 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x3f67e): __tm_wday
    <480>   DW_AT_decl_file   : 7
    <481>   DW_AT_decl_line   : 69
    <482>   DW_AT_decl_column : 9
    <483>   DW_AT_type        : <0x213>
    <487>   DW_AT_data_member_location: 24
 <2><488>: Abbrev Number: 1 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x758cb): __tm_yday
    <48d>   DW_AT_decl_file   : 7
    <48e>   DW_AT_decl_line   : 70
    <48f>   DW_AT_decl_column : 9
    <490>   DW_AT_type        : <0x213>
    <494>   DW_AT_data_member_location: 28
 <2><495>: Abbrev Number: 1 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0x853f0): __tm_isdst
    <49a>   DW_AT_decl_file   : 7
    <49b>   DW_AT_decl_line   : 71
    <49c>   DW_AT_decl_column : 9
    <49d>   DW_AT_type        : <0x213>
    <4a1>   DW_AT_data_member_location: 32
 <2><4a2>: Abbrev Number: 0
 <1><4a3>: Abbrev Number: 22 (DW_TAG_structure_type)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x62e88): __sbuf
    <4a8>   DW_AT_byte_size   : 8
    <4a9>   DW_AT_decl_file   : 7
    <4aa>   DW_AT_decl_line   : 116
    <4ab>   DW_AT_decl_column : 8
    <4ac>   DW_AT_sibling     : <0x4cb>
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x92c20): _base
    <4b5>   DW_AT_decl_file   : 7
    <4b6>   DW_AT_decl_line   : 117
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0x4cb>
    <4bc>   DW_AT_data_member_location: 0
 <2><4bd>: Abbrev Number: 1 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0x9be5e): _size
    <4c2>   DW_AT_decl_file   : 7
    <4c3>   DW_AT_decl_line   : 118
    <4c4>   DW_AT_decl_column : 6
    <4c5>   DW_AT_type        : <0x213>
    <4c9>   DW_AT_data_member_location: 4
 <2><4ca>: Abbrev Number: 0
 <1><4cb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4cc>   DW_AT_byte_size   : 4
    <4cc>   DW_AT_type        : <0x242>
 <1><4d0>: Abbrev Number: 22 (DW_TAG_structure_type)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x71535): __sFILE
    <4d5>   DW_AT_byte_size   : 104
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 153
    <4d8>   DW_AT_decl_column : 8
    <4d9>   DW_AT_sibling     : <0x613>
 <2><4dd>: Abbrev Number: 11 (DW_TAG_member)
    <4de>   DW_AT_name        : _p
    <4e1>   DW_AT_decl_file   : 7
    <4e2>   DW_AT_decl_line   : 154
    <4e3>   DW_AT_decl_column : 18
    <4e4>   DW_AT_type        : <0x4cb>
    <4e8>   DW_AT_data_member_location: 0
 <2><4e9>: Abbrev Number: 11 (DW_TAG_member)
    <4ea>   DW_AT_name        : _r
    <4ed>   DW_AT_decl_file   : 7
    <4ee>   DW_AT_decl_line   : 155
    <4ef>   DW_AT_decl_column : 7
    <4f0>   DW_AT_type        : <0x213>
    <4f4>   DW_AT_data_member_location: 4
 <2><4f5>: Abbrev Number: 11 (DW_TAG_member)
    <4f6>   DW_AT_name        : _w
    <4f9>   DW_AT_decl_file   : 7
    <4fa>   DW_AT_decl_line   : 156
    <4fb>   DW_AT_decl_column : 7
    <4fc>   DW_AT_type        : <0x213>
    <500>   DW_AT_data_member_location: 8
 <2><501>: Abbrev Number: 1 (DW_TAG_member)
    <502>   DW_AT_name        : (indirect string, offset: 0x44665): _flags
    <506>   DW_AT_decl_file   : 7
    <507>   DW_AT_decl_line   : 157
    <508>   DW_AT_decl_column : 9
    <509>   DW_AT_type        : <0x255>
    <50d>   DW_AT_data_member_location: 12
 <2><50e>: Abbrev Number: 1 (DW_TAG_member)
    <50f>   DW_AT_name        : (indirect string, offset: 0x196d4): _file
    <513>   DW_AT_decl_file   : 7
    <514>   DW_AT_decl_line   : 158
    <515>   DW_AT_decl_column : 9
    <516>   DW_AT_type        : <0x255>
    <51a>   DW_AT_data_member_location: 14
 <2><51b>: Abbrev Number: 11 (DW_TAG_member)
    <51c>   DW_AT_name        : _bf
    <520>   DW_AT_decl_file   : 7
    <521>   DW_AT_decl_line   : 159
    <522>   DW_AT_decl_column : 17
    <523>   DW_AT_type        : <0x4a3>
    <527>   DW_AT_data_member_location: 16
 <2><528>: Abbrev Number: 1 (DW_TAG_member)
    <529>   DW_AT_name        : (indirect string, offset: 0x44c61): _lbfsize
    <52d>   DW_AT_decl_file   : 7
    <52e>   DW_AT_decl_line   : 160
    <52f>   DW_AT_decl_column : 7
    <530>   DW_AT_type        : <0x213>
    <534>   DW_AT_data_member_location: 24
 <2><535>: Abbrev Number: 1 (DW_TAG_member)
    <536>   DW_AT_name        : (indirect string, offset: 0x1ddac): _data
    <53a>   DW_AT_decl_file   : 7
    <53b>   DW_AT_decl_line   : 163
    <53c>   DW_AT_decl_column : 18
    <53d>   DW_AT_type        : <0x72c>
    <541>   DW_AT_data_member_location: 28
 <2><542>: Abbrev Number: 1 (DW_TAG_member)
    <543>   DW_AT_name        : (indirect string, offset: 0x840a6): _cookie
    <547>   DW_AT_decl_file   : 7
    <548>   DW_AT_decl_line   : 167
    <549>   DW_AT_decl_column : 10
    <54a>   DW_AT_type        : <0x2d4>
    <54e>   DW_AT_data_member_location: 32
 <2><54f>: Abbrev Number: 1 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0x74dff): _read
    <554>   DW_AT_decl_file   : 7
    <555>   DW_AT_decl_line   : 169
    <556>   DW_AT_decl_column : 29
    <557>   DW_AT_type        : <0x760>
    <55b>   DW_AT_data_member_location: 36
 <2><55c>: Abbrev Number: 1 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x1534e): _write
    <561>   DW_AT_decl_file   : 7
    <562>   DW_AT_decl_line   : 171
    <563>   DW_AT_decl_column : 29
    <564>   DW_AT_type        : <0x788>
    <568>   DW_AT_data_member_location: 40
 <2><569>: Abbrev Number: 1 (DW_TAG_member)
    <56a>   DW_AT_name        : (indirect string, offset: 0x911a2): _seek
    <56e>   DW_AT_decl_file   : 7
    <56f>   DW_AT_decl_line   : 174
    <570>   DW_AT_decl_column : 13
    <571>   DW_AT_type        : <0x7ab>
    <575>   DW_AT_data_member_location: 44
 <2><576>: Abbrev Number: 1 (DW_TAG_member)
    <577>   DW_AT_name        : (indirect string, offset: 0x41dea): _close
    <57b>   DW_AT_decl_file   : 7
    <57c>   DW_AT_decl_line   : 175
    <57d>   DW_AT_decl_column : 9
    <57e>   DW_AT_type        : <0x7c4>
    <582>   DW_AT_data_member_location: 48
 <2><583>: Abbrev Number: 11 (DW_TAG_member)
    <584>   DW_AT_name        : _ub
    <588>   DW_AT_decl_file   : 7
    <589>   DW_AT_decl_line   : 178
    <58a>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0x4a3>
    <58f>   DW_AT_data_member_location: 52
 <2><590>: Abbrev Number: 11 (DW_TAG_member)
    <591>   DW_AT_name        : _up
    <595>   DW_AT_decl_file   : 7
    <596>   DW_AT_decl_line   : 179
    <597>   DW_AT_decl_column : 18
    <598>   DW_AT_type        : <0x4cb>
    <59c>   DW_AT_data_member_location: 60
 <2><59d>: Abbrev Number: 11 (DW_TAG_member)
    <59e>   DW_AT_name        : _ur
    <5a2>   DW_AT_decl_file   : 7
    <5a3>   DW_AT_decl_line   : 180
    <5a4>   DW_AT_decl_column : 7
    <5a5>   DW_AT_type        : <0x213>
    <5a9>   DW_AT_data_member_location: 64
 <2><5aa>: Abbrev Number: 1 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x29f7c): _ubuf
    <5af>   DW_AT_decl_file   : 7
    <5b0>   DW_AT_decl_line   : 183
    <5b1>   DW_AT_decl_column : 17
    <5b2>   DW_AT_type        : <0x7c9>
    <5b6>   DW_AT_data_member_location: 68
 <2><5b7>: Abbrev Number: 1 (DW_TAG_member)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x64c4c): _nbuf
    <5bc>   DW_AT_decl_file   : 7
    <5bd>   DW_AT_decl_line   : 184
    <5be>   DW_AT_decl_column : 17
    <5bf>   DW_AT_type        : <0x7d9>
    <5c3>   DW_AT_data_member_location: 71
 <2><5c4>: Abbrev Number: 11 (DW_TAG_member)
    <5c5>   DW_AT_name        : _lb
    <5c9>   DW_AT_decl_file   : 7
    <5ca>   DW_AT_decl_line   : 187
    <5cb>   DW_AT_decl_column : 17
    <5cc>   DW_AT_type        : <0x4a3>
    <5d0>   DW_AT_data_member_location: 72
 <2><5d1>: Abbrev Number: 1 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x95914): _blksize
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 190
    <5d8>   DW_AT_decl_column : 7
    <5d9>   DW_AT_type        : <0x213>
    <5dd>   DW_AT_data_member_location: 80
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x59690): _offset
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 191
    <5e5>   DW_AT_decl_column : 10
    <5e6>   DW_AT_type        : <0x30c>
    <5ea>   DW_AT_data_member_location: 84
 <2><5eb>: Abbrev Number: 1 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x2f759): _lock
    <5f0>   DW_AT_decl_file   : 7
    <5f1>   DW_AT_decl_line   : 198
    <5f2>   DW_AT_decl_column : 12
    <5f3>   DW_AT_type        : <0x3a5>
    <5f7>   DW_AT_data_member_location: 88
 <2><5f8>: Abbrev Number: 1 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x13d8a): _mbstate
    <5fd>   DW_AT_decl_file   : 7
    <5fe>   DW_AT_decl_line   : 200
    <5ff>   DW_AT_decl_column : 14
    <600>   DW_AT_type        : <0x377>
    <604>   DW_AT_data_member_location: 92
 <2><605>: Abbrev Number: 1 (DW_TAG_member)
    <606>   DW_AT_name        : (indirect string, offset: 0x7887a): _flags2
    <60a>   DW_AT_decl_file   : 7
    <60b>   DW_AT_decl_line   : 201
    <60c>   DW_AT_decl_column : 9
    <60d>   DW_AT_type        : <0x213>
    <611>   DW_AT_data_member_location: 100
 <2><612>: Abbrev Number: 0
 <1><613>: Abbrev Number: 16 (DW_TAG_structure_type)
    <614>   DW_AT_name        : (indirect string, offset: 0xa07ba): _reent
    <618>   DW_AT_byte_size   : 76
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 379
    <61c>   DW_AT_decl_column : 8
    <61d>   DW_AT_sibling     : <0x72c>
 <2><621>: Abbrev Number: 2 (DW_TAG_member)
    <622>   DW_AT_name        : (indirect string, offset: 0x96052): _errno
    <626>   DW_AT_decl_file   : 7
    <627>   DW_AT_decl_line   : 383
    <629>   DW_AT_decl_column : 7
    <62a>   DW_AT_type        : <0x213>
    <62e>   DW_AT_data_member_location: 0
 <2><62f>: Abbrev Number: 2 (DW_TAG_member)
    <630>   DW_AT_name        : (indirect string, offset: 0x4beb5): _stdin
    <634>   DW_AT_decl_file   : 7
    <635>   DW_AT_decl_line   : 388
    <637>   DW_AT_decl_column : 11
    <638>   DW_AT_type        : <0x7f6>
    <63c>   DW_AT_data_member_location: 4
 <2><63d>: Abbrev Number: 2 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x65dd3): _stdout
    <642>   DW_AT_decl_file   : 7
    <643>   DW_AT_decl_line   : 388
    <645>   DW_AT_decl_column : 20
    <646>   DW_AT_type        : <0x7f6>
    <64a>   DW_AT_data_member_location: 8
 <2><64b>: Abbrev Number: 2 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x86b7e): _stderr
    <650>   DW_AT_decl_file   : 7
    <651>   DW_AT_decl_line   : 388
    <653>   DW_AT_decl_column : 30
    <654>   DW_AT_type        : <0x7f6>
    <658>   DW_AT_data_member_location: 12
 <2><659>: Abbrev Number: 2 (DW_TAG_member)
    <65a>   DW_AT_name        : (indirect string, offset: 0x5e2e2): _inc
    <65e>   DW_AT_decl_file   : 7
    <65f>   DW_AT_decl_line   : 390
    <661>   DW_AT_decl_column : 8
    <662>   DW_AT_type        : <0x213>
    <666>   DW_AT_data_member_location: 16
 <2><667>: Abbrev Number: 2 (DW_TAG_member)
    <668>   DW_AT_name        : (indirect string, offset: 0x754a3): _emergency
    <66c>   DW_AT_decl_file   : 7
    <66d>   DW_AT_decl_line   : 392
    <66f>   DW_AT_decl_column : 9
    <670>   DW_AT_type        : <0x74f>
    <674>   DW_AT_data_member_location: 20
 <2><675>: Abbrev Number: 2 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x834b6): _locale
    <67a>   DW_AT_decl_file   : 7
    <67b>   DW_AT_decl_line   : 398
    <67d>   DW_AT_decl_column : 22
    <67e>   DW_AT_type        : <0x95c>
    <682>   DW_AT_data_member_location: 24
 <2><683>: Abbrev Number: 17 (DW_TAG_member)
    <684>   DW_AT_name        : _mp
    <688>   DW_AT_decl_file   : 7
    <689>   DW_AT_decl_line   : 400
    <68b>   DW_AT_decl_column : 18
    <68c>   DW_AT_type        : <0x961>
    <690>   DW_AT_data_member_location: 28
 <2><691>: Abbrev Number: 2 (DW_TAG_member)
    <692>   DW_AT_name        : (indirect string, offset: 0x19daa): __cleanup
    <696>   DW_AT_decl_file   : 7
    <697>   DW_AT_decl_line   : 402
    <699>   DW_AT_decl_column : 10
    <69a>   DW_AT_type        : <0x971>
    <69e>   DW_AT_data_member_location: 32
 <2><69f>: Abbrev Number: 2 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0xd770): _gamma_signgam
    <6a4>   DW_AT_decl_file   : 7
    <6a5>   DW_AT_decl_line   : 404
    <6a7>   DW_AT_decl_column : 7
    <6a8>   DW_AT_type        : <0x213>
    <6ac>   DW_AT_data_member_location: 36
 <2><6ad>: Abbrev Number: 2 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x6ccce): _cvtlen
    <6b2>   DW_AT_decl_file   : 7
    <6b3>   DW_AT_decl_line   : 407
    <6b5>   DW_AT_decl_column : 7
    <6b6>   DW_AT_type        : <0x213>
    <6ba>   DW_AT_data_member_location: 40
 <2><6bb>: Abbrev Number: 2 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x454eb): _cvtbuf
    <6c0>   DW_AT_decl_file   : 7
    <6c1>   DW_AT_decl_line   : 408
    <6c3>   DW_AT_decl_column : 9
    <6c4>   DW_AT_type        : <0x74f>
    <6c8>   DW_AT_data_member_location: 44
 <2><6c9>: Abbrev Number: 2 (DW_TAG_member)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x6eadd): _r48
    <6ce>   DW_AT_decl_file   : 7
    <6cf>   DW_AT_decl_line   : 410
    <6d1>   DW_AT_decl_column : 19
    <6d2>   DW_AT_type        : <0x976>
    <6d6>   DW_AT_data_member_location: 48
 <2><6d7>: Abbrev Number: 2 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x7b35b): _localtime_buf
    <6dc>   DW_AT_decl_file   : 7
    <6dd>   DW_AT_decl_line   : 411
    <6df>   DW_AT_decl_column : 16
    <6e0>   DW_AT_type        : <0x97b>
    <6e4>   DW_AT_data_member_location: 52
 <2><6e5>: Abbrev Number: 2 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x25044): _asctime_buf
    <6ea>   DW_AT_decl_file   : 7
    <6eb>   DW_AT_decl_line   : 412
    <6ed>   DW_AT_decl_column : 9
    <6ee>   DW_AT_type        : <0x74f>
    <6f2>   DW_AT_data_member_location: 56
 <2><6f3>: Abbrev Number: 2 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xabad): _sig_func
    <6f8>   DW_AT_decl_file   : 7
    <6f9>   DW_AT_decl_line   : 415
    <6fb>   DW_AT_decl_column : 12
    <6fc>   DW_AT_type        : <0x98b>
    <700>   DW_AT_data_member_location: 60
 <2><701>: Abbrev Number: 2 (DW_TAG_member)
    <702>   DW_AT_name        : (indirect string, offset: 0x29d52): __sf
    <706>   DW_AT_decl_file   : 7
    <707>   DW_AT_decl_line   : 423
    <709>   DW_AT_decl_column : 11
    <70a>   DW_AT_type        : <0x7f6>
    <70e>   DW_AT_data_member_location: 64
 <2><70f>: Abbrev Number: 2 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0x43b48): _misc
    <714>   DW_AT_decl_file   : 7
    <715>   DW_AT_decl_line   : 424
    <717>   DW_AT_decl_column : 23
    <718>   DW_AT_type        : <0x995>
    <71c>   DW_AT_data_member_location: 68
 <2><71d>: Abbrev Number: 2 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0x5cac7): _signal_buf
    <722>   DW_AT_decl_file   : 7
    <723>   DW_AT_decl_line   : 425
    <725>   DW_AT_decl_column : 9
    <726>   DW_AT_type        : <0x74f>
    <72a>   DW_AT_data_member_location: 72
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <72d>   DW_AT_byte_size   : 4
    <72d>   DW_AT_type        : <0x613>
 <1><731>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <732>   DW_AT_prototyped  : 1
    <732>   DW_AT_type        : <0x213>
    <736>   DW_AT_sibling     : <0x74f>
 <2><73a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73b>   DW_AT_type        : <0x72c>
 <2><73f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <740>   DW_AT_type        : <0x2d4>
 <2><744>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <745>   DW_AT_type        : <0x74f>
 <2><749>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74a>   DW_AT_type        : <0x213>
 <2><74e>: Abbrev Number: 0
 <1><74f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <750>   DW_AT_byte_size   : 4
    <750>   DW_AT_type        : <0x754>
 <1><754>: Abbrev Number: 12 (DW_TAG_base_type)
    <755>   DW_AT_byte_size   : 1
    <756>   DW_AT_encoding    : 8	(unsigned char)
    <757>   DW_AT_name        : (indirect string, offset: 0x31883): char
 <1><75b>: Abbrev Number: 24 (DW_TAG_const_type)
    <75c>   DW_AT_type        : <0x754>
 <1><760>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x731>
 <1><765>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <766>   DW_AT_prototyped  : 1
    <766>   DW_AT_type        : <0x213>
    <76a>   DW_AT_sibling     : <0x783>
 <2><76e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <76f>   DW_AT_type        : <0x72c>
 <2><773>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <774>   DW_AT_type        : <0x2d4>
 <2><778>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <779>   DW_AT_type        : <0x783>
 <2><77d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <77e>   DW_AT_type        : <0x213>
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <784>   DW_AT_byte_size   : 4
    <784>   DW_AT_type        : <0x75b>
 <1><788>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <789>   DW_AT_byte_size   : 4
    <789>   DW_AT_type        : <0x765>
 <1><78d>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <78e>   DW_AT_prototyped  : 1
    <78e>   DW_AT_type        : <0x318>
    <792>   DW_AT_sibling     : <0x7ab>
 <2><796>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <797>   DW_AT_type        : <0x72c>
 <2><79b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <79c>   DW_AT_type        : <0x2d4>
 <2><7a0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7a1>   DW_AT_type        : <0x318>
 <2><7a5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7a6>   DW_AT_type        : <0x213>
 <2><7aa>: Abbrev Number: 0
 <1><7ab>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7ac>   DW_AT_byte_size   : 4
    <7ac>   DW_AT_type        : <0x78d>
 <1><7b0>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <7b1>   DW_AT_prototyped  : 1
    <7b1>   DW_AT_type        : <0x213>
    <7b5>   DW_AT_sibling     : <0x7c4>
 <2><7b9>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7ba>   DW_AT_type        : <0x72c>
 <2><7be>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7bf>   DW_AT_type        : <0x2d4>
 <2><7c3>: Abbrev Number: 0
 <1><7c4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7c5>   DW_AT_byte_size   : 4
    <7c5>   DW_AT_type        : <0x7b0>
 <1><7c9>: Abbrev Number: 9 (DW_TAG_array_type)
    <7ca>   DW_AT_type        : <0x242>
    <7ce>   DW_AT_sibling     : <0x7d9>
 <2><7d2>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7d3>   DW_AT_type        : <0x21a>
    <7d7>   DW_AT_upper_bound : 2
 <2><7d8>: Abbrev Number: 0
 <1><7d9>: Abbrev Number: 9 (DW_TAG_array_type)
    <7da>   DW_AT_type        : <0x242>
    <7de>   DW_AT_sibling     : <0x7e9>
 <2><7e2>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7e3>   DW_AT_type        : <0x21a>
    <7e7>   DW_AT_upper_bound : 0
 <2><7e8>: Abbrev Number: 0
 <1><7e9>: Abbrev Number: 15 (DW_TAG_typedef)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x5e6a9): __FILE
    <7ee>   DW_AT_decl_file   : 7
    <7ef>   DW_AT_decl_line   : 270
    <7f1>   DW_AT_decl_column : 26
    <7f2>   DW_AT_type        : <0x4d0>
 <1><7f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7f7>   DW_AT_byte_size   : 4
    <7f7>   DW_AT_type        : <0x7e9>
 <1><7fb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7fc>   DW_AT_name        : (indirect string, offset: 0x34b0e): _rand48
    <800>   DW_AT_byte_size   : 24
    <801>   DW_AT_decl_file   : 7
    <802>   DW_AT_decl_line   : 306
    <804>   DW_AT_decl_column : 8
    <805>   DW_AT_sibling     : <0x842>
 <2><809>: Abbrev Number: 2 (DW_TAG_member)
    <80a>   DW_AT_name        : (indirect string, offset: 0x2cbef): _seed
    <80e>   DW_AT_decl_file   : 7
    <80f>   DW_AT_decl_line   : 307
    <811>   DW_AT_decl_column : 18
    <812>   DW_AT_type        : <0x842>
    <816>   DW_AT_data_member_location: 0
 <2><817>: Abbrev Number: 2 (DW_TAG_member)
    <818>   DW_AT_name        : (indirect string, offset: 0xf723): _mult
    <81c>   DW_AT_decl_file   : 7
    <81d>   DW_AT_decl_line   : 308
    <81f>   DW_AT_decl_column : 18
    <820>   DW_AT_type        : <0x842>
    <824>   DW_AT_data_member_location: 6
 <2><825>: Abbrev Number: 2 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x4d2b8): _add
    <82a>   DW_AT_decl_file   : 7
    <82b>   DW_AT_decl_line   : 309
    <82d>   DW_AT_decl_column : 18
    <82e>   DW_AT_type        : <0x268>
    <832>   DW_AT_data_member_location: 12
 <2><833>: Abbrev Number: 2 (DW_TAG_member)
    <834>   DW_AT_name        : (indirect string, offset: 0x58c22): _rand_next
    <838>   DW_AT_decl_file   : 7
    <839>   DW_AT_decl_line   : 312
    <83b>   DW_AT_decl_column : 36
    <83c>   DW_AT_type        : <0x289>
    <840>   DW_AT_data_member_location: 16
 <2><841>: Abbrev Number: 0
 <1><842>: Abbrev Number: 9 (DW_TAG_array_type)
    <843>   DW_AT_type        : <0x268>
    <847>   DW_AT_sibling     : <0x852>
 <2><84b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <84c>   DW_AT_type        : <0x21a>
    <850>   DW_AT_upper_bound : 2
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 16 (DW_TAG_structure_type)
    <853>   DW_AT_name        : (indirect string, offset: 0x709ec): _mprec
    <857>   DW_AT_byte_size   : 16
    <858>   DW_AT_decl_file   : 7
    <859>   DW_AT_decl_line   : 348
    <85b>   DW_AT_decl_column : 8
    <85c>   DW_AT_sibling     : <0x899>
 <2><860>: Abbrev Number: 2 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0x93474): _result
    <865>   DW_AT_decl_file   : 7
    <866>   DW_AT_decl_line   : 351
    <868>   DW_AT_decl_column : 19
    <869>   DW_AT_type        : <0x40b>
    <86d>   DW_AT_data_member_location: 0
 <2><86e>: Abbrev Number: 2 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x70564): _result_k
    <873>   DW_AT_decl_file   : 7
    <874>   DW_AT_decl_line   : 352
    <876>   DW_AT_decl_column : 7
    <877>   DW_AT_type        : <0x213>
    <87b>   DW_AT_data_member_location: 4
 <2><87c>: Abbrev Number: 2 (DW_TAG_member)
    <87d>   DW_AT_name        : (indirect string, offset: 0x47725): _p5s
    <881>   DW_AT_decl_file   : 7
    <882>   DW_AT_decl_line   : 353
    <884>   DW_AT_decl_column : 19
    <885>   DW_AT_type        : <0x40b>
    <889>   DW_AT_data_member_location: 8
 <2><88a>: Abbrev Number: 2 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x56749): _freelist
    <88f>   DW_AT_decl_file   : 7
    <890>   DW_AT_decl_line   : 354
    <892>   DW_AT_decl_column : 20
    <893>   DW_AT_type        : <0x899>
    <897>   DW_AT_data_member_location: 12
 <2><898>: Abbrev Number: 0
 <1><899>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <89a>   DW_AT_byte_size   : 4
    <89a>   DW_AT_type        : <0x40b>
 <1><89e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <89f>   DW_AT_name        : (indirect string, offset: 0x476f5): _misc_reent
    <8a3>   DW_AT_byte_size   : 80
    <8a4>   DW_AT_decl_file   : 7
    <8a5>   DW_AT_decl_line   : 358
    <8a7>   DW_AT_decl_column : 8
    <8a8>   DW_AT_sibling     : <0x947>
 <2><8ac>: Abbrev Number: 2 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x8721e): _strtok_last
    <8b1>   DW_AT_decl_file   : 7
    <8b2>   DW_AT_decl_line   : 361
    <8b4>   DW_AT_decl_column : 9
    <8b5>   DW_AT_type        : <0x74f>
    <8b9>   DW_AT_data_member_location: 0
 <2><8ba>: Abbrev Number: 2 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x417cb): _mblen_state
    <8bf>   DW_AT_decl_file   : 7
    <8c0>   DW_AT_decl_line   : 362
    <8c2>   DW_AT_decl_column : 14
    <8c3>   DW_AT_type        : <0x377>
    <8c7>   DW_AT_data_member_location: 4
 <2><8c8>: Abbrev Number: 2 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x8724d): _wctomb_state
    <8cd>   DW_AT_decl_file   : 7
    <8ce>   DW_AT_decl_line   : 363
    <8d0>   DW_AT_decl_column : 14
    <8d1>   DW_AT_type        : <0x377>
    <8d5>   DW_AT_data_member_location: 12
 <2><8d6>: Abbrev Number: 2 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x7e393): _mbtowc_state
    <8db>   DW_AT_decl_file   : 7
    <8dc>   DW_AT_decl_line   : 364
    <8de>   DW_AT_decl_column : 14
    <8df>   DW_AT_type        : <0x377>
    <8e3>   DW_AT_data_member_location: 20
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4c0ea): _l64a_buf
    <8e9>   DW_AT_decl_file   : 7
    <8ea>   DW_AT_decl_line   : 365
    <8ec>   DW_AT_decl_column : 8
    <8ed>   DW_AT_type        : <0x947>
    <8f1>   DW_AT_data_member_location: 28
 <2><8f2>: Abbrev Number: 2 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x862e9): _getdate_err
    <8f7>   DW_AT_decl_file   : 7
    <8f8>   DW_AT_decl_line   : 366
    <8fa>   DW_AT_decl_column : 7
    <8fb>   DW_AT_type        : <0x213>
    <8ff>   DW_AT_data_member_location: 36
 <2><900>: Abbrev Number: 2 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x4865b): _mbrlen_state
    <905>   DW_AT_decl_file   : 7
    <906>   DW_AT_decl_line   : 367
    <908>   DW_AT_decl_column : 14
    <909>   DW_AT_type        : <0x377>
    <90d>   DW_AT_data_member_location: 40
 <2><90e>: Abbrev Number: 2 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x229a2): _mbrtowc_state
    <913>   DW_AT_decl_file   : 7
    <914>   DW_AT_decl_line   : 368
    <916>   DW_AT_decl_column : 14
    <917>   DW_AT_type        : <0x377>
    <91b>   DW_AT_data_member_location: 48
 <2><91c>: Abbrev Number: 2 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x62231): _mbsrtowcs_state
    <921>   DW_AT_decl_file   : 7
    <922>   DW_AT_decl_line   : 369
    <924>   DW_AT_decl_column : 14
    <925>   DW_AT_type        : <0x377>
    <929>   DW_AT_data_member_location: 56
 <2><92a>: Abbrev Number: 2 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x2f47e): _wcrtomb_state
    <92f>   DW_AT_decl_file   : 7
    <930>   DW_AT_decl_line   : 370
    <932>   DW_AT_decl_column : 14
    <933>   DW_AT_type        : <0x377>
    <937>   DW_AT_data_member_location: 64
 <2><938>: Abbrev Number: 2 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x55025): _wcsrtombs_state
    <93d>   DW_AT_decl_file   : 7
    <93e>   DW_AT_decl_line   : 371
    <940>   DW_AT_decl_column : 14
    <941>   DW_AT_type        : <0x377>
    <945>   DW_AT_data_member_location: 72
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 9 (DW_TAG_array_type)
    <948>   DW_AT_type        : <0x754>
    <94c>   DW_AT_sibling     : <0x957>
 <2><950>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <951>   DW_AT_type        : <0x21a>
    <955>   DW_AT_upper_bound : 7
 <2><956>: Abbrev Number: 0
 <1><957>: Abbrev Number: 28 (DW_TAG_structure_type)
    <958>   DW_AT_name        : (indirect string, offset: 0x7ed01): __locale_t
    <95c>   DW_AT_declaration : 1
 <1><95c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <95d>   DW_AT_byte_size   : 4
    <95d>   DW_AT_type        : <0x957>
 <1><961>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <962>   DW_AT_byte_size   : 4
    <962>   DW_AT_type        : <0x852>
 <1><966>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <967>   DW_AT_prototyped  : 1
    <967>   DW_AT_sibling     : <0x971>
 <2><96b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <96c>   DW_AT_type        : <0x72c>
 <2><970>: Abbrev Number: 0
 <1><971>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <972>   DW_AT_byte_size   : 4
    <972>   DW_AT_type        : <0x966>
 <1><976>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <977>   DW_AT_byte_size   : 4
    <977>   DW_AT_type        : <0x7fb>
 <1><97b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <97c>   DW_AT_byte_size   : 4
    <97c>   DW_AT_type        : <0x420>
 <1><980>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <981>   DW_AT_prototyped  : 1
    <981>   DW_AT_sibling     : <0x98b>
 <2><985>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <986>   DW_AT_type        : <0x213>
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <98c>   DW_AT_byte_size   : 4
    <98c>   DW_AT_type        : <0x990>
 <1><990>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <991>   DW_AT_byte_size   : 4
    <991>   DW_AT_type        : <0x980>
 <1><995>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <996>   DW_AT_byte_size   : 4
    <996>   DW_AT_type        : <0x89e>
 <1><99a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <99b>   DW_AT_name        : (indirect string, offset: 0x7bd32): xSTATIC_LIST_ITEM
    <99f>   DW_AT_byte_size   : 20
    <9a0>   DW_AT_decl_file   : 9
    <9a1>   DW_AT_decl_line   : 1061
    <9a3>   DW_AT_decl_column : 8
    <9a4>   DW_AT_sibling     : <0x9c5>
 <2><9a8>: Abbrev Number: 2 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x9df5f): xDummy2
    <9ad>   DW_AT_decl_file   : 9
    <9ae>   DW_AT_decl_line   : 1066
    <9b0>   DW_AT_decl_column : 13
    <9b1>   DW_AT_type        : <0x2ee>
    <9b5>   DW_AT_data_member_location: 0
 <2><9b6>: Abbrev Number: 2 (DW_TAG_member)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x36929): pvDummy3
    <9bb>   DW_AT_decl_file   : 9
    <9bc>   DW_AT_decl_line   : 1067
    <9be>   DW_AT_decl_column : 8
    <9bf>   DW_AT_type        : <0x9c5>
    <9c3>   DW_AT_data_member_location: 4
 <2><9c4>: Abbrev Number: 0
 <1><9c5>: Abbrev Number: 9 (DW_TAG_array_type)
    <9c6>   DW_AT_type        : <0x2d4>
    <9ca>   DW_AT_sibling     : <0x9d5>
 <2><9ce>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9cf>   DW_AT_type        : <0x21a>
    <9d3>   DW_AT_upper_bound : 3
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 15 (DW_TAG_typedef)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x36b96): StaticListItem_t
    <9da>   DW_AT_decl_file   : 9
    <9db>   DW_AT_decl_line   : 1072
    <9dd>   DW_AT_decl_column : 34
    <9de>   DW_AT_type        : <0x99a>
 <1><9e2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x55afc): xSTATIC_TCB
    <9e7>   DW_AT_byte_size   : 160
    <9e8>   DW_AT_decl_file   : 9
    <9e9>   DW_AT_decl_line   : 1112
    <9eb>   DW_AT_decl_column : 16
    <9ec>   DW_AT_sibling     : <0xa7d>
 <2><9f0>: Abbrev Number: 2 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x20826): pxDummy1
    <9f5>   DW_AT_decl_file   : 9
    <9f6>   DW_AT_decl_line   : 1114
    <9f8>   DW_AT_decl_column : 11
    <9f9>   DW_AT_type        : <0x2d4>
    <9fd>   DW_AT_data_member_location: 0
 <2><9fe>: Abbrev Number: 2 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x1ebbf): xDummy3
    <a03>   DW_AT_decl_file   : 9
    <a04>   DW_AT_decl_line   : 1118
    <a06>   DW_AT_decl_column : 19
    <a07>   DW_AT_type        : <0xa7d>
    <a0b>   DW_AT_data_member_location: 4
 <2><a0c>: Abbrev Number: 2 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x1750f): uxDummy5
    <a11>   DW_AT_decl_file   : 9
    <a12>   DW_AT_decl_line   : 1119
    <a14>   DW_AT_decl_column : 16
    <a15>   DW_AT_type        : <0x2e2>
    <a19>   DW_AT_data_member_location: 44
 <2><a1a>: Abbrev Number: 2 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x2082f): pxDummy6
    <a1f>   DW_AT_decl_file   : 9
    <a20>   DW_AT_decl_line   : 1120
    <a22>   DW_AT_decl_column : 11
    <a23>   DW_AT_type        : <0x2d4>
    <a27>   DW_AT_data_member_location: 48
 <2><a28>: Abbrev Number: 2 (DW_TAG_member)
    <a29>   DW_AT_name        : (indirect string, offset: 0x35935): ucDummy7
    <a2d>   DW_AT_decl_file   : 9
    <a2e>   DW_AT_decl_line   : 1121
    <a30>   DW_AT_decl_column : 13
    <a31>   DW_AT_type        : <0xa8d>
    <a35>   DW_AT_data_member_location: 52
 <2><a36>: Abbrev Number: 2 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x85aca): uxDummy12
    <a3b>   DW_AT_decl_file   : 9
    <a3c>   DW_AT_decl_line   : 1132
    <a3e>   DW_AT_decl_column : 16
    <a3f>   DW_AT_type        : <0xa9d>
    <a43>   DW_AT_data_member_location: 68
 <2><a44>: Abbrev Number: 2 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0x7672f): xDummy17
    <a49>   DW_AT_decl_file   : 9
    <a4a>   DW_AT_decl_line   : 1144
    <a4c>   DW_AT_decl_column : 17
    <a4d>   DW_AT_type        : <0x613>
    <a51>   DW_AT_data_member_location: 76
 <2><a52>: Abbrev Number: 2 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0x1840f): ulDummy18
    <a57>   DW_AT_decl_file   : 9
    <a58>   DW_AT_decl_line   : 1147
    <a5a>   DW_AT_decl_column : 14
    <a5b>   DW_AT_type        : <0x2c3>
    <a5f>   DW_AT_data_member_location: 152
 <2><a60>: Abbrev Number: 2 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x912df): ucDummy19
    <a65>   DW_AT_decl_file   : 9
    <a66>   DW_AT_decl_line   : 1148
    <a68>   DW_AT_decl_column : 13
    <a69>   DW_AT_type        : <0x290>
    <a6d>   DW_AT_data_member_location: 156
 <2><a6e>: Abbrev Number: 2 (DW_TAG_member)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x85e34): uxDummy20
    <a73>   DW_AT_decl_file   : 9
    <a74>   DW_AT_decl_line   : 1151
    <a76>   DW_AT_decl_column : 13
    <a77>   DW_AT_type        : <0x290>
    <a7b>   DW_AT_data_member_location: 157
 <2><a7c>: Abbrev Number: 0
 <1><a7d>: Abbrev Number: 9 (DW_TAG_array_type)
    <a7e>   DW_AT_type        : <0x9d5>
    <a82>   DW_AT_sibling     : <0xa8d>
 <2><a86>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a87>   DW_AT_type        : <0x21a>
    <a8b>   DW_AT_upper_bound : 1
 <2><a8c>: Abbrev Number: 0
 <1><a8d>: Abbrev Number: 9 (DW_TAG_array_type)
    <a8e>   DW_AT_type        : <0x290>
    <a92>   DW_AT_sibling     : <0xa9d>
 <2><a96>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a97>   DW_AT_type        : <0x21a>
    <a9b>   DW_AT_upper_bound : 15
 <2><a9c>: Abbrev Number: 0
 <1><a9d>: Abbrev Number: 9 (DW_TAG_array_type)
    <a9e>   DW_AT_type        : <0x2e2>
    <aa2>   DW_AT_sibling     : <0xaad>
 <2><aa6>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <aa7>   DW_AT_type        : <0x21a>
    <aab>   DW_AT_upper_bound : 1
 <2><aac>: Abbrev Number: 0
 <1><aad>: Abbrev Number: 15 (DW_TAG_typedef)
    <aae>   DW_AT_name        : (indirect string, offset: 0x4a3de): StaticTask_t
    <ab2>   DW_AT_decl_file   : 9
    <ab3>   DW_AT_decl_line   : 1160
    <ab5>   DW_AT_decl_column : 3
    <ab6>   DW_AT_type        : <0x9e2>
 <1><aba>: Abbrev Number: 9 (DW_TAG_array_type)
    <abb>   DW_AT_type        : <0x290>
    <abf>   DW_AT_sibling     : <0xaca>
 <2><ac3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ac4>   DW_AT_type        : <0x21a>
    <ac8>   DW_AT_upper_bound : 1
 <2><ac9>: Abbrev Number: 0
 <1><aca>: Abbrev Number: 7 (DW_TAG_typedef)
    <acb>   DW_AT_name        : (indirect string, offset: 0x809fa): TaskHandle_t
    <acf>   DW_AT_decl_file   : 10
    <ad0>   DW_AT_decl_line   : 70
    <ad1>   DW_AT_decl_column : 37
    <ad2>   DW_AT_type        : <0xad6>
 <1><ad6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ad7>   DW_AT_byte_size   : 4
    <ad7>   DW_AT_type        : <0xadb>
 <1><adb>: Abbrev Number: 28 (DW_TAG_structure_type)
    <adc>   DW_AT_name        : (indirect string, offset: 0x7dcf5): tskTaskControlBlock
    <ae0>   DW_AT_declaration : 1
 <1><ae0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ae1>   DW_AT_byte_size   : 4
    <ae1>   DW_AT_type        : <0x2d6>
 <1><ae5>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ae6>   DW_AT_byte_size   : 24
    <ae7>   DW_AT_decl_file   : 11
    <ae8>   DW_AT_decl_line   : 214
    <ae9>   DW_AT_decl_column : 9
    <ae9>   DW_AT_sibling     : <0xb3b>
 <2><aed>: Abbrev Number: 11 (DW_TAG_member)
    <aee>   DW_AT_name        : CR
    <af1>   DW_AT_decl_file   : 11
    <af2>   DW_AT_decl_line   : 216
    <af3>   DW_AT_decl_column : 17
    <af4>   DW_AT_type        : <0x2cf>
    <af8>   DW_AT_data_member_location: 0
 <2><af9>: Abbrev Number: 1 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x49715): NDTR
    <afe>   DW_AT_decl_file   : 11
    <aff>   DW_AT_decl_line   : 217
    <b00>   DW_AT_decl_column : 17
    <b01>   DW_AT_type        : <0x2cf>
    <b05>   DW_AT_data_member_location: 4
 <2><b06>: Abbrev Number: 11 (DW_TAG_member)
    <b07>   DW_AT_name        : PAR
    <b0b>   DW_AT_decl_file   : 11
    <b0c>   DW_AT_decl_line   : 218
    <b0d>   DW_AT_decl_column : 17
    <b0e>   DW_AT_type        : <0x2cf>
    <b12>   DW_AT_data_member_location: 8
 <2><b13>: Abbrev Number: 1 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x3e6ef): M0AR
    <b18>   DW_AT_decl_file   : 11
    <b19>   DW_AT_decl_line   : 219
    <b1a>   DW_AT_decl_column : 17
    <b1b>   DW_AT_type        : <0x2cf>
    <b1f>   DW_AT_data_member_location: 12
 <2><b20>: Abbrev Number: 1 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0x53002): M1AR
    <b25>   DW_AT_decl_file   : 11
    <b26>   DW_AT_decl_line   : 220
    <b27>   DW_AT_decl_column : 17
    <b28>   DW_AT_type        : <0x2cf>
    <b2c>   DW_AT_data_member_location: 16
 <2><b2d>: Abbrev Number: 11 (DW_TAG_member)
    <b2e>   DW_AT_name        : FCR
    <b32>   DW_AT_decl_file   : 11
    <b33>   DW_AT_decl_line   : 221
    <b34>   DW_AT_decl_column : 17
    <b35>   DW_AT_type        : <0x2cf>
    <b39>   DW_AT_data_member_location: 20
 <2><b3a>: Abbrev Number: 0
 <1><b3b>: Abbrev Number: 7 (DW_TAG_typedef)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x864d5): DMA_Stream_TypeDef
    <b40>   DW_AT_decl_file   : 11
    <b41>   DW_AT_decl_line   : 222
    <b42>   DW_AT_decl_column : 3
    <b43>   DW_AT_type        : <0xae5>
 <1><b47>: Abbrev Number: 42 (DW_TAG_structure_type)
    <b48>   DW_AT_byte_size   : 40
    <b49>   DW_AT_decl_file   : 11
    <b4a>   DW_AT_decl_line   : 295
    <b4c>   DW_AT_decl_column : 9
    <b4d>   DW_AT_sibling     : <0xbdd>
 <2><b51>: Abbrev Number: 17 (DW_TAG_member)
    <b52>   DW_AT_name        : CR1
    <b56>   DW_AT_decl_file   : 11
    <b57>   DW_AT_decl_line   : 297
    <b59>   DW_AT_decl_column : 17
    <b5a>   DW_AT_type        : <0x2cf>
    <b5e>   DW_AT_data_member_location: 0
 <2><b5f>: Abbrev Number: 17 (DW_TAG_member)
    <b60>   DW_AT_name        : CR2
    <b64>   DW_AT_decl_file   : 11
    <b65>   DW_AT_decl_line   : 298
    <b67>   DW_AT_decl_column : 17
    <b68>   DW_AT_type        : <0x2cf>
    <b6c>   DW_AT_data_member_location: 4
 <2><b6d>: Abbrev Number: 2 (DW_TAG_member)
    <b6e>   DW_AT_name        : (indirect string, offset: 0x18ad3): OAR1
    <b72>   DW_AT_decl_file   : 11
    <b73>   DW_AT_decl_line   : 299
    <b75>   DW_AT_decl_column : 17
    <b76>   DW_AT_type        : <0x2cf>
    <b7a>   DW_AT_data_member_location: 8
 <2><b7b>: Abbrev Number: 2 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x18ad8): OAR2
    <b80>   DW_AT_decl_file   : 11
    <b81>   DW_AT_decl_line   : 300
    <b83>   DW_AT_decl_column : 17
    <b84>   DW_AT_type        : <0x2cf>
    <b88>   DW_AT_data_member_location: 12
 <2><b89>: Abbrev Number: 17 (DW_TAG_member)
    <b8a>   DW_AT_name        : DR
    <b8d>   DW_AT_decl_file   : 11
    <b8e>   DW_AT_decl_line   : 301
    <b90>   DW_AT_decl_column : 17
    <b91>   DW_AT_type        : <0x2cf>
    <b95>   DW_AT_data_member_location: 16
 <2><b96>: Abbrev Number: 17 (DW_TAG_member)
    <b97>   DW_AT_name        : SR1
    <b9b>   DW_AT_decl_file   : 11
    <b9c>   DW_AT_decl_line   : 302
    <b9e>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0x2cf>
    <ba3>   DW_AT_data_member_location: 20
 <2><ba4>: Abbrev Number: 17 (DW_TAG_member)
    <ba5>   DW_AT_name        : SR2
    <ba9>   DW_AT_decl_file   : 11
    <baa>   DW_AT_decl_line   : 303
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0x2cf>
    <bb1>   DW_AT_data_member_location: 24
 <2><bb2>: Abbrev Number: 17 (DW_TAG_member)
    <bb3>   DW_AT_name        : CCR
    <bb7>   DW_AT_decl_file   : 11
    <bb8>   DW_AT_decl_line   : 304
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0x2cf>
    <bbf>   DW_AT_data_member_location: 28
 <2><bc0>: Abbrev Number: 2 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x4cfd6): TRISE
    <bc5>   DW_AT_decl_file   : 11
    <bc6>   DW_AT_decl_line   : 305
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0x2cf>
    <bcd>   DW_AT_data_member_location: 32
 <2><bce>: Abbrev Number: 2 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x4c03): FLTR
    <bd3>   DW_AT_decl_file   : 11
    <bd4>   DW_AT_decl_line   : 306
    <bd6>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0x2cf>
    <bdb>   DW_AT_data_member_location: 36
 <2><bdc>: Abbrev Number: 0
 <1><bdd>: Abbrev Number: 15 (DW_TAG_typedef)
    <bde>   DW_AT_name        : (indirect string, offset: 0x17305): I2C_TypeDef
    <be2>   DW_AT_decl_file   : 11
    <be3>   DW_AT_decl_line   : 307
    <be5>   DW_AT_decl_column : 3
    <be6>   DW_AT_type        : <0xb47>
 <1><bea>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <beb>   DW_AT_encoding    : 7	(unsigned)
    <bec>   DW_AT_byte_size   : 1
    <bed>   DW_AT_type        : <0x242>
    <bf1>   DW_AT_decl_file   : 12
    <bf2>   DW_AT_decl_line   : 39
    <bf3>   DW_AT_decl_column : 1
    <bf4>   DW_AT_sibling     : <0xc11>
 <2><bf8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x33797): HAL_OK
    <bfd>   DW_AT_const_value : 0
 <2><bfe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x5d00f): HAL_ERROR
    <c03>   DW_AT_const_value : 1
 <2><c04>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x7bd29): HAL_BUSY
    <c09>   DW_AT_const_value : 2
 <2><c0a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x2cfe5): HAL_TIMEOUT
    <c0f>   DW_AT_const_value : 3
 <2><c10>: Abbrev Number: 0
 <1><c11>: Abbrev Number: 7 (DW_TAG_typedef)
    <c12>   DW_AT_name        : (indirect string, offset: 0x55d7): HAL_StatusTypeDef
    <c16>   DW_AT_decl_file   : 12
    <c17>   DW_AT_decl_line   : 44
    <c18>   DW_AT_decl_column : 3
    <c19>   DW_AT_type        : <0xbea>
 <1><c1d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <c1e>   DW_AT_encoding    : 7	(unsigned)
    <c1f>   DW_AT_byte_size   : 1
    <c20>   DW_AT_type        : <0x242>
    <c24>   DW_AT_decl_file   : 12
    <c25>   DW_AT_decl_line   : 50
    <c26>   DW_AT_decl_column : 1
    <c27>   DW_AT_sibling     : <0xc38>
 <2><c2b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x6d8d8): HAL_UNLOCKED
    <c30>   DW_AT_const_value : 0
 <2><c31>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c32>   DW_AT_name        : (indirect string, offset: 0x937b8): HAL_LOCKED
    <c36>   DW_AT_const_value : 1
 <2><c37>: Abbrev Number: 0
 <1><c38>: Abbrev Number: 7 (DW_TAG_typedef)
    <c39>   DW_AT_name        : (indirect string, offset: 0x5aaf4): HAL_LockTypeDef
    <c3d>   DW_AT_decl_file   : 12
    <c3e>   DW_AT_decl_line   : 53
    <c3f>   DW_AT_decl_column : 3
    <c40>   DW_AT_type        : <0xc1d>
 <1><c44>: Abbrev Number: 20 (DW_TAG_structure_type)
    <c45>   DW_AT_byte_size   : 48
    <c46>   DW_AT_decl_file   : 13
    <c47>   DW_AT_decl_line   : 48
    <c48>   DW_AT_decl_column : 9
    <c48>   DW_AT_sibling     : <0xce9>
 <2><c4c>: Abbrev Number: 1 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x94bc9): Channel
    <c51>   DW_AT_decl_file   : 13
    <c52>   DW_AT_decl_line   : 50
    <c53>   DW_AT_decl_column : 12
    <c54>   DW_AT_type        : <0x2c3>
    <c58>   DW_AT_data_member_location: 0
 <2><c59>: Abbrev Number: 1 (DW_TAG_member)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x993e6): Direction
    <c5e>   DW_AT_decl_file   : 13
    <c5f>   DW_AT_decl_line   : 53
    <c60>   DW_AT_decl_column : 12
    <c61>   DW_AT_type        : <0x2c3>
    <c65>   DW_AT_data_member_location: 4
 <2><c66>: Abbrev Number: 1 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0xd18b): PeriphInc
    <c6b>   DW_AT_decl_file   : 13
    <c6c>   DW_AT_decl_line   : 57
    <c6d>   DW_AT_decl_column : 12
    <c6e>   DW_AT_type        : <0x2c3>
    <c72>   DW_AT_data_member_location: 8
 <2><c73>: Abbrev Number: 1 (DW_TAG_member)
    <c74>   DW_AT_name        : (indirect string, offset: 0x1a1d0): MemInc
    <c78>   DW_AT_decl_file   : 13
    <c79>   DW_AT_decl_line   : 60
    <c7a>   DW_AT_decl_column : 12
    <c7b>   DW_AT_type        : <0x2c3>
    <c7f>   DW_AT_data_member_location: 12
 <2><c80>: Abbrev Number: 1 (DW_TAG_member)
    <c81>   DW_AT_name        : (indirect string, offset: 0x4aa8f): PeriphDataAlignment
    <c85>   DW_AT_decl_file   : 13
    <c86>   DW_AT_decl_line   : 63
    <c87>   DW_AT_decl_column : 12
    <c88>   DW_AT_type        : <0x2c3>
    <c8c>   DW_AT_data_member_location: 16
 <2><c8d>: Abbrev Number: 1 (DW_TAG_member)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x85c80): MemDataAlignment
    <c92>   DW_AT_decl_file   : 13
    <c93>   DW_AT_decl_line   : 66
    <c94>   DW_AT_decl_column : 12
    <c95>   DW_AT_type        : <0x2c3>
    <c99>   DW_AT_data_member_location: 20
 <2><c9a>: Abbrev Number: 1 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x9a47c): Mode
    <c9f>   DW_AT_decl_file   : 13
    <ca0>   DW_AT_decl_line   : 69
    <ca1>   DW_AT_decl_column : 12
    <ca2>   DW_AT_type        : <0x2c3>
    <ca6>   DW_AT_data_member_location: 24
 <2><ca7>: Abbrev Number: 1 (DW_TAG_member)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x980b7): Priority
    <cac>   DW_AT_decl_file   : 13
    <cad>   DW_AT_decl_line   : 74
    <cae>   DW_AT_decl_column : 12
    <caf>   DW_AT_type        : <0x2c3>
    <cb3>   DW_AT_data_member_location: 28
 <2><cb4>: Abbrev Number: 1 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x40dfc): FIFOMode
    <cb9>   DW_AT_decl_file   : 13
    <cba>   DW_AT_decl_line   : 77
    <cbb>   DW_AT_decl_column : 12
    <cbc>   DW_AT_type        : <0x2c3>
    <cc0>   DW_AT_data_member_location: 32
 <2><cc1>: Abbrev Number: 1 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x709f3): FIFOThreshold
    <cc6>   DW_AT_decl_file   : 13
    <cc7>   DW_AT_decl_line   : 82
    <cc8>   DW_AT_decl_column : 12
    <cc9>   DW_AT_type        : <0x2c3>
    <ccd>   DW_AT_data_member_location: 36
 <2><cce>: Abbrev Number: 1 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x6f33b): MemBurst
    <cd3>   DW_AT_decl_file   : 13
    <cd4>   DW_AT_decl_line   : 85
    <cd5>   DW_AT_decl_column : 12
    <cd6>   DW_AT_type        : <0x2c3>
    <cda>   DW_AT_data_member_location: 40
 <2><cdb>: Abbrev Number: 1 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x3406c): PeriphBurst
    <ce0>   DW_AT_decl_file   : 13
    <ce1>   DW_AT_decl_line   : 91
    <ce2>   DW_AT_decl_column : 12
    <ce3>   DW_AT_type        : <0x2c3>
    <ce7>   DW_AT_data_member_location: 44
 <2><ce8>: Abbrev Number: 0
 <1><ce9>: Abbrev Number: 7 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x298fc): DMA_InitTypeDef
    <cee>   DW_AT_decl_file   : 13
    <cef>   DW_AT_decl_line   : 96
    <cf0>   DW_AT_decl_column : 2
    <cf1>   DW_AT_type        : <0xc44>
 <1><cf5>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <cf6>   DW_AT_encoding    : 7	(unsigned)
    <cf7>   DW_AT_byte_size   : 1
    <cf8>   DW_AT_type        : <0x242>
    <cfc>   DW_AT_decl_file   : 13
    <cfd>   DW_AT_decl_line   : 103
    <cfe>   DW_AT_decl_column : 1
    <cff>   DW_AT_sibling     : <0xd28>
 <2><d03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d04>   DW_AT_name        : (indirect string, offset: 0x6e8ea): HAL_DMA_STATE_RESET
    <d08>   DW_AT_const_value : 0
 <2><d09>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x2a7a8): HAL_DMA_STATE_READY
    <d0e>   DW_AT_const_value : 1
 <2><d0f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d10>   DW_AT_name        : (indirect string, offset: 0x66903): HAL_DMA_STATE_BUSY
    <d14>   DW_AT_const_value : 2
 <2><d15>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d16>   DW_AT_name        : (indirect string, offset: 0x915f7): HAL_DMA_STATE_TIMEOUT
    <d1a>   DW_AT_const_value : 3
 <2><d1b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x7ea4d): HAL_DMA_STATE_ERROR
    <d20>   DW_AT_const_value : 4
 <2><d21>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d22>   DW_AT_name        : (indirect string, offset: 0x23dca): HAL_DMA_STATE_ABORT
    <d26>   DW_AT_const_value : 5
 <2><d27>: Abbrev Number: 0
 <1><d28>: Abbrev Number: 7 (DW_TAG_typedef)
    <d29>   DW_AT_name        : (indirect string, offset: 0x52c9f): HAL_DMA_StateTypeDef
    <d2d>   DW_AT_decl_file   : 13
    <d2e>   DW_AT_decl_line   : 110
    <d2f>   DW_AT_decl_column : 2
    <d30>   DW_AT_type        : <0xcf5>
 <1><d34>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <d35>   DW_AT_type        : <0xd28>
 <1><d39>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x7df13): __DMA_HandleTypeDef
    <d3e>   DW_AT_byte_size   : 96
    <d3f>   DW_AT_decl_file   : 13
    <d40>   DW_AT_decl_line   : 138
    <d41>   DW_AT_decl_column : 16
    <d42>   DW_AT_sibling     : <0xdfd>
 <2><d46>: Abbrev Number: 1 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x3a809): Instance
    <d4b>   DW_AT_decl_file   : 13
    <d4c>   DW_AT_decl_line   : 140
    <d4d>   DW_AT_decl_column : 31
    <d4e>   DW_AT_type        : <0xdfd>
    <d52>   DW_AT_data_member_location: 0
 <2><d53>: Abbrev Number: 1 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0x948c9): Init
    <d58>   DW_AT_decl_file   : 13
    <d59>   DW_AT_decl_line   : 142
    <d5a>   DW_AT_decl_column : 30
    <d5b>   DW_AT_type        : <0xce9>
    <d5f>   DW_AT_data_member_location: 4
 <2><d60>: Abbrev Number: 1 (DW_TAG_member)
    <d61>   DW_AT_name        : (indirect string, offset: 0x697d0): Lock
    <d65>   DW_AT_decl_file   : 13
    <d66>   DW_AT_decl_line   : 144
    <d67>   DW_AT_decl_column : 30
    <d68>   DW_AT_type        : <0xc38>
    <d6c>   DW_AT_data_member_location: 52
 <2><d6d>: Abbrev Number: 1 (DW_TAG_member)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x98958): State
    <d72>   DW_AT_decl_file   : 13
    <d73>   DW_AT_decl_line   : 146
    <d74>   DW_AT_decl_column : 30
    <d75>   DW_AT_type        : <0xd34>
    <d79>   DW_AT_data_member_location: 53
 <2><d7a>: Abbrev Number: 1 (DW_TAG_member)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x8c960): Parent
    <d7f>   DW_AT_decl_file   : 13
    <d80>   DW_AT_decl_line   : 148
    <d81>   DW_AT_decl_column : 31
    <d82>   DW_AT_type        : <0x2d4>
    <d86>   DW_AT_data_member_location: 56
 <2><d87>: Abbrev Number: 1 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0x93122): XferCpltCallback
    <d8c>   DW_AT_decl_file   : 13
    <d8d>   DW_AT_decl_line   : 150
    <d8e>   DW_AT_decl_column : 33
    <d8f>   DW_AT_type        : <0xe12>
    <d93>   DW_AT_data_member_location: 60
 <2><d94>: Abbrev Number: 1 (DW_TAG_member)
    <d95>   DW_AT_name        : (indirect string, offset: 0x7347d): XferHalfCpltCallback
    <d99>   DW_AT_decl_file   : 13
    <d9a>   DW_AT_decl_line   : 152
    <d9b>   DW_AT_decl_column : 33
    <d9c>   DW_AT_type        : <0xe12>
    <da0>   DW_AT_data_member_location: 64
 <2><da1>: Abbrev Number: 1 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0x25754): XferM1CpltCallback
    <da6>   DW_AT_decl_file   : 13
    <da7>   DW_AT_decl_line   : 154
    <da8>   DW_AT_decl_column : 33
    <da9>   DW_AT_type        : <0xe12>
    <dad>   DW_AT_data_member_location: 68
 <2><dae>: Abbrev Number: 1 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0x52ea0): XferM1HalfCpltCallback
    <db3>   DW_AT_decl_file   : 13
    <db4>   DW_AT_decl_line   : 156
    <db5>   DW_AT_decl_column : 33
    <db6>   DW_AT_type        : <0xe12>
    <dba>   DW_AT_data_member_location: 72
 <2><dbb>: Abbrev Number: 1 (DW_TAG_member)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x182c1): XferErrorCallback
    <dc0>   DW_AT_decl_file   : 13
    <dc1>   DW_AT_decl_line   : 158
    <dc2>   DW_AT_decl_column : 33
    <dc3>   DW_AT_type        : <0xe12>
    <dc7>   DW_AT_data_member_location: 76
 <2><dc8>: Abbrev Number: 1 (DW_TAG_member)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x8a185): XferAbortCallback
    <dcd>   DW_AT_decl_file   : 13
    <dce>   DW_AT_decl_line   : 160
    <dcf>   DW_AT_decl_column : 33
    <dd0>   DW_AT_type        : <0xe12>
    <dd4>   DW_AT_data_member_location: 80
 <2><dd5>: Abbrev Number: 1 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x90838): ErrorCode
    <dda>   DW_AT_decl_file   : 13
    <ddb>   DW_AT_decl_line   : 162
    <ddc>   DW_AT_decl_column : 30
    <ddd>   DW_AT_type        : <0x2cf>
    <de1>   DW_AT_data_member_location: 84
 <2><de2>: Abbrev Number: 1 (DW_TAG_member)
    <de3>   DW_AT_name        : (indirect string, offset: 0x6fd82): StreamBaseAddress
    <de7>   DW_AT_decl_file   : 13
    <de8>   DW_AT_decl_line   : 164
    <de9>   DW_AT_decl_column : 30
    <dea>   DW_AT_type        : <0x2c3>
    <dee>   DW_AT_data_member_location: 88
 <2><def>: Abbrev Number: 1 (DW_TAG_member)
    <df0>   DW_AT_name        : (indirect string, offset: 0x7c897): StreamIndex
    <df4>   DW_AT_decl_file   : 13
    <df5>   DW_AT_decl_line   : 166
    <df6>   DW_AT_decl_column : 30
    <df7>   DW_AT_type        : <0x2c3>
    <dfb>   DW_AT_data_member_location: 92
 <2><dfc>: Abbrev Number: 0
 <1><dfd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dfe>   DW_AT_byte_size   : 4
    <dfe>   DW_AT_type        : <0xb3b>
 <1><e02>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <e03>   DW_AT_prototyped  : 1
    <e03>   DW_AT_sibling     : <0xe0d>
 <2><e07>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e08>   DW_AT_type        : <0xe0d>
 <2><e0c>: Abbrev Number: 0
 <1><e0d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e0e>   DW_AT_byte_size   : 4
    <e0e>   DW_AT_type        : <0xd39>
 <1><e12>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e13>   DW_AT_byte_size   : 4
    <e13>   DW_AT_type        : <0xe02>
 <1><e17>: Abbrev Number: 7 (DW_TAG_typedef)
    <e18>   DW_AT_name        : (indirect string, offset: 0x7df15): DMA_HandleTypeDef
    <e1c>   DW_AT_decl_file   : 13
    <e1d>   DW_AT_decl_line   : 168
    <e1e>   DW_AT_decl_column : 2
    <e1f>   DW_AT_type        : <0xd39>
 <1><e23>: Abbrev Number: 20 (DW_TAG_structure_type)
    <e24>   DW_AT_byte_size   : 32
    <e25>   DW_AT_decl_file   : 14
    <e26>   DW_AT_decl_line   : 47
    <e27>   DW_AT_decl_column : 9
    <e27>   DW_AT_sibling     : <0xe94>
 <2><e2b>: Abbrev Number: 1 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x8b801): ClockSpeed
    <e30>   DW_AT_decl_file   : 14
    <e31>   DW_AT_decl_line   : 49
    <e32>   DW_AT_decl_column : 12
    <e33>   DW_AT_type        : <0x2c3>
    <e37>   DW_AT_data_member_location: 0
 <2><e38>: Abbrev Number: 1 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0x5a49c): DutyCycle
    <e3d>   DW_AT_decl_file   : 14
    <e3e>   DW_AT_decl_line   : 52
    <e3f>   DW_AT_decl_column : 12
    <e40>   DW_AT_type        : <0x2c3>
    <e44>   DW_AT_data_member_location: 4
 <2><e45>: Abbrev Number: 1 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x36739): OwnAddress1
    <e4a>   DW_AT_decl_file   : 14
    <e4b>   DW_AT_decl_line   : 55
    <e4c>   DW_AT_decl_column : 12
    <e4d>   DW_AT_type        : <0x2c3>
    <e51>   DW_AT_data_member_location: 8
 <2><e52>: Abbrev Number: 1 (DW_TAG_member)
    <e53>   DW_AT_name        : (indirect string, offset: 0x3fec1): AddressingMode
    <e57>   DW_AT_decl_file   : 14
    <e58>   DW_AT_decl_line   : 58
    <e59>   DW_AT_decl_column : 12
    <e5a>   DW_AT_type        : <0x2c3>
    <e5e>   DW_AT_data_member_location: 12
 <2><e5f>: Abbrev Number: 1 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0x6a4d7): DualAddressMode
    <e64>   DW_AT_decl_file   : 14
    <e65>   DW_AT_decl_line   : 61
    <e66>   DW_AT_decl_column : 12
    <e67>   DW_AT_type        : <0x2c3>
    <e6b>   DW_AT_data_member_location: 16
 <2><e6c>: Abbrev Number: 1 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x36745): OwnAddress2
    <e71>   DW_AT_decl_file   : 14
    <e72>   DW_AT_decl_line   : 64
    <e73>   DW_AT_decl_column : 12
    <e74>   DW_AT_type        : <0x2c3>
    <e78>   DW_AT_data_member_location: 20
 <2><e79>: Abbrev Number: 1 (DW_TAG_member)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x1afc0): GeneralCallMode
    <e7e>   DW_AT_decl_file   : 14
    <e7f>   DW_AT_decl_line   : 67
    <e80>   DW_AT_decl_column : 12
    <e81>   DW_AT_type        : <0x2c3>
    <e85>   DW_AT_data_member_location: 24
 <2><e86>: Abbrev Number: 1 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0x2eff2): NoStretchMode
    <e8b>   DW_AT_decl_file   : 14
    <e8c>   DW_AT_decl_line   : 70
    <e8d>   DW_AT_decl_column : 12
    <e8e>   DW_AT_type        : <0x2c3>
    <e92>   DW_AT_data_member_location: 28
 <2><e93>: Abbrev Number: 0
 <1><e94>: Abbrev Number: 7 (DW_TAG_typedef)
    <e95>   DW_AT_name        : (indirect string, offset: 0x30bfe): I2C_InitTypeDef
    <e99>   DW_AT_decl_file   : 14
    <e9a>   DW_AT_decl_line   : 73
    <e9b>   DW_AT_decl_column : 3
    <e9c>   DW_AT_type        : <0xe23>
 <1><ea0>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <ea1>   DW_AT_encoding    : 7	(unsigned)
    <ea2>   DW_AT_byte_size   : 1
    <ea3>   DW_AT_type        : <0x242>
    <ea7>   DW_AT_decl_file   : 14
    <ea8>   DW_AT_decl_line   : 107
    <ea9>   DW_AT_decl_column : 1
    <eaa>   DW_AT_sibling     : <0xef1>
 <2><eae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x75d73): HAL_I2C_STATE_RESET
    <eb3>   DW_AT_const_value : 0
 <2><eb4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x3199c): HAL_I2C_STATE_READY
    <eb9>   DW_AT_const_value : 32
 <2><eba>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x2c7df): HAL_I2C_STATE_BUSY
    <ebf>   DW_AT_const_value : 36
 <2><ec0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x60d31): HAL_I2C_STATE_BUSY_TX
    <ec5>   DW_AT_const_value : 33
 <2><ec6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x35d21): HAL_I2C_STATE_BUSY_RX
    <ecb>   DW_AT_const_value : 34
 <2><ecc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x3b59a): HAL_I2C_STATE_LISTEN
    <ed1>   DW_AT_const_value : 40
 <2><ed2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x25a2a): HAL_I2C_STATE_BUSY_TX_LISTEN
    <ed7>   DW_AT_const_value : 41
 <2><ed8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x7713f): HAL_I2C_STATE_BUSY_RX_LISTEN
    <edd>   DW_AT_const_value : 42
 <2><ede>: Abbrev Number: 4 (DW_TAG_enumerator)
    <edf>   DW_AT_name        : (indirect string, offset: 0x2abe0): HAL_I2C_STATE_ABORT
    <ee3>   DW_AT_const_value : 96
 <2><ee4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x7bb26): HAL_I2C_STATE_TIMEOUT
    <ee9>   DW_AT_const_value : 160
 <2><eea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x86243): HAL_I2C_STATE_ERROR
    <eef>   DW_AT_const_value : 224
 <2><ef0>: Abbrev Number: 0
 <1><ef1>: Abbrev Number: 7 (DW_TAG_typedef)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x1b92c): HAL_I2C_StateTypeDef
    <ef6>   DW_AT_decl_file   : 14
    <ef7>   DW_AT_decl_line   : 122
    <ef8>   DW_AT_decl_column : 3
    <ef9>   DW_AT_type        : <0xea0>
 <1><efd>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <efe>   DW_AT_type        : <0xef1>
 <1><f02>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <f03>   DW_AT_encoding    : 7	(unsigned)
    <f04>   DW_AT_byte_size   : 1
    <f05>   DW_AT_type        : <0x242>
    <f09>   DW_AT_decl_file   : 14
    <f0a>   DW_AT_decl_line   : 147
    <f0b>   DW_AT_decl_column : 1
    <f0c>   DW_AT_sibling     : <0xf29>
 <2><f10>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f11>   DW_AT_name        : (indirect string, offset: 0x28816): HAL_I2C_MODE_NONE
    <f15>   DW_AT_const_value : 0
 <2><f16>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f17>   DW_AT_name        : (indirect string, offset: 0x6413): HAL_I2C_MODE_MASTER
    <f1b>   DW_AT_const_value : 16
 <2><f1c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1d>   DW_AT_name        : (indirect string, offset: 0xfa99): HAL_I2C_MODE_SLAVE
    <f21>   DW_AT_const_value : 32
 <2><f22>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f23>   DW_AT_name        : (indirect string, offset: 0x306a9): HAL_I2C_MODE_MEM
    <f27>   DW_AT_const_value : 64
 <2><f28>: Abbrev Number: 0
 <1><f29>: Abbrev Number: 7 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x48cd9): HAL_I2C_ModeTypeDef
    <f2e>   DW_AT_decl_file   : 14
    <f2f>   DW_AT_decl_line   : 153
    <f30>   DW_AT_decl_column : 3
    <f31>   DW_AT_type        : <0xf02>
 <1><f35>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <f36>   DW_AT_type        : <0xf29>
 <1><f3a>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f3b>   DW_AT_byte_size   : 84
    <f3c>   DW_AT_decl_file   : 14
    <f3d>   DW_AT_decl_line   : 187
    <f3e>   DW_AT_decl_column : 9
    <f3e>   DW_AT_sibling     : <0x1020>
 <2><f42>: Abbrev Number: 1 (DW_TAG_member)
    <f43>   DW_AT_name        : (indirect string, offset: 0x3a809): Instance
    <f47>   DW_AT_decl_file   : 14
    <f48>   DW_AT_decl_line   : 190
    <f49>   DW_AT_decl_column : 31
    <f4a>   DW_AT_type        : <0x1020>
    <f4e>   DW_AT_data_member_location: 0
 <2><f4f>: Abbrev Number: 1 (DW_TAG_member)
    <f50>   DW_AT_name        : (indirect string, offset: 0x948c9): Init
    <f54>   DW_AT_decl_file   : 14
    <f55>   DW_AT_decl_line   : 192
    <f56>   DW_AT_decl_column : 30
    <f57>   DW_AT_type        : <0xe94>
    <f5b>   DW_AT_data_member_location: 4
 <2><f5c>: Abbrev Number: 1 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x10e5a): pBuffPtr
    <f61>   DW_AT_decl_file   : 14
    <f62>   DW_AT_decl_line   : 194
    <f63>   DW_AT_decl_column : 31
    <f64>   DW_AT_type        : <0x2fa>
    <f68>   DW_AT_data_member_location: 36
 <2><f69>: Abbrev Number: 1 (DW_TAG_member)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x9ba5d): XferSize
    <f6e>   DW_AT_decl_file   : 14
    <f6f>   DW_AT_decl_line   : 196
    <f70>   DW_AT_decl_column : 30
    <f71>   DW_AT_type        : <0x2ad>
    <f75>   DW_AT_data_member_location: 40
 <2><f76>: Abbrev Number: 1 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x98a7a): XferCount
    <f7b>   DW_AT_decl_file   : 14
    <f7c>   DW_AT_decl_line   : 198
    <f7d>   DW_AT_decl_column : 30
    <f7e>   DW_AT_type        : <0x2b9>
    <f82>   DW_AT_data_member_location: 42
 <2><f83>: Abbrev Number: 1 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x98f44): XferOptions
    <f88>   DW_AT_decl_file   : 14
    <f89>   DW_AT_decl_line   : 200
    <f8a>   DW_AT_decl_column : 30
    <f8b>   DW_AT_type        : <0x2cf>
    <f8f>   DW_AT_data_member_location: 44
 <2><f90>: Abbrev Number: 1 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x429a2): PreviousState
    <f95>   DW_AT_decl_file   : 14
    <f96>   DW_AT_decl_line   : 202
    <f97>   DW_AT_decl_column : 30
    <f98>   DW_AT_type        : <0x2cf>
    <f9c>   DW_AT_data_member_location: 48
 <2><f9d>: Abbrev Number: 1 (DW_TAG_member)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x8fdac): hdmatx
    <fa2>   DW_AT_decl_file   : 14
    <fa3>   DW_AT_decl_line   : 205
    <fa4>   DW_AT_decl_column : 31
    <fa5>   DW_AT_type        : <0x1025>
    <fa9>   DW_AT_data_member_location: 52
 <2><faa>: Abbrev Number: 1 (DW_TAG_member)
    <fab>   DW_AT_name        : (indirect string, offset: 0x8f440): hdmarx
    <faf>   DW_AT_decl_file   : 14
    <fb0>   DW_AT_decl_line   : 207
    <fb1>   DW_AT_decl_column : 31
    <fb2>   DW_AT_type        : <0x1025>
    <fb6>   DW_AT_data_member_location: 56
 <2><fb7>: Abbrev Number: 1 (DW_TAG_member)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x697d0): Lock
    <fbc>   DW_AT_decl_file   : 14
    <fbd>   DW_AT_decl_line   : 209
    <fbe>   DW_AT_decl_column : 30
    <fbf>   DW_AT_type        : <0xc38>
    <fc3>   DW_AT_data_member_location: 60
 <2><fc4>: Abbrev Number: 1 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x98958): State
    <fc9>   DW_AT_decl_file   : 14
    <fca>   DW_AT_decl_line   : 211
    <fcb>   DW_AT_decl_column : 30
    <fcc>   DW_AT_type        : <0xefd>
    <fd0>   DW_AT_data_member_location: 61
 <2><fd1>: Abbrev Number: 1 (DW_TAG_member)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x9a47c): Mode
    <fd6>   DW_AT_decl_file   : 14
    <fd7>   DW_AT_decl_line   : 213
    <fd8>   DW_AT_decl_column : 30
    <fd9>   DW_AT_type        : <0xf35>
    <fdd>   DW_AT_data_member_location: 62
 <2><fde>: Abbrev Number: 1 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x90838): ErrorCode
    <fe3>   DW_AT_decl_file   : 14
    <fe4>   DW_AT_decl_line   : 215
    <fe5>   DW_AT_decl_column : 30
    <fe6>   DW_AT_type        : <0x2cf>
    <fea>   DW_AT_data_member_location: 64
 <2><feb>: Abbrev Number: 1 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0x601e9): Devaddress
    <ff0>   DW_AT_decl_file   : 14
    <ff1>   DW_AT_decl_line   : 217
    <ff2>   DW_AT_decl_column : 30
    <ff3>   DW_AT_type        : <0x2cf>
    <ff7>   DW_AT_data_member_location: 68
 <2><ff8>: Abbrev Number: 1 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x85f30): Memaddress
    <ffd>   DW_AT_decl_file   : 14
    <ffe>   DW_AT_decl_line   : 219
    <fff>   DW_AT_decl_column : 30
    <1000>   DW_AT_type        : <0x2cf>
    <1004>   DW_AT_data_member_location: 72
 <2><1005>: Abbrev Number: 1 (DW_TAG_member)
    <1006>   DW_AT_name        : (indirect string, offset: 0x47279): MemaddSize
    <100a>   DW_AT_decl_file   : 14
    <100b>   DW_AT_decl_line   : 221
    <100c>   DW_AT_decl_column : 30
    <100d>   DW_AT_type        : <0x2cf>
    <1011>   DW_AT_data_member_location: 76
 <2><1012>: Abbrev Number: 1 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0x63857): EventCount
    <1017>   DW_AT_decl_file   : 14
    <1018>   DW_AT_decl_line   : 223
    <1019>   DW_AT_decl_column : 30
    <101a>   DW_AT_type        : <0x2cf>
    <101e>   DW_AT_data_member_location: 80
 <2><101f>: Abbrev Number: 0
 <1><1020>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1021>   DW_AT_byte_size   : 4
    <1021>   DW_AT_type        : <0xbdd>
 <1><1025>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1026>   DW_AT_byte_size   : 4
    <1026>   DW_AT_type        : <0xe17>
 <1><102a>: Abbrev Number: 7 (DW_TAG_typedef)
    <102b>   DW_AT_name        : (indirect string, offset: 0x33f3c): I2C_HandleTypeDef
    <102f>   DW_AT_decl_file   : 14
    <1030>   DW_AT_decl_line   : 243
    <1031>   DW_AT_decl_column : 3
    <1032>   DW_AT_type        : <0xf3a>
 <1><1036>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <1037>   DW_AT_encoding    : 5	(signed)
    <1038>   DW_AT_byte_size   : 2
    <1039>   DW_AT_type        : <0x255>
    <103d>   DW_AT_decl_file   : 15
    <103e>   DW_AT_decl_line   : 172
    <103f>   DW_AT_decl_column : 15
    <1040>   DW_AT_sibling     : <0x1075>
 <2><1044>: Abbrev Number: 29 (DW_TAG_enumerator)
    <1045>   DW_AT_name        : (indirect string, offset: 0x80621): osPriorityIdle
    <1049>   DW_AT_const_value : -3
 <2><104a>: Abbrev Number: 29 (DW_TAG_enumerator)
    <104b>   DW_AT_name        : (indirect string, offset: 0x886d6): osPriorityLow
    <104f>   DW_AT_const_value : -2
 <2><1050>: Abbrev Number: 29 (DW_TAG_enumerator)
    <1051>   DW_AT_name        : (indirect string, offset: 0x8e0f2): osPriorityBelowNormal
    <1055>   DW_AT_const_value : -1
 <2><1056>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1057>   DW_AT_name        : (indirect string, offset: 0x9d540): osPriorityNormal
    <105b>   DW_AT_const_value : 0
 <2><105c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <105d>   DW_AT_name        : (indirect string, offset: 0x5f2dd): osPriorityAboveNormal
    <1061>   DW_AT_const_value : 1
 <2><1062>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1063>   DW_AT_name        : (indirect string, offset: 0x35f48): osPriorityHigh
    <1067>   DW_AT_const_value : 2
 <2><1068>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1069>   DW_AT_name        : (indirect string, offset: 0x86168): osPriorityRealtime
    <106d>   DW_AT_const_value : 3
 <2><106e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <106f>   DW_AT_name        : (indirect string, offset: 0x83004): osPriorityError
    <1073>   DW_AT_const_value : 132
 <2><1074>: Abbrev Number: 0
 <1><1075>: Abbrev Number: 7 (DW_TAG_typedef)
    <1076>   DW_AT_name        : (indirect string, offset: 0x9e861): osPriority
    <107a>   DW_AT_decl_file   : 15
    <107b>   DW_AT_decl_line   : 181
    <107c>   DW_AT_decl_column : 3
    <107d>   DW_AT_type        : <0x1036>
 <1><1081>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <1082>   DW_AT_encoding    : 7	(unsigned)
    <1083>   DW_AT_byte_size   : 4
    <1084>   DW_AT_type        : <0x21a>
    <1088>   DW_AT_decl_file   : 15
    <1089>   DW_AT_decl_line   : 189
    <108a>   DW_AT_decl_column : 15
    <108b>   DW_AT_sibling     : <0x10ed>
 <2><108f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1090>   DW_AT_name        : (indirect string, offset: 0x82e25): osOK
    <1094>   DW_AT_const_value : 0
 <2><1095>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1096>   DW_AT_name        : (indirect string, offset: 0x6c91b): osEventSignal
    <109a>   DW_AT_const_value : 8
 <2><109b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <109c>   DW_AT_name        : (indirect string, offset: 0x4ca0): osEventMessage
    <10a0>   DW_AT_const_value : 16
 <2><10a1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x5efd1): osEventMail
    <10a6>   DW_AT_const_value : 32
 <2><10a7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a8>   DW_AT_name        : (indirect string, offset: 0x1bdee): osEventTimeout
    <10ac>   DW_AT_const_value : 64
 <2><10ad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x2832f): osErrorParameter
    <10b2>   DW_AT_const_value : 128
 <2><10b3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x60cc4): osErrorResource
    <10b8>   DW_AT_const_value : 129
 <2><10b9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x67817): osErrorTimeoutResource
    <10be>   DW_AT_const_value : 193
 <2><10bf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x29b63): osErrorISR
    <10c4>   DW_AT_const_value : 130
 <2><10c5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x78e76): osErrorISRRecursive
    <10ca>   DW_AT_const_value : 131
 <2><10cb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x8ce6a): osErrorPriority
    <10d0>   DW_AT_const_value : 132
 <2><10d1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10d2>   DW_AT_name        : (indirect string, offset: 0x1c763): osErrorNoMemory
    <10d6>   DW_AT_const_value : 133
 <2><10d7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x66c3e): osErrorValue
    <10dc>   DW_AT_const_value : 134
 <2><10dd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10de>   DW_AT_name        : (indirect string, offset: 0x4fab0): osErrorOS
    <10e2>   DW_AT_const_value : 255
 <2><10e3>: Abbrev Number: 43 (DW_TAG_enumerator)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x315ae): os_status_reserved
    <10e8>   DW_AT_const_value : 0x7fffffff
