Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1e5 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2d03): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x11c4): ../Core/Src/fonts.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xbb3): D:/Master/TFG/Debug
    <1a>   DW_AT_stmt_list   : 0
    <1e>   DW_AT_macros      : 0
 <1><22>: Abbrev Number: 1 (DW_TAG_base_type)
    <23>   DW_AT_byte_size   : 1
    <24>   DW_AT_encoding    : 6	(signed char)
    <25>   DW_AT_name        : (indirect string, offset: 0x2a38): signed char
 <1><29>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indirect string, offset: 0x2cf9): __uint8_t
    <2e>   DW_AT_decl_file   : 2
    <2f>   DW_AT_decl_line   : 43
    <30>   DW_AT_decl_column : 24
    <31>   DW_AT_type        : <0x35>
 <1><35>: Abbrev Number: 1 (DW_TAG_base_type)
    <36>   DW_AT_byte_size   : 1
    <37>   DW_AT_encoding    : 8	(unsigned char)
    <38>   DW_AT_name        : (indirect string, offset: 0x2c76): unsigned char
 <1><3c>: Abbrev Number: 1 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 2
    <3e>   DW_AT_encoding    : 5	(signed)
    <3f>   DW_AT_name        : (indirect string, offset: 0x79c): short int
 <1><43>: Abbrev Number: 3 (DW_TAG_typedef)
    <44>   DW_AT_name        : (indirect string, offset: 0x1163): __uint16_t
    <48>   DW_AT_decl_file   : 2
    <49>   DW_AT_decl_line   : 57
    <4a>   DW_AT_decl_column : 25
    <4b>   DW_AT_type        : <0x4f>
 <1><4f>: Abbrev Number: 1 (DW_TAG_base_type)
    <50>   DW_AT_byte_size   : 2
    <51>   DW_AT_encoding    : 7	(unsigned)
    <52>   DW_AT_name        : (indirect string, offset: 0x5da): short unsigned int
 <1><56>: Abbrev Number: 1 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 4
    <58>   DW_AT_encoding    : 5	(signed)
    <59>   DW_AT_name        : (indirect string, offset: 0x28cb): long int
 <1><5d>: Abbrev Number: 1 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 7	(unsigned)
    <60>   DW_AT_name        : (indirect string, offset: 0x25c8): long unsigned int
 <1><64>: Abbrev Number: 1 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 8
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : (indirect string, offset: 0x231e): long long int
 <1><6b>: Abbrev Number: 1 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 7	(unsigned)
    <6e>   DW_AT_name        : (indirect string, offset: 0x372e): long long unsigned int
 <1><72>: Abbrev Number: 12 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 4
    <74>   DW_AT_encoding    : 5	(signed)
    <75>   DW_AT_name        : int
 <1><79>: Abbrev Number: 1 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 7	(unsigned)
    <7c>   DW_AT_name        : (indirect string, offset: 0x33f3): unsigned int
 <1><80>: Abbrev Number: 3 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x2cfb): uint8_t
    <85>   DW_AT_decl_file   : 3
    <86>   DW_AT_decl_line   : 24
    <87>   DW_AT_decl_column : 19
    <88>   DW_AT_type        : <0x29>
 <1><8c>: Abbrev Number: 2 (DW_TAG_const_type)
    <8d>   DW_AT_type        : <0x80>
 <1><91>: Abbrev Number: 3 (DW_TAG_typedef)
    <92>   DW_AT_name        : (indirect string, offset: 0x6b268): uint16_t
    <96>   DW_AT_decl_file   : 3
    <97>   DW_AT_decl_line   : 36
    <98>   DW_AT_decl_column : 20
    <99>   DW_AT_type        : <0x43>
 <1><9d>: Abbrev Number: 2 (DW_TAG_const_type)
    <9e>   DW_AT_type        : <0x91>
 <1><a2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a3>   DW_AT_byte_size   : 8
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 6
    <a6>   DW_AT_decl_column : 9
    <a7>   DW_AT_sibling     : <0xd0>
 <2><ab>: Abbrev Number: 6 (DW_TAG_member)
    <ac>   DW_AT_name        : (indirect string, offset: 0x14fb): width
    <b0>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 7
    <b1>   DW_AT_decl_column : 19
    <b2>   DW_AT_type        : <0x8c>
    <b6>   DW_AT_data_member_location: 0
 <2><b7>: Abbrev Number: 6 (DW_TAG_member)
    <b8>   DW_AT_name        : (indirect string, offset: 0x23e6): height
    <bc>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 8
    <bd>   DW_AT_decl_column : 13
    <be>   DW_AT_type        : <0x80>
    <c2>   DW_AT_data_member_location: 1
 <2><c3>: Abbrev Number: 6 (DW_TAG_member)
    <c4>   DW_AT_name        : (indirect string, offset: 0x67710): data
    <c8>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 9
    <c9>   DW_AT_decl_column : 21
    <ca>   DW_AT_type        : <0xd0>
    <ce>   DW_AT_data_member_location: 4
 <2><cf>: Abbrev Number: 0
 <1><d0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d1>   DW_AT_byte_size   : 4
    <d2>   DW_AT_type        : <0x9d>
 <1><d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7>   DW_AT_name        : (indirect string, offset: 0xd9): FontDef
    <db>   DW_AT_decl_file   : 4
    <dc>   DW_AT_decl_line   : 10
    <dd>   DW_AT_decl_column : 3
    <de>   DW_AT_type        : <0xa2>
 <1><e2>: Abbrev Number: 5 (DW_TAG_variable)
    <e3>   DW_AT_name        : (indirect string, offset: 0x6b9): Font_7x10
    <e7>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 13
    <e8>   DW_AT_decl_column : 16
    <e9>   DW_AT_type        : <0xd6>
    <ed>   DW_AT_external    : 1
    <ed>   DW_AT_declaration : 1
 <1><ed>: Abbrev Number: 5 (DW_TAG_variable)
    <ee>   DW_AT_name        : (indirect string, offset: 0x3a58): Font_11x18
    <f2>   DW_AT_decl_file   : 4
    <f2>   DW_AT_decl_line   : 14
    <f3>   DW_AT_decl_column : 16
    <f4>   DW_AT_type        : <0xd6>
    <f8>   DW_AT_external    : 1
    <f8>   DW_AT_declaration : 1
 <1><f8>: Abbrev Number: 5 (DW_TAG_variable)
    <f9>   DW_AT_name        : (indirect string, offset: 0x3281): Font_16x26
    <fd>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 15
    <fe>   DW_AT_decl_column : 16
    <ff>   DW_AT_type        : <0xd6>
    <103>   DW_AT_external    : 1
    <103>   DW_AT_declaration : 1
 <1><103>: Abbrev Number: 4 (DW_TAG_array_type)
    <104>   DW_AT_type        : <0x9d>
    <108>   DW_AT_sibling     : <0x113>
 <2><10c>: Abbrev Number: 15 (DW_TAG_subrange_type)
 <2><10d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10e>   DW_AT_type        : <0x79>
    <112>   DW_AT_upper_bound : 127
 <2><112>: Abbrev Number: 0
 <1><113>: Abbrev Number: 2 (DW_TAG_const_type)
    <114>   DW_AT_type        : <0x103>
 <1><118>: Abbrev Number: 5 (DW_TAG_variable)
    <119>   DW_AT_name        : (indirect string, offset: 0x1560): saber
    <11d>   DW_AT_decl_file   : 4
    <11d>   DW_AT_decl_line   : 27
    <11e>   DW_AT_decl_column : 23
    <11f>   DW_AT_type        : <0x113>
    <123>   DW_AT_external    : 1
    <123>   DW_AT_declaration : 1
 <1><123>: Abbrev Number: 4 (DW_TAG_array_type)
    <124>   DW_AT_type        : <0x9d>
    <128>   DW_AT_sibling     : <0x134>
 <2><12c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <12d>   DW_AT_type        : <0x79>
    <131>   DW_AT_upper_bound : 949
 <2><133>: Abbrev Number: 0
 <1><134>: Abbrev Number: 2 (DW_TAG_const_type)
    <135>   DW_AT_type        : <0x123>
 <1><139>: Abbrev Number: 9 (DW_TAG_variable)
    <13a>   DW_AT_name        : (indirect string, offset: 0x784): Font7x10
    <13e>   DW_AT_decl_file   : 1
    <13e>   DW_AT_decl_line   : 3
    <13f>   DW_AT_decl_column : 23
    <13f>   DW_AT_type        : <0x134>
    <143>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><149>: Abbrev Number: 4 (DW_TAG_array_type)
    <14a>   DW_AT_type        : <0x9d>
    <14e>   DW_AT_sibling     : <0x15a>
 <2><152>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <153>   DW_AT_type        : <0x79>
    <157>   DW_AT_upper_bound : 1709
 <2><159>: Abbrev Number: 0
 <1><15a>: Abbrev Number: 2 (DW_TAG_const_type)
    <15b>   DW_AT_type        : <0x149>
 <1><15f>: Abbrev Number: 9 (DW_TAG_variable)
    <160>   DW_AT_name        : (indirect string, offset: 0x2cf): Font11x18
    <164>   DW_AT_decl_file   : 1
    <164>   DW_AT_decl_line   : 101
    <165>   DW_AT_decl_column : 23
    <165>   DW_AT_type        : <0x15a>
    <169>   DW_AT_location    : 5 byte block: 3 0 d9 0 8 	(DW_OP_addr: 800d900)
 <1><16f>: Abbrev Number: 4 (DW_TAG_array_type)
    <170>   DW_AT_type        : <0x9d>
    <174>   DW_AT_sibling     : <0x180>
 <2><178>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <179>   DW_AT_type        : <0x79>
    <17d>   DW_AT_upper_bound : 2469
 <2><17f>: Abbrev Number: 0
 <1><180>: Abbrev Number: 2 (DW_TAG_const_type)
    <181>   DW_AT_type        : <0x16f>
 <1><185>: Abbrev Number: 9 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x2861): Font16x26
    <18a>   DW_AT_decl_file   : 1
    <18a>   DW_AT_decl_line   : 199
    <18b>   DW_AT_decl_column : 23
    <18b>   DW_AT_type        : <0x180>
    <18f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><195>: Abbrev Number: 4 (DW_TAG_array_type)
    <196>   DW_AT_type        : <0x9d>
    <19a>   DW_AT_sibling     : <0x1a9>
 <2><19e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <19f>   DW_AT_type        : <0x79>
    <1a3>   DW_AT_upper_bound : 127
 <2><1a3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1a4>   DW_AT_type        : <0x79>
    <1a8>   DW_AT_upper_bound : 127
 <2><1a8>: Abbrev Number: 0
 <1><1a9>: Abbrev Number: 2 (DW_TAG_const_type)
    <1aa>   DW_AT_type        : <0x195>
 <1><1ae>: Abbrev Number: 16 (DW_TAG_variable)
    <1af>   DW_AT_specification: <0x118>
    <1b3>   DW_AT_decl_file   : 1
    <1b4>   DW_AT_decl_line   : 297
    <1b6>   DW_AT_decl_column : 16
    <1b7>   DW_AT_type        : <0x1a9>
    <1bb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1c1>: Abbrev Number: 10 (DW_TAG_variable)
    <1c2>   DW_AT_specification: <0xe2>
    <1c6>   DW_AT_decl_file   : 1
    <1c6>   DW_AT_decl_line   : 1160
    <1c8>   DW_AT_decl_column : 9
    <1c8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1ce>: Abbrev Number: 10 (DW_TAG_variable)
    <1cf>   DW_AT_specification: <0xed>
    <1d3>   DW_AT_decl_file   : 1
    <1d3>   DW_AT_decl_line   : 1161
    <1d5>   DW_AT_decl_column : 9
    <1d5>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1db>: Abbrev Number: 10 (DW_TAG_variable)
    <1dc>   DW_AT_specification: <0xf8>
    <1e0>   DW_AT_decl_file   : 1
    <1e0>   DW_AT_decl_line   : 1162
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1e8>: Abbrev Number: 0
  Compilation Unit @ offset 0x1e9:
   Length:        0xbc8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xd3
   Pointer Size:  4
 <0><1f5>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <1f6>   DW_AT_producer    : (indirect string, offset: 0x2d03): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1fa>   DW_AT_language    : 29	(C11)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x90aeb): ../Core/Src/freertos.c
    <1ff>   DW_AT_comp_dir    : (indirect string, offset: 0xbb3): D:/Master/TFG/Debug
    <203>   DW_AT_ranges      : 0xc
    <207>   DW_AT_low_pc      : 0
    <20b>   DW_AT_stmt_list   : 0x40a
    <20f>   DW_AT_macros      : 0xf92
 <1><213>: Abbrev Number: 27 (DW_TAG_base_type)
    <214>   DW_AT_byte_size   : 4
    <215>   DW_AT_encoding    : 5	(signed)
    <216>   DW_AT_name        : int
 <1><21a>: Abbrev Number: 7 (DW_TAG_base_type)
    <21b>   DW_AT_byte_size   : 4
    <21c>   DW_AT_encoding    : 7	(unsigned)
    <21d>   DW_AT_name        : (indirect string, offset: 0x33f3): unsigned int
 <1><221>: Abbrev Number: 7 (DW_TAG_base_type)
    <222>   DW_AT_byte_size   : 8
    <223>   DW_AT_encoding    : 5	(signed)
    <224>   DW_AT_name        : (indirect string, offset: 0x231e): long long int
 <1><228>: Abbrev Number: 7 (DW_TAG_base_type)
    <229>   DW_AT_byte_size   : 8
    <22a>   DW_AT_encoding    : 4	(float)
    <22b>   DW_AT_name        : (indirect string, offset: 0x78b13): long double
 <1><22f>: Abbrev Number: 7 (DW_TAG_base_type)
    <230>   DW_AT_byte_size   : 1
    <231>   DW_AT_encoding    : 6	(signed char)
    <232>   DW_AT_name        : (indirect string, offset: 0x2a38): signed char
 <1><236>: Abbrev Number: 4 (DW_TAG_typedef)
    <237>   DW_AT_name        : (indirect string, offset: 0x2cf9): __uint8_t
    <23b>   DW_AT_decl_file   : 2
    <23c>   DW_AT_decl_line   : 43
    <23d>   DW_AT_decl_column : 24
    <23e>   DW_AT_type        : <0x242>
 <1><242>: Abbrev Number: 7 (DW_TAG_base_type)
    <243>   DW_AT_byte_size   : 1
    <244>   DW_AT_encoding    : 8	(unsigned char)
    <245>   DW_AT_name        : (indirect string, offset: 0x2c76): unsigned char
 <1><249>: Abbrev Number: 7 (DW_TAG_base_type)
    <24a>   DW_AT_byte_size   : 2
    <24b>   DW_AT_encoding    : 5	(signed)
    <24c>   DW_AT_name        : (indirect string, offset: 0x79c): short int
 <1><250>: Abbrev Number: 4 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0x1163): __uint16_t
    <255>   DW_AT_decl_file   : 2
    <256>   DW_AT_decl_line   : 57
    <257>   DW_AT_decl_column : 25
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_base_type)
    <25d>   DW_AT_byte_size   : 2
    <25e>   DW_AT_encoding    : 7	(unsigned)
    <25f>   DW_AT_name        : (indirect string, offset: 0x5da): short unsigned int
 <1><263>: Abbrev Number: 7 (DW_TAG_base_type)
    <264>   DW_AT_byte_size   : 4
    <265>   DW_AT_encoding    : 5	(signed)
    <266>   DW_AT_name        : (indirect string, offset: 0x28cb): long int
 <1><26a>: Abbrev Number: 4 (DW_TAG_typedef)
    <26b>   DW_AT_name        : (indirect string, offset: 0x5df2f): __uint32_t
    <26f>   DW_AT_decl_file   : 2
    <270>   DW_AT_decl_line   : 79
    <271>   DW_AT_decl_column : 25
    <272>   DW_AT_type        : <0x276>
 <1><276>: Abbrev Number: 7 (DW_TAG_base_type)
    <277>   DW_AT_byte_size   : 4
    <278>   DW_AT_encoding    : 7	(unsigned)
    <279>   DW_AT_name        : (indirect string, offset: 0x25c8): long unsigned int
 <1><27d>: Abbrev Number: 7 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 8
    <27f>   DW_AT_encoding    : 7	(unsigned)
    <280>   DW_AT_name        : (indirect string, offset: 0x372e): long long unsigned int
 <1><284>: Abbrev Number: 4 (DW_TAG_typedef)
    <285>   DW_AT_name        : (indirect string, offset: 0x2cfb): uint8_t
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 24
    <28b>   DW_AT_decl_column : 19
    <28c>   DW_AT_type        : <0x236>
 <1><290>: Abbrev Number: 4 (DW_TAG_typedef)
    <291>   DW_AT_name        : (indirect string, offset: 0x6b268): uint16_t
    <295>   DW_AT_decl_file   : 3
    <296>   DW_AT_decl_line   : 36
    <297>   DW_AT_decl_column : 20
    <298>   DW_AT_type        : <0x250>
 <1><29c>: Abbrev Number: 4 (DW_TAG_typedef)
    <29d>   DW_AT_name        : (indirect string, offset: 0x6ab23): uint32_t
    <2a1>   DW_AT_decl_file   : 3
    <2a2>   DW_AT_decl_line   : 48
    <2a3>   DW_AT_decl_column : 20
    <2a4>   DW_AT_type        : <0x26a>
 <1><2a8>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <2a9>   DW_AT_byte_size   : 4
 <1><2aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x6b5c6): StackType_t
    <2af>   DW_AT_decl_file   : 4
    <2b0>   DW_AT_decl_line   : 55
    <2b1>   DW_AT_decl_column : 24
    <2b2>   DW_AT_type        : <0x29c>
 <1><2b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x87376): UBaseType_t
    <2bb>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 57
    <2bd>   DW_AT_decl_column : 23
    <2be>   DW_AT_type        : <0x276>
 <1><2c2>: Abbrev Number: 4 (DW_TAG_typedef)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x52025): TickType_t
    <2c7>   DW_AT_decl_file   : 4
    <2c8>   DW_AT_decl_line   : 63
    <2c9>   DW_AT_decl_column : 19
    <2ca>   DW_AT_type        : <0x29c>
 <1><2ce>: Abbrev Number: 12 (DW_TAG_typedef)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x6c33f): wint_t
    <2d3>   DW_AT_decl_file   : 5
    <2d4>   DW_AT_decl_line   : 359
    <2d6>   DW_AT_decl_column : 23
    <2d7>   DW_AT_type        : <0x21a>
 <1><2db>: Abbrev Number: 4 (DW_TAG_typedef)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x96373): _off_t
    <2e0>   DW_AT_decl_file   : 6
    <2e1>   DW_AT_decl_line   : 46
    <2e2>   DW_AT_decl_column : 14
    <2e3>   DW_AT_type        : <0x263>
 <1><2e7>: Abbrev Number: 4 (DW_TAG_typedef)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x2300e): _fpos_t
    <2ec>   DW_AT_decl_file   : 6
    <2ed>   DW_AT_decl_line   : 116
    <2ee>   DW_AT_decl_column : 14
    <2ef>   DW_AT_type        : <0x263>
 <1><2f3>: Abbrev Number: 29 (DW_TAG_union_type)
    <2f4>   DW_AT_byte_size   : 4
    <2f5>   DW_AT_decl_file   : 6
    <2f6>   DW_AT_decl_line   : 165
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_sibling     : <0x313>
 <2><2fc>: Abbrev Number: 22 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x70a56): __wch
    <301>   DW_AT_decl_file   : 6
    <301>   DW_AT_decl_line   : 167
    <302>   DW_AT_decl_column : 12
    <303>   DW_AT_type        : <0x2ce>
 <2><307>: Abbrev Number: 22 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x4c9f3): __wchb
    <30c>   DW_AT_decl_file   : 6
    <30c>   DW_AT_decl_line   : 168
    <30d>   DW_AT_decl_column : 19
    <30e>   DW_AT_type        : <0x313>
 <2><312>: Abbrev Number: 0
 <1><313>: Abbrev Number: 8 (DW_TAG_array_type)
    <314>   DW_AT_type        : <0x242>
    <318>   DW_AT_sibling     : <0x323>
 <2><31c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <31d>   DW_AT_type        : <0x21a>
    <321>   DW_AT_upper_bound : 3
 <2><322>: Abbrev Number: 0
 <1><323>: Abbrev Number: 30 (DW_TAG_structure_type)
    <324>   DW_AT_byte_size   : 8
    <325>   DW_AT_decl_file   : 6
    <326>   DW_AT_decl_line   : 162
    <327>   DW_AT_decl_column : 9
    <328>   DW_AT_sibling     : <0x347>
 <2><32c>: Abbrev Number: 2 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x2b211): __count
    <331>   DW_AT_decl_file   : 6
    <332>   DW_AT_decl_line   : 164
    <333>   DW_AT_decl_column : 7
    <334>   DW_AT_type        : <0x213>
    <338>   DW_AT_data_member_location: 0
 <2><339>: Abbrev Number: 2 (DW_TAG_member)
    <33a>   DW_AT_name        : (indirect string, offset: 0x55374): __value
    <33e>   DW_AT_decl_file   : 6
    <33f>   DW_AT_decl_line   : 169
    <340>   DW_AT_decl_column : 5
    <341>   DW_AT_type        : <0x2f3>
    <345>   DW_AT_data_member_location: 4
 <2><346>: Abbrev Number: 0
 <1><347>: Abbrev Number: 4 (DW_TAG_typedef)
    <348>   DW_AT_name        : (indirect string, offset: 0x4ddab): _mbstate_t
    <34c>   DW_AT_decl_file   : 6
    <34d>   DW_AT_decl_line   : 170
    <34e>   DW_AT_decl_column : 3
    <34f>   DW_AT_type        : <0x323>
 <1><353>: Abbrev Number: 4 (DW_TAG_typedef)
    <354>   DW_AT_name        : (indirect string, offset: 0x505e5): __ULong
    <358>   DW_AT_decl_file   : 7
    <359>   DW_AT_decl_line   : 23
    <35a>   DW_AT_decl_column : 25
    <35b>   DW_AT_type        : <0x276>
 <1><35f>: Abbrev Number: 4 (DW_TAG_typedef)
    <360>   DW_AT_name        : (indirect string, offset: 0x51bf9): _LOCK_T
    <364>   DW_AT_decl_file   : 8
    <365>   DW_AT_decl_line   : 34
    <366>   DW_AT_decl_column : 25
    <367>   DW_AT_type        : <0x36b>
 <1><36b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <36c>   DW_AT_byte_size   : 4
    <36c>   DW_AT_type        : <0x370>
 <1><370>: Abbrev Number: 18 (DW_TAG_structure_type)
    <371>   DW_AT_name        : (indirect string, offset: 0x2f436): __lock
    <375>   DW_AT_declaration : 1
 <1><375>: Abbrev Number: 4 (DW_TAG_typedef)
    <376>   DW_AT_name        : (indirect string, offset: 0x49a29): _flock_t
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 36
    <37c>   DW_AT_decl_column : 27
    <37d>   DW_AT_type        : <0x35f>
 <1><381>: Abbrev Number: 15 (DW_TAG_structure_type)
    <382>   DW_AT_name        : (indirect string, offset: 0x34a95): _Bigint
    <386>   DW_AT_byte_size   : 24
    <387>   DW_AT_decl_file   : 7
    <387>   DW_AT_decl_line   : 53
    <388>   DW_AT_decl_column : 8
    <388>   DW_AT_sibling     : <0x3d7>
 <2><38c>: Abbrev Number: 2 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x58266): _next
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 55
    <393>   DW_AT_decl_column : 19
    <394>   DW_AT_type        : <0x3d7>
    <398>   DW_AT_data_member_location: 0
 <2><399>: Abbrev Number: 10 (DW_TAG_member)
    <39a>   DW_AT_name        : _k
    <39d>   DW_AT_decl_file   : 7
    <39d>   DW_AT_decl_line   : 56
    <39e>   DW_AT_decl_column : 7
    <39f>   DW_AT_type        : <0x213>
    <3a3>   DW_AT_data_member_location: 4
 <2><3a4>: Abbrev Number: 2 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x692ff): _maxwds
    <3a9>   DW_AT_decl_file   : 7
    <3aa>   DW_AT_decl_line   : 56
    <3ab>   DW_AT_decl_column : 11
    <3ac>   DW_AT_type        : <0x213>
    <3b0>   DW_AT_data_member_location: 8
 <2><3b1>: Abbrev Number: 2 (DW_TAG_member)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x4f172): _sign
    <3b6>   DW_AT_decl_file   : 7
    <3b7>   DW_AT_decl_line   : 56
    <3b8>   DW_AT_decl_column : 20
    <3b9>   DW_AT_type        : <0x213>
    <3bd>   DW_AT_data_member_location: 12
 <2><3be>: Abbrev Number: 2 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x4ed71): _wds
    <3c3>   DW_AT_decl_file   : 7
    <3c4>   DW_AT_decl_line   : 56
    <3c5>   DW_AT_decl_column : 27
    <3c6>   DW_AT_type        : <0x213>
    <3ca>   DW_AT_data_member_location: 16
 <2><3cb>: Abbrev Number: 10 (DW_TAG_member)
    <3cc>   DW_AT_name        : _x
    <3cf>   DW_AT_decl_file   : 7
    <3cf>   DW_AT_decl_line   : 57
    <3d0>   DW_AT_decl_column : 11
    <3d1>   DW_AT_type        : <0x3dc>
    <3d5>   DW_AT_data_member_location: 20
 <2><3d6>: Abbrev Number: 0
 <1><3d7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x381>
 <1><3dc>: Abbrev Number: 8 (DW_TAG_array_type)
    <3dd>   DW_AT_type        : <0x353>
    <3e1>   DW_AT_sibling     : <0x3ec>
 <2><3e5>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <3e6>   DW_AT_type        : <0x21a>
    <3ea>   DW_AT_upper_bound : 0
 <2><3eb>: Abbrev Number: 0
 <1><3ec>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x2a0fb): __tm
    <3f1>   DW_AT_byte_size   : 36
    <3f2>   DW_AT_decl_file   : 7
    <3f2>   DW_AT_decl_line   : 61
    <3f3>   DW_AT_decl_column : 8
    <3f3>   DW_AT_sibling     : <0x46d>
 <2><3f7>: Abbrev Number: 2 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x78640): __tm_sec
    <3fc>   DW_AT_decl_file   : 7
    <3fd>   DW_AT_decl_line   : 63
    <3fe>   DW_AT_decl_column : 9
    <3ff>   DW_AT_type        : <0x213>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 2 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x4691): __tm_min
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 64
    <40b>   DW_AT_decl_column : 9
    <40c>   DW_AT_type        : <0x213>
    <410>   DW_AT_data_member_location: 4
 <2><411>: Abbrev Number: 2 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0x21c77): __tm_hour
    <416>   DW_AT_decl_file   : 7
    <417>   DW_AT_decl_line   : 65
    <418>   DW_AT_decl_column : 9
    <419>   DW_AT_type        : <0x213>
    <41d>   DW_AT_data_member_location: 8
 <2><41e>: Abbrev Number: 2 (DW_TAG_member)
    <41f>   DW_AT_name        : (indirect string, offset: 0x56f31): __tm_mday
    <423>   DW_AT_decl_file   : 7
    <424>   DW_AT_decl_line   : 66
    <425>   DW_AT_decl_column : 9
    <426>   DW_AT_type        : <0x213>
    <42a>   DW_AT_data_member_location: 12
 <2><42b>: Abbrev Number: 2 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x6129): __tm_mon
    <430>   DW_AT_decl_file   : 7
    <431>   DW_AT_decl_line   : 67
    <432>   DW_AT_decl_column : 9
    <433>   DW_AT_type        : <0x213>
    <437>   DW_AT_data_member_location: 16
 <2><438>: Abbrev Number: 2 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x889e0): __tm_year
    <43d>   DW_AT_decl_file   : 7
    <43e>   DW_AT_decl_line   : 68
    <43f>   DW_AT_decl_column : 9
    <440>   DW_AT_type        : <0x213>
    <444>   DW_AT_data_member_location: 20
 <2><445>: Abbrev Number: 2 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x3f18e): __tm_wday
    <44a>   DW_AT_decl_file   : 7
    <44b>   DW_AT_decl_line   : 69
    <44c>   DW_AT_decl_column : 9
    <44d>   DW_AT_type        : <0x213>
    <451>   DW_AT_data_member_location: 24
 <2><452>: Abbrev Number: 2 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x74ae1): __tm_yday
    <457>   DW_AT_decl_file   : 7
    <458>   DW_AT_decl_line   : 70
    <459>   DW_AT_decl_column : 9
    <45a>   DW_AT_type        : <0x213>
    <45e>   DW_AT_data_member_location: 28
 <2><45f>: Abbrev Number: 2 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x8454b): __tm_isdst
    <464>   DW_AT_decl_file   : 7
    <465>   DW_AT_decl_line   : 71
    <466>   DW_AT_decl_column : 9
    <467>   DW_AT_type        : <0x213>
    <46b>   DW_AT_data_member_location: 32
 <2><46c>: Abbrev Number: 0
 <1><46d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <46e>   DW_AT_name        : (indirect string, offset: 0x622ee): __sbuf
    <472>   DW_AT_byte_size   : 8
    <473>   DW_AT_decl_file   : 7
    <473>   DW_AT_decl_line   : 116
    <474>   DW_AT_decl_column : 8
    <474>   DW_AT_sibling     : <0x493>
 <2><478>: Abbrev Number: 2 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x9187c): _base
    <47d>   DW_AT_decl_file   : 7
    <47e>   DW_AT_decl_line   : 117
    <47f>   DW_AT_decl_column : 17
    <480>   DW_AT_type        : <0x493>
    <484>   DW_AT_data_member_location: 0
 <2><485>: Abbrev Number: 2 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x9bbf0): _size
    <48a>   DW_AT_decl_file   : 7
    <48b>   DW_AT_decl_line   : 118
    <48c>   DW_AT_decl_column : 6
    <48d>   DW_AT_type        : <0x213>
    <491>   DW_AT_data_member_location: 4
 <2><492>: Abbrev Number: 0
 <1><493>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <494>   DW_AT_byte_size   : 4
    <494>   DW_AT_type        : <0x242>
 <1><498>: Abbrev Number: 15 (DW_TAG_structure_type)
    <499>   DW_AT_name        : (indirect string, offset: 0x70733): __sFILE
    <49d>   DW_AT_byte_size   : 104
    <49e>   DW_AT_decl_file   : 7
    <49e>   DW_AT_decl_line   : 153
    <49f>   DW_AT_decl_column : 8
    <49f>   DW_AT_sibling     : <0x5d1>
 <2><4a3>: Abbrev Number: 10 (DW_TAG_member)
    <4a4>   DW_AT_name        : _p
    <4a7>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 154
    <4a8>   DW_AT_decl_column : 18
    <4a9>   DW_AT_type        : <0x493>
    <4ad>   DW_AT_data_member_location: 0
 <2><4ae>: Abbrev Number: 10 (DW_TAG_member)
    <4af>   DW_AT_name        : _r
    <4b2>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 155
    <4b3>   DW_AT_decl_column : 7
    <4b4>   DW_AT_type        : <0x213>
    <4b8>   DW_AT_data_member_location: 4
 <2><4b9>: Abbrev Number: 10 (DW_TAG_member)
    <4ba>   DW_AT_name        : _w
    <4bd>   DW_AT_decl_file   : 7
    <4bd>   DW_AT_decl_line   : 156
    <4be>   DW_AT_decl_column : 7
    <4bf>   DW_AT_type        : <0x213>
    <4c3>   DW_AT_data_member_location: 8
 <2><4c4>: Abbrev Number: 2 (DW_TAG_member)
    <4c5>   DW_AT_name        : (indirect string, offset: 0x44170): _flags
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 157
    <4cb>   DW_AT_decl_column : 9
    <4cc>   DW_AT_type        : <0x249>
    <4d0>   DW_AT_data_member_location: 12
 <2><4d1>: Abbrev Number: 2 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0x1953a): _file
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 158
    <4d8>   DW_AT_decl_column : 9
    <4d9>   DW_AT_type        : <0x249>
    <4dd>   DW_AT_data_member_location: 14
 <2><4de>: Abbrev Number: 10 (DW_TAG_member)
    <4df>   DW_AT_name        : _bf
    <4e3>   DW_AT_decl_file   : 7
    <4e3>   DW_AT_decl_line   : 159
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x46d>
    <4e9>   DW_AT_data_member_location: 16
 <2><4ea>: Abbrev Number: 2 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x447a7): _lbfsize
    <4ef>   DW_AT_decl_file   : 7
    <4f0>   DW_AT_decl_line   : 160
    <4f1>   DW_AT_decl_column : 7
    <4f2>   DW_AT_type        : <0x213>
    <4f6>   DW_AT_data_member_location: 24
 <2><4f7>: Abbrev Number: 2 (DW_TAG_member)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x6770f): _data
    <4fc>   DW_AT_decl_file   : 7
    <4fd>   DW_AT_decl_line   : 163
    <4fe>   DW_AT_decl_column : 18
    <4ff>   DW_AT_type        : <0x6ea>
    <503>   DW_AT_data_member_location: 28
 <2><504>: Abbrev Number: 2 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x83226): _cookie
    <509>   DW_AT_decl_file   : 7
    <50a>   DW_AT_decl_line   : 167
    <50b>   DW_AT_decl_column : 10
    <50c>   DW_AT_type        : <0x2a8>
    <510>   DW_AT_data_member_location: 32
 <2><511>: Abbrev Number: 2 (DW_TAG_member)
    <512>   DW_AT_name        : (indirect string, offset: 0x74045): _read
    <516>   DW_AT_decl_file   : 7
    <517>   DW_AT_decl_line   : 169
    <518>   DW_AT_decl_column : 29
    <519>   DW_AT_type        : <0x71e>
    <51d>   DW_AT_data_member_location: 36
 <2><51e>: Abbrev Number: 2 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x15115): _write
    <523>   DW_AT_decl_file   : 7
    <524>   DW_AT_decl_line   : 171
    <525>   DW_AT_decl_column : 29
    <526>   DW_AT_type        : <0x746>
    <52a>   DW_AT_data_member_location: 40
 <2><52b>: Abbrev Number: 2 (DW_TAG_member)
    <52c>   DW_AT_name        : (indirect string, offset: 0x8fe0c): _seek
    <530>   DW_AT_decl_file   : 7
    <531>   DW_AT_decl_line   : 174
    <532>   DW_AT_decl_column : 13
    <533>   DW_AT_type        : <0x769>
    <537>   DW_AT_data_member_location: 44
 <2><538>: Abbrev Number: 2 (DW_TAG_member)
    <539>   DW_AT_name        : (indirect string, offset: 0x41911): _close
    <53d>   DW_AT_decl_file   : 7
    <53e>   DW_AT_decl_line   : 175
    <53f>   DW_AT_decl_column : 9
    <540>   DW_AT_type        : <0x782>
    <544>   DW_AT_data_member_location: 48
 <2><545>: Abbrev Number: 10 (DW_TAG_member)
    <546>   DW_AT_name        : _ub
    <54a>   DW_AT_decl_file   : 7
    <54a>   DW_AT_decl_line   : 178
    <54b>   DW_AT_decl_column : 17
    <54c>   DW_AT_type        : <0x46d>
    <550>   DW_AT_data_member_location: 52
 <2><551>: Abbrev Number: 10 (DW_TAG_member)
    <552>   DW_AT_name        : _up
    <556>   DW_AT_decl_file   : 7
    <556>   DW_AT_decl_line   : 179
    <557>   DW_AT_decl_column : 18
    <558>   DW_AT_type        : <0x493>
    <55c>   DW_AT_data_member_location: 60
 <2><55d>: Abbrev Number: 10 (DW_TAG_member)
    <55e>   DW_AT_name        : _ur
    <562>   DW_AT_decl_file   : 7
    <562>   DW_AT_decl_line   : 180
    <563>   DW_AT_decl_column : 7
    <564>   DW_AT_type        : <0x213>
    <568>   DW_AT_data_member_location: 64
 <2><569>: Abbrev Number: 2 (DW_TAG_member)
    <56a>   DW_AT_name        : (indirect string, offset: 0x29ce3): _ubuf
    <56e>   DW_AT_decl_file   : 7
    <56f>   DW_AT_decl_line   : 183
    <570>   DW_AT_decl_column : 17
    <571>   DW_AT_type        : <0x787>
    <575>   DW_AT_data_member_location: 68
 <2><576>: Abbrev Number: 2 (DW_TAG_member)
    <577>   DW_AT_name        : (indirect string, offset: 0x63fda): _nbuf
    <57b>   DW_AT_decl_file   : 7
    <57c>   DW_AT_decl_line   : 184
    <57d>   DW_AT_decl_column : 17
    <57e>   DW_AT_type        : <0x797>
    <582>   DW_AT_data_member_location: 71
 <2><583>: Abbrev Number: 10 (DW_TAG_member)
    <584>   DW_AT_name        : _lb
    <588>   DW_AT_decl_file   : 7
    <588>   DW_AT_decl_line   : 187
    <589>   DW_AT_decl_column : 17
    <58a>   DW_AT_type        : <0x46d>
    <58e>   DW_AT_data_member_location: 72
 <2><58f>: Abbrev Number: 2 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x9566d): _blksize
    <594>   DW_AT_decl_file   : 7
    <595>   DW_AT_decl_line   : 190
    <596>   DW_AT_decl_column : 7
    <597>   DW_AT_type        : <0x213>
    <59b>   DW_AT_data_member_location: 80
 <2><59c>: Abbrev Number: 2 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0x31153): _offset
    <5a1>   DW_AT_decl_file   : 7
    <5a2>   DW_AT_decl_line   : 191
    <5a3>   DW_AT_decl_column : 10
    <5a4>   DW_AT_type        : <0x2db>
    <5a8>   DW_AT_data_member_location: 84
 <2><5a9>: Abbrev Number: 2 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0x2f437): _lock
    <5ae>   DW_AT_decl_file   : 7
    <5af>   DW_AT_decl_line   : 198
    <5b0>   DW_AT_decl_column : 12
    <5b1>   DW_AT_type        : <0x375>
    <5b5>   DW_AT_data_member_location: 88
 <2><5b6>: Abbrev Number: 2 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x13b59): _mbstate
    <5bb>   DW_AT_decl_file   : 7
    <5bc>   DW_AT_decl_line   : 200
    <5bd>   DW_AT_decl_column : 14
    <5be>   DW_AT_type        : <0x347>
    <5c2>   DW_AT_data_member_location: 92
 <2><5c3>: Abbrev Number: 2 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x77990): _flags2
    <5c8>   DW_AT_decl_file   : 7
    <5c9>   DW_AT_decl_line   : 201
    <5ca>   DW_AT_decl_column : 9
    <5cb>   DW_AT_type        : <0x213>
    <5cf>   DW_AT_data_member_location: 100
 <2><5d0>: Abbrev Number: 0
 <1><5d1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xa054c): _reent
    <5d6>   DW_AT_byte_size   : 76
    <5d7>   DW_AT_decl_file   : 7
    <5d8>   DW_AT_decl_line   : 379
    <5da>   DW_AT_decl_column : 8
    <5db>   DW_AT_sibling     : <0x6ea>
 <2><5df>: Abbrev Number: 1 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x95dab): _errno
    <5e4>   DW_AT_decl_file   : 7
    <5e5>   DW_AT_decl_line   : 383
    <5e7>   DW_AT_decl_column : 7
    <5e8>   DW_AT_type        : <0x213>
    <5ec>   DW_AT_data_member_location: 0
 <2><5ed>: Abbrev Number: 1 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x4b6b2): _stdin
    <5f2>   DW_AT_decl_file   : 7
    <5f3>   DW_AT_decl_line   : 388
    <5f5>   DW_AT_decl_column : 11
    <5f6>   DW_AT_type        : <0x7b4>
    <5fa>   DW_AT_data_member_location: 4
 <2><5fb>: Abbrev Number: 1 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x651d7): _stdout
    <600>   DW_AT_decl_file   : 7
    <601>   DW_AT_decl_line   : 388
    <603>   DW_AT_decl_column : 20
    <604>   DW_AT_type        : <0x7b4>
    <608>   DW_AT_data_member_location: 8
 <2><609>: Abbrev Number: 1 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x85c6c): _stderr
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 388
    <611>   DW_AT_decl_column : 30
    <612>   DW_AT_type        : <0x7b4>
    <616>   DW_AT_data_member_location: 12
 <2><617>: Abbrev Number: 1 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x5d8eb): _inc
    <61c>   DW_AT_decl_file   : 7
    <61d>   DW_AT_decl_line   : 390
    <61f>   DW_AT_decl_column : 8
    <620>   DW_AT_type        : <0x213>
    <624>   DW_AT_data_member_location: 16
 <2><625>: Abbrev Number: 1 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0x746e9): _emergency
    <62a>   DW_AT_decl_file   : 7
    <62b>   DW_AT_decl_line   : 392
    <62d>   DW_AT_decl_column : 9
    <62e>   DW_AT_type        : <0x70d>
    <632>   DW_AT_data_member_location: 20
 <2><633>: Abbrev Number: 1 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x82664): _locale
    <638>   DW_AT_decl_file   : 7
    <639>   DW_AT_decl_line   : 398
    <63b>   DW_AT_decl_column : 22
    <63c>   DW_AT_type        : <0x91a>
    <640>   DW_AT_data_member_location: 24
 <2><641>: Abbrev Number: 31 (DW_TAG_member)
    <642>   DW_AT_name        : _mp
    <646>   DW_AT_decl_file   : 7
    <647>   DW_AT_decl_line   : 400
    <649>   DW_AT_decl_column : 18
    <64a>   DW_AT_type        : <0x91f>
    <64e>   DW_AT_data_member_location: 28
 <2><64f>: Abbrev Number: 1 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0x19c10): __cleanup
    <654>   DW_AT_decl_file   : 7
    <655>   DW_AT_decl_line   : 402
    <657>   DW_AT_decl_column : 10
    <658>   DW_AT_type        : <0x92f>
    <65c>   DW_AT_data_member_location: 32
 <2><65d>: Abbrev Number: 1 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xd56d): _gamma_signgam
    <662>   DW_AT_decl_file   : 7
    <663>   DW_AT_decl_line   : 404
    <665>   DW_AT_decl_column : 7
    <666>   DW_AT_type        : <0x213>
    <66a>   DW_AT_data_member_location: 36
 <2><66b>: Abbrev Number: 1 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x6c003): _cvtlen
    <670>   DW_AT_decl_file   : 7
    <671>   DW_AT_decl_line   : 407
    <673>   DW_AT_decl_column : 7
    <674>   DW_AT_type        : <0x213>
    <678>   DW_AT_data_member_location: 40
 <2><679>: Abbrev Number: 1 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0x44fff): _cvtbuf
    <67e>   DW_AT_decl_file   : 7
    <67f>   DW_AT_decl_line   : 408
    <681>   DW_AT_decl_column : 9
    <682>   DW_AT_type        : <0x70d>
    <686>   DW_AT_data_member_location: 44
 <2><687>: Abbrev Number: 1 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x6dd19): _r48
    <68c>   DW_AT_decl_file   : 7
    <68d>   DW_AT_decl_line   : 410
    <68f>   DW_AT_decl_column : 19
    <690>   DW_AT_type        : <0x934>
    <694>   DW_AT_data_member_location: 48
 <2><695>: Abbrev Number: 1 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x7a4e7): _localtime_buf
    <69a>   DW_AT_decl_file   : 7
    <69b>   DW_AT_decl_line   : 411
    <69d>   DW_AT_decl_column : 16
    <69e>   DW_AT_type        : <0x939>
    <6a2>   DW_AT_data_member_location: 52
 <2><6a3>: Abbrev Number: 1 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x24eb8): _asctime_buf
    <6a8>   DW_AT_decl_file   : 7
    <6a9>   DW_AT_decl_line   : 412
    <6ab>   DW_AT_decl_column : 9
    <6ac>   DW_AT_type        : <0x70d>
    <6b0>   DW_AT_data_member_location: 56
 <2><6b1>: Abbrev Number: 1 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xaa0a): _sig_func
    <6b6>   DW_AT_decl_file   : 7
    <6b7>   DW_AT_decl_line   : 415
    <6b9>   DW_AT_decl_column : 12
    <6ba>   DW_AT_type        : <0x949>
    <6be>   DW_AT_data_member_location: 60
 <2><6bf>: Abbrev Number: 1 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x29b77): __sf
    <6c4>   DW_AT_decl_file   : 7
    <6c5>   DW_AT_decl_line   : 423
    <6c7>   DW_AT_decl_column : 11
    <6c8>   DW_AT_type        : <0x7b4>
    <6cc>   DW_AT_data_member_location: 64
 <2><6cd>: Abbrev Number: 1 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x43645): _misc
    <6d2>   DW_AT_decl_file   : 7
    <6d3>   DW_AT_decl_line   : 424
    <6d5>   DW_AT_decl_column : 23
    <6d6>   DW_AT_type        : <0x953>
    <6da>   DW_AT_data_member_location: 68
 <2><6db>: Abbrev Number: 1 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x5c043): _signal_buf
    <6e0>   DW_AT_decl_file   : 7
    <6e1>   DW_AT_decl_line   : 425
    <6e3>   DW_AT_decl_column : 9
    <6e4>   DW_AT_type        : <0x70d>
    <6e8>   DW_AT_data_member_location: 72
 <2><6e9>: Abbrev Number: 0
 <1><6ea>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <6eb>   DW_AT_byte_size   : 4
    <6eb>   DW_AT_type        : <0x5d1>
 <1><6ef>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <6f0>   DW_AT_prototyped  : 1
    <6f0>   DW_AT_type        : <0x213>
    <6f4>   DW_AT_sibling     : <0x70d>
 <2><6f8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6f9>   DW_AT_type        : <0x6ea>
 <2><6fd>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6fe>   DW_AT_type        : <0x2a8>
 <2><702>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <703>   DW_AT_type        : <0x70d>
 <2><707>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <708>   DW_AT_type        : <0x213>
 <2><70c>: Abbrev Number: 0
 <1><70d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <70e>   DW_AT_byte_size   : 4
    <70e>   DW_AT_type        : <0x712>
 <1><712>: Abbrev Number: 7 (DW_TAG_base_type)
    <713>   DW_AT_byte_size   : 1
    <714>   DW_AT_encoding    : 8	(unsigned char)
    <715>   DW_AT_name        : (indirect string, offset: 0x3153b): char
 <1><719>: Abbrev Number: 23 (DW_TAG_const_type)
    <71a>   DW_AT_type        : <0x712>
 <1><71e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <71f>   DW_AT_byte_size   : 4
    <71f>   DW_AT_type        : <0x6ef>
 <1><723>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <724>   DW_AT_prototyped  : 1
    <724>   DW_AT_type        : <0x213>
    <728>   DW_AT_sibling     : <0x741>
 <2><72c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <72d>   DW_AT_type        : <0x6ea>
 <2><731>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <732>   DW_AT_type        : <0x2a8>
 <2><736>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <737>   DW_AT_type        : <0x741>
 <2><73b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <73c>   DW_AT_type        : <0x213>
 <2><740>: Abbrev Number: 0
 <1><741>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <742>   DW_AT_byte_size   : 4
    <742>   DW_AT_type        : <0x719>
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x723>
 <1><74b>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <74c>   DW_AT_prototyped  : 1
    <74c>   DW_AT_type        : <0x2e7>
    <750>   DW_AT_sibling     : <0x769>
 <2><754>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <755>   DW_AT_type        : <0x6ea>
 <2><759>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <75a>   DW_AT_type        : <0x2a8>
 <2><75e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <75f>   DW_AT_type        : <0x2e7>
 <2><763>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <764>   DW_AT_type        : <0x213>
 <2><768>: Abbrev Number: 0
 <1><769>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76a>   DW_AT_byte_size   : 4
    <76a>   DW_AT_type        : <0x74b>
 <1><76e>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <76f>   DW_AT_prototyped  : 1
    <76f>   DW_AT_type        : <0x213>
    <773>   DW_AT_sibling     : <0x782>
 <2><777>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <778>   DW_AT_type        : <0x6ea>
 <2><77c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <77d>   DW_AT_type        : <0x2a8>
 <2><781>: Abbrev Number: 0
 <1><782>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <783>   DW_AT_byte_size   : 4
    <783>   DW_AT_type        : <0x76e>
 <1><787>: Abbrev Number: 8 (DW_TAG_array_type)
    <788>   DW_AT_type        : <0x242>
    <78c>   DW_AT_sibling     : <0x797>
 <2><790>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <791>   DW_AT_type        : <0x21a>
    <795>   DW_AT_upper_bound : 2
 <2><796>: Abbrev Number: 0
 <1><797>: Abbrev Number: 8 (DW_TAG_array_type)
    <798>   DW_AT_type        : <0x242>
    <79c>   DW_AT_sibling     : <0x7a7>
 <2><7a0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <7a1>   DW_AT_type        : <0x21a>
    <7a5>   DW_AT_upper_bound : 0
 <2><7a6>: Abbrev Number: 0
 <1><7a7>: Abbrev Number: 12 (DW_TAG_typedef)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x5dcfc): __FILE
    <7ac>   DW_AT_decl_file   : 7
    <7ad>   DW_AT_decl_line   : 270
    <7af>   DW_AT_decl_column : 26
    <7b0>   DW_AT_type        : <0x498>
 <1><7b4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <7b5>   DW_AT_byte_size   : 4
    <7b5>   DW_AT_type        : <0x7a7>
 <1><7b9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x34804): _rand48
    <7be>   DW_AT_byte_size   : 24
    <7bf>   DW_AT_decl_file   : 7
    <7c0>   DW_AT_decl_line   : 306
    <7c2>   DW_AT_decl_column : 8
    <7c3>   DW_AT_sibling     : <0x800>
 <2><7c7>: Abbrev Number: 1 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x2c907): _seed
    <7cc>   DW_AT_decl_file   : 7
    <7cd>   DW_AT_decl_line   : 307
    <7cf>   DW_AT_decl_column : 18
    <7d0>   DW_AT_type        : <0x800>
    <7d4>   DW_AT_data_member_location: 0
 <2><7d5>: Abbrev Number: 1 (DW_TAG_member)
    <7d6>   DW_AT_name        : (indirect string, offset: 0xf54c): _mult
    <7da>   DW_AT_decl_file   : 7
    <7db>   DW_AT_decl_line   : 308
    <7dd>   DW_AT_decl_column : 18
    <7de>   DW_AT_type        : <0x800>
    <7e2>   DW_AT_data_member_location: 6
 <2><7e3>: Abbrev Number: 1 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0x4ca89): _add
    <7e8>   DW_AT_decl_file   : 7
    <7e9>   DW_AT_decl_line   : 309
    <7eb>   DW_AT_decl_column : 18
    <7ec>   DW_AT_type        : <0x25c>
    <7f0>   DW_AT_data_member_location: 12
 <2><7f1>: Abbrev Number: 1 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x58261): _rand_next
    <7f6>   DW_AT_decl_file   : 7
    <7f7>   DW_AT_decl_line   : 312
    <7f9>   DW_AT_decl_column : 36
    <7fa>   DW_AT_type        : <0x27d>
    <7fe>   DW_AT_data_member_location: 16
 <2><7ff>: Abbrev Number: 0
 <1><800>: Abbrev Number: 8 (DW_TAG_array_type)
    <801>   DW_AT_type        : <0x25c>
    <805>   DW_AT_sibling     : <0x810>
 <2><809>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <80a>   DW_AT_type        : <0x21a>
    <80e>   DW_AT_upper_bound : 2
 <2><80f>: Abbrev Number: 0
 <1><810>: Abbrev Number: 11 (DW_TAG_structure_type)
    <811>   DW_AT_name        : (indirect string, offset: 0x6fc38): _mprec
    <815>   DW_AT_byte_size   : 16
    <816>   DW_AT_decl_file   : 7
    <817>   DW_AT_decl_line   : 348
    <819>   DW_AT_decl_column : 8
    <81a>   DW_AT_sibling     : <0x857>
 <2><81e>: Abbrev Number: 1 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0x92068): _result
    <823>   DW_AT_decl_file   : 7
    <824>   DW_AT_decl_line   : 351
    <826>   DW_AT_decl_column : 19
    <827>   DW_AT_type        : <0x3d7>
    <82b>   DW_AT_data_member_location: 0
 <2><82c>: Abbrev Number: 1 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x6f7b0): _result_k
    <831>   DW_AT_decl_file   : 7
    <832>   DW_AT_decl_line   : 352
    <834>   DW_AT_decl_column : 7
    <835>   DW_AT_type        : <0x213>
    <839>   DW_AT_data_member_location: 4
 <2><83a>: Abbrev Number: 1 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x47251): _p5s
    <83f>   DW_AT_decl_file   : 7
    <840>   DW_AT_decl_line   : 353
    <842>   DW_AT_decl_column : 19
    <843>   DW_AT_type        : <0x3d7>
    <847>   DW_AT_data_member_location: 8
 <2><848>: Abbrev Number: 1 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x55e21): _freelist
    <84d>   DW_AT_decl_file   : 7
    <84e>   DW_AT_decl_line   : 354
    <850>   DW_AT_decl_column : 20
    <851>   DW_AT_type        : <0x857>
    <855>   DW_AT_data_member_location: 12
 <2><856>: Abbrev Number: 0
 <1><857>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <858>   DW_AT_byte_size   : 4
    <858>   DW_AT_type        : <0x3d7>
 <1><85c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <85d>   DW_AT_name        : (indirect string, offset: 0x47221): _misc_reent
    <861>   DW_AT_byte_size   : 80
    <862>   DW_AT_decl_file   : 7
    <863>   DW_AT_decl_line   : 358
    <865>   DW_AT_decl_column : 8
    <866>   DW_AT_sibling     : <0x905>
 <2><86a>: Abbrev Number: 1 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x862e9): _strtok_last
    <86f>   DW_AT_decl_file   : 7
    <870>   DW_AT_decl_line   : 361
    <872>   DW_AT_decl_column : 9
    <873>   DW_AT_type        : <0x70d>
    <877>   DW_AT_data_member_location: 0
 <2><878>: Abbrev Number: 1 (DW_TAG_member)
    <879>   DW_AT_name        : (indirect string, offset: 0x412f2): _mblen_state
    <87d>   DW_AT_decl_file   : 7
    <87e>   DW_AT_decl_line   : 362
    <880>   DW_AT_decl_column : 14
    <881>   DW_AT_type        : <0x347>
    <885>   DW_AT_data_member_location: 4
 <2><886>: Abbrev Number: 1 (DW_TAG_member)
    <887>   DW_AT_name        : (indirect string, offset: 0x86318): _wctomb_state
    <88b>   DW_AT_decl_file   : 7
    <88c>   DW_AT_decl_line   : 363
    <88e>   DW_AT_decl_column : 14
    <88f>   DW_AT_type        : <0x347>
    <893>   DW_AT_data_member_location: 12
 <2><894>: Abbrev Number: 1 (DW_TAG_member)
    <895>   DW_AT_name        : (indirect string, offset: 0x7d540): _mbtowc_state
    <899>   DW_AT_decl_file   : 7
    <89a>   DW_AT_decl_line   : 364
    <89c>   DW_AT_decl_column : 14
    <89d>   DW_AT_type        : <0x347>
    <8a1>   DW_AT_data_member_location: 20
 <2><8a2>: Abbrev Number: 1 (DW_TAG_member)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x4b8e7): _l64a_buf
    <8a7>   DW_AT_decl_file   : 7
    <8a8>   DW_AT_decl_line   : 365
    <8aa>   DW_AT_decl_column : 8
    <8ab>   DW_AT_type        : <0x905>
    <8af>   DW_AT_data_member_location: 28
 <2><8b0>: Abbrev Number: 1 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x85438): _getdate_err
    <8b5>   DW_AT_decl_file   : 7
    <8b6>   DW_AT_decl_line   : 366
    <8b8>   DW_AT_decl_column : 7
    <8b9>   DW_AT_type        : <0x213>
    <8bd>   DW_AT_data_member_location: 36
 <2><8be>: Abbrev Number: 1 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x48156): _mbrlen_state
    <8c3>   DW_AT_decl_file   : 7
    <8c4>   DW_AT_decl_line   : 367
    <8c6>   DW_AT_decl_column : 14
    <8c7>   DW_AT_type        : <0x347>
    <8cb>   DW_AT_data_member_location: 40
 <2><8cc>: Abbrev Number: 1 (DW_TAG_member)
    <8cd>   DW_AT_name        : (indirect string, offset: 0x22842): _mbrtowc_state
    <8d1>   DW_AT_decl_file   : 7
    <8d2>   DW_AT_decl_line   : 368
    <8d4>   DW_AT_decl_column : 14
    <8d5>   DW_AT_type        : <0x347>
    <8d9>   DW_AT_data_member_location: 48
 <2><8da>: Abbrev Number: 1 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x616eb): _mbsrtowcs_state
    <8df>   DW_AT_decl_file   : 7
    <8e0>   DW_AT_decl_line   : 369
    <8e2>   DW_AT_decl_column : 14
    <8e3>   DW_AT_type        : <0x347>
    <8e7>   DW_AT_data_member_location: 56
 <2><8e8>: Abbrev Number: 1 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x2f142): _wcrtomb_state
    <8ed>   DW_AT_decl_file   : 7
    <8ee>   DW_AT_decl_line   : 370
    <8f0>   DW_AT_decl_column : 14
    <8f1>   DW_AT_type        : <0x347>
    <8f5>   DW_AT_data_member_location: 64
 <2><8f6>: Abbrev Number: 1 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x546ea): _wcsrtombs_state
    <8fb>   DW_AT_decl_file   : 7
    <8fc>   DW_AT_decl_line   : 371
    <8fe>   DW_AT_decl_column : 14
    <8ff>   DW_AT_type        : <0x347>
    <903>   DW_AT_data_member_location: 72
 <2><904>: Abbrev Number: 0
 <1><905>: Abbrev Number: 8 (DW_TAG_array_type)
    <906>   DW_AT_type        : <0x712>
    <90a>   DW_AT_sibling     : <0x915>
 <2><90e>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <90f>   DW_AT_type        : <0x21a>
    <913>   DW_AT_upper_bound : 7
 <2><914>: Abbrev Number: 0
 <1><915>: Abbrev Number: 18 (DW_TAG_structure_type)
    <916>   DW_AT_name        : (indirect string, offset: 0x7dec0): __locale_t
    <91a>   DW_AT_declaration : 1
 <1><91a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <91b>   DW_AT_byte_size   : 4
    <91b>   DW_AT_type        : <0x915>
 <1><91f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <920>   DW_AT_byte_size   : 4
    <920>   DW_AT_type        : <0x810>
 <1><924>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <925>   DW_AT_prototyped  : 1
    <925>   DW_AT_sibling     : <0x92f>
 <2><929>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <92a>   DW_AT_type        : <0x6ea>
 <2><92e>: Abbrev Number: 0
 <1><92f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <930>   DW_AT_byte_size   : 4
    <930>   DW_AT_type        : <0x924>
 <1><934>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <935>   DW_AT_byte_size   : 4
    <935>   DW_AT_type        : <0x7b9>
 <1><939>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93a>   DW_AT_byte_size   : 4
    <93a>   DW_AT_type        : <0x3ec>
 <1><93e>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <93f>   DW_AT_prototyped  : 1
    <93f>   DW_AT_sibling     : <0x949>
 <2><943>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <944>   DW_AT_type        : <0x213>
 <2><948>: Abbrev Number: 0
 <1><949>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <94a>   DW_AT_byte_size   : 4
    <94a>   DW_AT_type        : <0x94e>
 <1><94e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <94f>   DW_AT_byte_size   : 4
    <94f>   DW_AT_type        : <0x93e>
 <1><953>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <954>   DW_AT_byte_size   : 4
    <954>   DW_AT_type        : <0x85c>
 <1><958>: Abbrev Number: 11 (DW_TAG_structure_type)
    <959>   DW_AT_name        : (indirect string, offset: 0x7aeae): xSTATIC_LIST_ITEM
    <95d>   DW_AT_byte_size   : 20
    <95e>   DW_AT_decl_file   : 9
    <95f>   DW_AT_decl_line   : 1061
    <961>   DW_AT_decl_column : 8
    <962>   DW_AT_sibling     : <0x983>
 <2><966>: Abbrev Number: 1 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x9dcf1): xDummy2
    <96b>   DW_AT_decl_file   : 9
    <96c>   DW_AT_decl_line   : 1066
    <96e>   DW_AT_decl_column : 13
    <96f>   DW_AT_type        : <0x2c2>
    <973>   DW_AT_data_member_location: 0
 <2><974>: Abbrev Number: 1 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x364a0): pvDummy3
    <979>   DW_AT_decl_file   : 9
    <97a>   DW_AT_decl_line   : 1067
    <97c>   DW_AT_decl_column : 8
    <97d>   DW_AT_type        : <0x983>
    <981>   DW_AT_data_member_location: 4
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 8 (DW_TAG_array_type)
    <984>   DW_AT_type        : <0x2a8>
    <988>   DW_AT_sibling     : <0x993>
 <2><98c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <98d>   DW_AT_type        : <0x21a>
    <991>   DW_AT_upper_bound : 3
 <2><992>: Abbrev Number: 0
 <1><993>: Abbrev Number: 12 (DW_TAG_typedef)
    <994>   DW_AT_name        : (indirect string, offset: 0x366ef): StaticListItem_t
    <998>   DW_AT_decl_file   : 9
    <999>   DW_AT_decl_line   : 1072
    <99b>   DW_AT_decl_column : 34
    <99c>   DW_AT_type        : <0x958>
 <1><9a0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x551c1): xSTATIC_TCB
    <9a5>   DW_AT_byte_size   : 160
    <9a6>   DW_AT_decl_file   : 9
    <9a7>   DW_AT_decl_line   : 1112
    <9a9>   DW_AT_decl_column : 16
    <9aa>   DW_AT_sibling     : <0xa3b>
 <2><9ae>: Abbrev Number: 1 (DW_TAG_member)
    <9af>   DW_AT_name        : (indirect string, offset: 0x205f1): pxDummy1
    <9b3>   DW_AT_decl_file   : 9
    <9b4>   DW_AT_decl_line   : 1114
    <9b6>   DW_AT_decl_column : 11
    <9b7>   DW_AT_type        : <0x2a8>
    <9bb>   DW_AT_data_member_location: 0
 <2><9bc>: Abbrev Number: 1 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x1ea3e): xDummy3
    <9c1>   DW_AT_decl_file   : 9
    <9c2>   DW_AT_decl_line   : 1118
    <9c4>   DW_AT_decl_column : 19
    <9c5>   DW_AT_type        : <0xa3b>
    <9c9>   DW_AT_data_member_location: 4
 <2><9ca>: Abbrev Number: 1 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x172a5): uxDummy5
    <9cf>   DW_AT_decl_file   : 9
    <9d0>   DW_AT_decl_line   : 1119
    <9d2>   DW_AT_decl_column : 16
    <9d3>   DW_AT_type        : <0x2b6>
    <9d7>   DW_AT_data_member_location: 44
 <2><9d8>: Abbrev Number: 1 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x205fa): pxDummy6
    <9dd>   DW_AT_decl_file   : 9
    <9de>   DW_AT_decl_line   : 1120
    <9e0>   DW_AT_decl_column : 11
    <9e1>   DW_AT_type        : <0x2a8>
    <9e5>   DW_AT_data_member_location: 48
 <2><9e6>: Abbrev Number: 1 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x355a3): ucDummy7
    <9eb>   DW_AT_decl_file   : 9
    <9ec>   DW_AT_decl_line   : 1121
    <9ee>   DW_AT_decl_column : 13
    <9ef>   DW_AT_type        : <0xa4b>
    <9f3>   DW_AT_data_member_location: 52
 <2><9f4>: Abbrev Number: 1 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x84c4f): uxDummy12
    <9f9>   DW_AT_decl_file   : 9
    <9fa>   DW_AT_decl_line   : 1132
    <9fc>   DW_AT_decl_column : 16
    <9fd>   DW_AT_type        : <0xa5b>
    <a01>   DW_AT_data_member_location: 68
 <2><a02>: Abbrev Number: 1 (DW_TAG_member)
    <a03>   DW_AT_name        : (indirect string, offset: 0x758d1): xDummy17
    <a07>   DW_AT_decl_file   : 9
    <a08>   DW_AT_decl_line   : 1144
    <a0a>   DW_AT_decl_column : 17
    <a0b>   DW_AT_type        : <0x5d1>
    <a0f>   DW_AT_data_member_location: 76
 <2><a10>: Abbrev Number: 1 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0x18262): ulDummy18
    <a15>   DW_AT_decl_file   : 9
    <a16>   DW_AT_decl_line   : 1147
    <a18>   DW_AT_decl_column : 14
    <a19>   DW_AT_type        : <0x29c>
    <a1d>   DW_AT_data_member_location: 152
 <2><a1e>: Abbrev Number: 1 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x8ff49): ucDummy19
    <a23>   DW_AT_decl_file   : 9
    <a24>   DW_AT_decl_line   : 1148
    <a26>   DW_AT_decl_column : 13
    <a27>   DW_AT_type        : <0x284>
    <a2b>   DW_AT_data_member_location: 156
 <2><a2c>: Abbrev Number: 1 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x84f9b): uxDummy20
    <a31>   DW_AT_decl_file   : 9
    <a32>   DW_AT_decl_line   : 1151
    <a34>   DW_AT_decl_column : 13
    <a35>   DW_AT_type        : <0x284>
    <a39>   DW_AT_data_member_location: 157
 <2><a3a>: Abbrev Number: 0
 <1><a3b>: Abbrev Number: 8 (DW_TAG_array_type)
    <a3c>   DW_AT_type        : <0x993>
    <a40>   DW_AT_sibling     : <0xa4b>
 <2><a44>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a45>   DW_AT_type        : <0x21a>
    <a49>   DW_AT_upper_bound : 1
 <2><a4a>: Abbrev Number: 0
 <1><a4b>: Abbrev Number: 8 (DW_TAG_array_type)
    <a4c>   DW_AT_type        : <0x284>
    <a50>   DW_AT_sibling     : <0xa5b>
 <2><a54>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a55>   DW_AT_type        : <0x21a>
    <a59>   DW_AT_upper_bound : 15
 <2><a5a>: Abbrev Number: 0
 <1><a5b>: Abbrev Number: 8 (DW_TAG_array_type)
    <a5c>   DW_AT_type        : <0x2b6>
    <a60>   DW_AT_sibling     : <0xa6b>
 <2><a64>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a65>   DW_AT_type        : <0x21a>
    <a69>   DW_AT_upper_bound : 1
 <2><a6a>: Abbrev Number: 0
 <1><a6b>: Abbrev Number: 12 (DW_TAG_typedef)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x49c8d): StaticTask_t
    <a70>   DW_AT_decl_file   : 9
    <a71>   DW_AT_decl_line   : 1160
    <a73>   DW_AT_decl_column : 3
    <a74>   DW_AT_type        : <0x9a0>
 <1><a78>: Abbrev Number: 4 (DW_TAG_typedef)
    <a79>   DW_AT_name        : (indirect string, offset: 0x7fb74): TaskHandle_t
    <a7d>   DW_AT_decl_file   : 10
    <a7e>   DW_AT_decl_line   : 70
    <a7f>   DW_AT_decl_column : 37
    <a80>   DW_AT_type        : <0xa84>
 <1><a84>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 4
    <a85>   DW_AT_type        : <0xa89>
 <1><a89>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x7ce87): tskTaskControlBlock
    <a8e>   DW_AT_declaration : 1
 <1><a8e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a8f>   DW_AT_byte_size   : 4
    <a8f>   DW_AT_type        : <0x2aa>
 <1><a93>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <a94>   DW_AT_encoding    : 5	(signed)
    <a95>   DW_AT_byte_size   : 2
    <a96>   DW_AT_type        : <0x249>
    <a9a>   DW_AT_decl_file   : 11
    <a9a>   DW_AT_decl_line   : 172
    <a9b>   DW_AT_decl_column : 15
    <a9b>   DW_AT_sibling     : <0xad0>
 <2><a9f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x7f76f): osPriorityIdle
    <aa4>   DW_AT_const_value : -3
 <2><aa5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x87710): osPriorityLow
    <aaa>   DW_AT_const_value : -2
 <2><aab>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x8cf2f): osPriorityBelowNormal
    <ab0>   DW_AT_const_value : -1
 <2><ab1>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x9d2d2): osPriorityNormal
    <ab6>   DW_AT_const_value : 0
 <2><ab7>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x5e7d8): osPriorityAboveNormal
    <abc>   DW_AT_const_value : 1
 <2><abd>: Abbrev Number: 6 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x35b94): osPriorityHigh
    <ac2>   DW_AT_const_value : 2
 <2><ac3>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x852cb): osPriorityRealtime
    <ac8>   DW_AT_const_value : 3
 <2><ac9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <aca>   DW_AT_name        : (indirect string, offset: 0x821bf): osPriorityError
    <ace>   DW_AT_const_value : 132
 <2><acf>: Abbrev Number: 0
 <1><ad0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x9e605): osPriority
    <ad5>   DW_AT_decl_file   : 11
    <ad6>   DW_AT_decl_line   : 181
    <ad7>   DW_AT_decl_column : 3
    <ad8>   DW_AT_type        : <0xa93>
 <1><adc>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <add>   DW_AT_encoding    : 7	(unsigned)
    <ade>   DW_AT_byte_size   : 4
    <adf>   DW_AT_type        : <0x21a>
    <ae3>   DW_AT_decl_file   : 11
    <ae3>   DW_AT_decl_line   : 189
    <ae4>   DW_AT_decl_column : 15
    <ae4>   DW_AT_sibling     : <0xb46>
 <2><ae8>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x81fc2): osOK
    <aed>   DW_AT_const_value : 0
 <2><aee>: Abbrev Number: 6 (DW_TAG_enumerator)
    <aef>   DW_AT_name        : (indirect string, offset: 0x6bc2e): osEventSignal
    <af3>   DW_AT_const_value : 8
 <2><af4>: Abbrev Number: 6 (DW_TAG_enumerator)
    <af5>   DW_AT_name        : (indirect string, offset: 0x4c28): osEventMessage
    <af9>   DW_AT_const_value : 16
 <2><afa>: Abbrev Number: 6 (DW_TAG_enumerator)
    <afb>   DW_AT_name        : (indirect string, offset: 0x5e4cc): osEventMail
    <aff>   DW_AT_const_value : 32
 <2><b00>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b01>   DW_AT_name        : (indirect string, offset: 0x1bd03): osEventTimeout
    <b05>   DW_AT_const_value : 64
 <2><b06>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b07>   DW_AT_name        : (indirect string, offset: 0x28151): osErrorParameter
    <b0b>   DW_AT_const_value : 128
 <2><b0c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x60218): osErrorResource
    <b11>   DW_AT_const_value : 129
 <2><b12>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b13>   DW_AT_name        : (indirect string, offset: 0x66b5a): osErrorTimeoutResource
    <b17>   DW_AT_const_value : 193
 <2><b18>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b19>   DW_AT_name        : (indirect string, offset: 0x29988): osErrorISR
    <b1d>   DW_AT_const_value : 130
 <2><b1e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x77f8c): osErrorISRRecursive
    <b23>   DW_AT_const_value : 131
 <2><b24>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b25>   DW_AT_name        : (indirect string, offset: 0x8bcef): osErrorPriority
    <b29>   DW_AT_const_value : 132
 <2><b2a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x1c61f): osErrorNoMemory
    <b2f>   DW_AT_const_value : 133
 <2><b30>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b31>   DW_AT_name        : (indirect string, offset: 0x65f81): osErrorValue
    <b35>   DW_AT_const_value : 134
 <2><b36>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b37>   DW_AT_name        : (indirect string, offset: 0x4f1e7): osErrorOS
    <b3b>   DW_AT_const_value : 255
 <2><b3c>: Abbrev Number: 32 (DW_TAG_enumerator)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x31266): os_status_reserved
    <b41>   DW_AT_const_value : 0x7fffffff
 <2><b45>: Abbrev Number: 0
 <1><b46>: Abbrev Number: 4 (DW_TAG_typedef)
    <b47>   DW_AT_name        : (indirect string, offset: 0x1a288): osStatus
    <b4b>   DW_AT_decl_file   : 11
    <b4c>   DW_AT_decl_line   : 205
    <b4d>   DW_AT_decl_column : 3
    <b4e>   DW_AT_type        : <0xadc>
 <1><b52>: Abbrev Number: 4 (DW_TAG_typedef)
    <b53>   DW_AT_name        : (indirect string, offset: 0x49608): os_pthread
    <b57>   DW_AT_decl_file   : 11
    <b58>   DW_AT_decl_line   : 228
    <b59>   DW_AT_decl_column : 16
    <b5a>   DW_AT_type        : <0xb5e>
 <1><b5e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b5f>   DW_AT_byte_size   : 4
    <b5f>   DW_AT_type        : <0xb63>
 <1><b63>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <b64>   DW_AT_prototyped  : 1
    <b64>   DW_AT_sibling     : <0xb6e>
 <2><b68>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b69>   DW_AT_type        : <0xb6e>
 <2><b6d>: Abbrev Number: 0
 <1><b6e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b6f>   DW_AT_byte_size   : 4
    <b6f>   DW_AT_type        : <0xb73>
 <1><b73>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><b74>: Abbrev Number: 4 (DW_TAG_typedef)
    <b75>   DW_AT_name        : (indirect string, offset: 0x1d720): osThreadId
    <b79>   DW_AT_decl_file   : 11
    <b7a>   DW_AT_decl_line   : 238
    <b7b>   DW_AT_decl_column : 22
    <b7c>   DW_AT_type        : <0xa78>
 <1><b80>: Abbrev Number: 12 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x5c22c): osStaticThreadDef_t
    <b85>   DW_AT_decl_file   : 11
    <b86>   DW_AT_decl_line   : 267
    <b88>   DW_AT_decl_column : 36
    <b89>   DW_AT_type        : <0xa6b>
 <1><b8d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x20556): os_thread_def
    <b92>   DW_AT_byte_size   : 28
    <b93>   DW_AT_decl_file   : 11
    <b94>   DW_AT_decl_line   : 280
    <b96>   DW_AT_decl_column : 16
    <b97>   DW_AT_sibling     : <0xbfe>
 <2><b9b>: Abbrev Number: 1 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x61e50): name
    <ba0>   DW_AT_decl_file   : 11
    <ba1>   DW_AT_decl_line   : 281
    <ba3>   DW_AT_decl_column : 27
    <ba4>   DW_AT_type        : <0x70d>
    <ba8>   DW_AT_data_member_location: 0
 <2><ba9>: Abbrev Number: 1 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0x4960b): pthread
    <bae>   DW_AT_decl_file   : 11
    <baf>   DW_AT_decl_line   : 282
    <bb1>   DW_AT_decl_column : 26
    <bb2>   DW_AT_type        : <0xb52>
    <bb6>   DW_AT_data_member_location: 4
 <2><bb7>: Abbrev Number: 1 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x6a592): tpriority
    <bbc>   DW_AT_decl_file   : 11
    <bbd>   DW_AT_decl_line   : 283
    <bbf>   DW_AT_decl_column : 26
    <bc0>   DW_AT_type        : <0xad0>
    <bc4>   DW_AT_data_member_location: 8
 <2><bc5>: Abbrev Number: 1 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x3e1e8): instances
    <bca>   DW_AT_decl_file   : 11
    <bcb>   DW_AT_decl_line   : 284
    <bcd>   DW_AT_decl_column : 26
    <bce>   DW_AT_type        : <0x29c>
    <bd2>   DW_AT_data_member_location: 12
 <2><bd3>: Abbrev Number: 1 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0xea29): stacksize
    <bd8>   DW_AT_decl_file   : 11
    <bd9>   DW_AT_decl_line   : 285
    <bdb>   DW_AT_decl_column : 26
    <bdc>   DW_AT_type        : <0x29c>
    <be0>   DW_AT_data_member_location: 16
 <2><be1>: Abbrev Number: 1 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x2eb67): buffer
    <be6>   DW_AT_decl_file   : 11
    <be7>   DW_AT_decl_line   : 287
    <be9>   DW_AT_decl_column : 27
    <bea>   DW_AT_type        : <0xbfe>
    <bee>   DW_AT_data_member_location: 20
 <2><bef>: Abbrev Number: 1 (DW_TAG_member)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x824e6): controlblock
    <bf4>   DW_AT_decl_file   : 11
    <bf5>   DW_AT_decl_line   : 288
    <bf7>   DW_AT_decl_column : 27
    <bf8>   DW_AT_type        : <0xc03>
    <bfc>   DW_AT_data_member_location: 24
 <2><bfd>: Abbrev Number: 0
 <1><bfe>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <bff>   DW_AT_byte_size   : 4
    <bff>   DW_AT_type        : <0x29c>
 <1><c03>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <c04>   DW_AT_byte_size   : 4
    <c04>   DW_AT_type        : <0xb80>
 <1><c08>: Abbrev Number: 12 (DW_TAG_typedef)
    <c09>   DW_AT_name        : (indirect string, offset: 0xe5ab): osThreadDef_t
    <c0d>   DW_AT_decl_file   : 11
    <c0e>   DW_AT_decl_line   : 290
    <c10>   DW_AT_decl_column : 3
    <c11>   DW_AT_type        : <0xb8d>
 <1><c15>: Abbrev Number: 23 (DW_TAG_const_type)
    <c16>   DW_AT_type        : <0xc08>
 <1><c1a>: Abbrev Number: 21 (DW_TAG_variable)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x3b80e): defaultTaskHandle
    <c1f>   DW_AT_decl_file   : 1
    <c1f>   DW_AT_decl_line   : 50
    <c20>   DW_AT_decl_column : 12
    <c20>   DW_AT_type        : <0xb74>
    <c24>   DW_AT_external    : 1
    <c24>   DW_AT_location    : 5 byte block: 3 b0 0 0 20 	(DW_OP_addr: 200000b0)
 <1><c2a>: Abbrev Number: 21 (DW_TAG_variable)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x63f29): batterygau_taskHandle
    <c2f>   DW_AT_decl_file   : 1
    <c2f>   DW_AT_decl_line   : 51
    <c30>   DW_AT_decl_column : 12
    <c30>   DW_AT_type        : <0xb74>
    <c34>   DW_AT_external    : 1
    <c34>   DW_AT_location    : 5 byte block: 3 b4 0 0 20 	(DW_OP_addr: 200000b4)
 <1><c3a>: Abbrev Number: 21 (DW_TAG_variable)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x27b34): LCD_taskHandle
    <c3f>   DW_AT_decl_file   : 1
    <c3f>   DW_AT_decl_line   : 52
    <c40>   DW_AT_decl_column : 12
    <c40>   DW_AT_type        : <0xb74>
    <c44>   DW_AT_external    : 1
    <c44>   DW_AT_location    : 5 byte block: 3 b8 0 0 20 	(DW_OP_addr: 200000b8)
 <1><c4a>: Abbrev Number: 14 (DW_TAG_variable)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x4e77a): xIdleTaskTCBBuffer
    <c4f>   DW_AT_decl_file   : 1
    <c4f>   DW_AT_decl_line   : 70
    <c50>   DW_AT_decl_column : 21
    <c51>   DW_AT_type        : <0xa6b>
    <c55>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><c5b>: Abbrev Number: 8 (DW_TAG_array_type)
    <c5c>   DW_AT_type        : <0x2aa>
    <c60>   DW_AT_sibling     : <0xc6b>
 <2><c64>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c65>   DW_AT_type        : <0x21a>
    <c69>   DW_AT_upper_bound : 127
 <2><c6a>: Abbrev Number: 0
 <1><c6b>: Abbrev Number: 14 (DW_TAG_variable)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x38535): xIdleStack
    <c70>   DW_AT_decl_file   : 1
    <c70>   DW_AT_decl_line   : 71
    <c71>   DW_AT_decl_column : 20
    <c72>   DW_AT_type        : <0xc5b>
    <c76>   DW_AT_location    : 5 byte block: 3 5c 1 0 20 	(DW_OP_addr: 2000015c)
 <1><c7c>: Abbrev Number: 25 (DW_TAG_subprogram)
    <c7d>   DW_AT_external    : 1
    <c7d>   DW_AT_name        : (indirect string, offset: 0x6bc74): osDelay
    <c81>   DW_AT_decl_file   : 11
    <c81>   DW_AT_decl_line   : 478
    <c83>   DW_AT_decl_column : 10
    <c84>   DW_AT_prototyped  : 1
    <c84>   DW_AT_type        : <0xb46>
    <c88>   DW_AT_declaration : 1
    <c88>   DW_AT_sibling     : <0xc92>
 <2><c8c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c8d>   DW_AT_type        : <0x29c>
 <2><c91>: Abbrev Number: 0
 <1><c92>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c93>   DW_AT_external    : 1
    <c93>   DW_AT_name        : (indirect string, offset: 0xeb7b): MX_USB_HOST_Init
    <c97>   DW_AT_decl_file   : 1
    <c98>   DW_AT_decl_line   : 63
    <c99>   DW_AT_decl_column : 13
    <c9a>   DW_AT_prototyped  : 1
    <c9a>   DW_AT_declaration : 1
 <1><c9a>: Abbrev Number: 25 (DW_TAG_subprogram)
    <c9b>   DW_AT_external    : 1
    <c9b>   DW_AT_name        : (indirect string, offset: 0x38def): osThreadCreate
    <c9f>   DW_AT_decl_file   : 11
    <c9f>   DW_AT_decl_line   : 441
    <ca1>   DW_AT_decl_column : 12
    <ca2>   DW_AT_prototyped  : 1
    <ca2>   DW_AT_type        : <0xb74>
    <ca6>   DW_AT_declaration : 1
    <ca6>   DW_AT_sibling     : <0xcb5>
 <2><caa>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <cab>   DW_AT_type        : <0xcb5>
 <2><caf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <cb0>   DW_AT_type        : <0x2a8>
 <2><cb4>: Abbrev Number: 0
 <1><cb5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <cb6>   DW_AT_byte_size   : 4
    <cb6>   DW_AT_type        : <0xc15>
 <1><cba>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cbb>   DW_AT_external    : 1
    <cbb>   DW_AT_name        : (indirect string, offset: 0x5bc7c): StartLCD_task
    <cbf>   DW_AT_decl_file   : 1
    <cbf>   DW_AT_decl_line   : 172
    <cc0>   DW_AT_decl_column : 6
    <cc0>   DW_AT_prototyped  : 1
    <cc0>   DW_AT_low_pc      : 0x80005f8
    <cc4>   DW_AT_high_pc     : 0x10
    <cc8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cca>   DW_AT_call_all_tail_calls: 1
    <cca>   DW_AT_sibling     : <0xcdd>
 <2><cce>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x21eb9): argument
    <cd3>   DW_AT_decl_file   : 1
    <cd3>   DW_AT_decl_line   : 172
    <cd4>   DW_AT_decl_column : 33
    <cd5>   DW_AT_type        : <0xb6e>
    <cd9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cdc>: Abbrev Number: 0
 <1><cdd>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cde>   DW_AT_external    : 1
    <cde>   DW_AT_name        : (indirect string, offset: 0x369ae): StartGaulge_task
    <ce2>   DW_AT_decl_file   : 1
    <ce2>   DW_AT_decl_line   : 154
    <ce3>   DW_AT_decl_column : 6
    <ce3>   DW_AT_prototyped  : 1
    <ce3>   DW_AT_low_pc      : 0x80005e8
    <ce7>   DW_AT_high_pc     : 0x10
    <ceb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ced>   DW_AT_call_all_tail_calls: 1
    <ced>   DW_AT_sibling     : <0xd00>
 <2><cf1>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x21eb9): argument
    <cf6>   DW_AT_decl_file   : 1
    <cf6>   DW_AT_decl_line   : 154
    <cf7>   DW_AT_decl_column : 36
    <cf8>   DW_AT_type        : <0xb6e>
    <cfc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cff>: Abbrev Number: 0
 <1><d00>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d01>   DW_AT_external    : 1
    <d01>   DW_AT_name        : (indirect string, offset: 0x230b2): StartDefaultTask
    <d05>   DW_AT_decl_file   : 1
    <d05>   DW_AT_decl_line   : 134
    <d06>   DW_AT_decl_column : 6
    <d06>   DW_AT_prototyped  : 1
    <d06>   DW_AT_low_pc      : 0x80005d4
    <d0a>   DW_AT_high_pc     : 0x14
    <d0e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d10>   DW_AT_call_all_tail_calls: 1
    <d10>   DW_AT_sibling     : <0xd23>
 <2><d14>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <d15>   DW_AT_name        : (indirect string, offset: 0x21eb9): argument
    <d19>   DW_AT_decl_file   : 1
    <d19>   DW_AT_decl_line   : 134
    <d1a>   DW_AT_decl_column : 36
    <d1b>   DW_AT_type        : <0xb6e>
    <d1f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d22>: Abbrev Number: 0
 <1><d23>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d24>   DW_AT_external    : 1
    <d24>   DW_AT_name        : (indirect string, offset: 0x2496b): MX_FREERTOS_Init
    <d28>   DW_AT_decl_file   : 1
    <d28>   DW_AT_decl_line   : 87
    <d29>   DW_AT_decl_column : 6
    <d29>   DW_AT_prototyped  : 1
    <d29>   DW_AT_low_pc      : 0x8000540
    <d2d>   DW_AT_high_pc     : 0x94
    <d31>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d33>   DW_AT_call_all_tail_calls: 1
    <d33>   DW_AT_sibling     : <0xd64>
 <2><d37>: Abbrev Number: 14 (DW_TAG_variable)
    <d38>   DW_AT_name        : (indirect string, offset: 0x6e992): os_thread_def_defaultTask
    <d3c>   DW_AT_decl_file   : 1
    <d3c>   DW_AT_decl_line   : 110
    <d3d>   DW_AT_decl_column : 3
    <d3e>   DW_AT_type        : <0xc15>
    <d42>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><d45>: Abbrev Number: 14 (DW_TAG_variable)
    <d46>   DW_AT_name        : (indirect string, offset: 0x530c1): os_thread_def_batterygau_task
    <d4a>   DW_AT_decl_file   : 1
    <d4a>   DW_AT_decl_line   : 114
    <d4b>   DW_AT_decl_column : 3
    <d4c>   DW_AT_type        : <0xc15>
    <d50>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><d54>: Abbrev Number: 14 (DW_TAG_variable)
    <d55>   DW_AT_name        : (indirect string, offset: 0x7faa3): os_thread_def_LCD_task
    <d59>   DW_AT_decl_file   : 1
    <d59>   DW_AT_decl_line   : 118
    <d5a>   DW_AT_decl_column : 3
    <d5b>   DW_AT_type        : <0xc15>
    <d5f>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><d63>: Abbrev Number: 0
 <1><d64>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d65>   DW_AT_external    : 1
    <d65>   DW_AT_name        : (indirect string, offset: 0x12484): vApplicationGetIdleTaskMemory
    <d69>   DW_AT_decl_file   : 1
    <d6a>   DW_AT_decl_line   : 73
    <d6b>   DW_AT_decl_column : 6
    <d6c>   DW_AT_prototyped  : 1
    <d6c>   DW_AT_low_pc      : 0x800050c
    <d70>   DW_AT_high_pc     : 0x34
    <d74>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d76>   DW_AT_call_all_calls: 1
    <d76>   DW_AT_sibling     : <0xda5>
 <2><d7a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x4e778): ppxIdleTaskTCBBuffer
    <d7f>   DW_AT_decl_file   : 1
    <d7f>   DW_AT_decl_line   : 73
    <d80>   DW_AT_decl_column : 52
    <d81>   DW_AT_type        : <0xda5>
    <d85>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d88>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <d89>   DW_AT_name        : (indirect string, offset: 0x5609f): ppxIdleTaskStackBuffer
    <d8d>   DW_AT_decl_file   : 1
    <d8d>   DW_AT_decl_line   : 73
    <d8e>   DW_AT_decl_column : 88
    <d8f>   DW_AT_type        : <0xdaf>
    <d93>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d96>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <d97>   DW_AT_name        : (indirect string, offset: 0x5b207): pulIdleTaskStackSize
    <d9b>   DW_AT_decl_file   : 1
    <d9b>   DW_AT_decl_line   : 73
    <d9c>   DW_AT_decl_column : 122
    <d9d>   DW_AT_type        : <0xbfe>
    <da1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><da4>: Abbrev Number: 0
 <1><da5>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <da6>   DW_AT_byte_size   : 4
    <da6>   DW_AT_type        : <0xdaa>
 <1><daa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <dab>   DW_AT_byte_size   : 4
    <dab>   DW_AT_type        : <0xa6b>
 <1><daf>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <db0>   DW_AT_byte_size   : 4
    <db0>   DW_AT_type        : <0xa8e>
 <1><db4>: Abbrev Number: 0
  Compilation Unit @ offset 0xdb5:
   Length:        0x47f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2d3
   Pointer Size:  4
 <0><dc1>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <dc2>   DW_AT_producer    : (indirect string, offset: 0x2d03): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <dc6>   DW_AT_language    : 29	(C11)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x92f2e): ../Core/Src/gpio.c
    <dcb>   DW_AT_comp_dir    : (indirect string, offset: 0xbb3): D:/Master/TFG/Debug
    <dcf>   DW_AT_ranges      : 0x38
    <dd3>   DW_AT_low_pc      : 0
    <dd7>   DW_AT_stmt_list   : 0xeec
    <ddb>   DW_AT_macros      : 0x160bb
 <1><ddf>: Abbrev Number: 2 (DW_TAG_base_type)
    <de0>   DW_AT_byte_size   : 1
    <de1>   DW_AT_encoding    : 6	(signed char)
    <de2>   DW_AT_name        : (indirect string, offset: 0x2a38): signed char
 <1><de6>: Abbrev Number: 3 (DW_TAG_typedef)
    <de7>   DW_AT_name        : (indirect string, offset: 0x2cf9): __uint8_t
    <deb>   DW_AT_decl_file   : 2
    <dec>   DW_AT_decl_line   : 43
    <ded>   DW_AT_decl_column : 24
    <dee>   DW_AT_type        : <0xdf2>
 <1><df2>: Abbrev Number: 2 (DW_TAG_base_type)
    <df3>   DW_AT_byte_size   : 1
    <df4>   DW_AT_encoding    : 8	(unsigned char)
    <df5>   DW_AT_name        : (indirect string, offset: 0x2c76): unsigned char
 <1><df9>: Abbrev Number: 2 (DW_TAG_base_type)
    <dfa>   DW_AT_byte_size   : 2
    <dfb>   DW_AT_encoding    : 5	(signed)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x79c): short int
 <1><e00>: Abbrev Number: 3 (DW_TAG_typedef)
    <e01>   DW_AT_name        : (indirect string, offset: 0x1163): __uint16_t
    <e05>   DW_AT_decl_file   : 2
    <e06>   DW_AT_decl_line   : 57
    <e07>   DW_AT_decl_column : 25
    <e08>   DW_AT_type        : <0xe0c>
 <1><e0c>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0d>   DW_AT_byte_size   : 2
    <e0e>   DW_AT_encoding    : 7	(unsigned)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x5da): short unsigned int
 <1><e13>: Abbrev Number: 2 (DW_TAG_base_type)
    <e14>   DW_AT_byte_size   : 4
    <e15>   DW_AT_encoding    : 5	(signed)
    <e16>   DW_AT_name        : (indirect string, offset: 0x28cb): long int
 <1><e1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x5df2f): __uint32_t
    <e1f>   DW_AT_decl_file   : 2
    <e20>   DW_AT_decl_line   : 79
    <e21>   DW_AT_decl_column : 25
    <e22>   DW_AT_type        : <0xe26>
 <1><e26>: Abbrev Number: 2 (DW_TAG_base_type)
    <e27>   DW_AT_byte_size   : 4
    <e28>   DW_AT_encoding    : 7	(unsigned)
    <e29>   DW_AT_name        : (indirect string, offset: 0x25c8): long unsigned int
 <1><e2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <e2e>   DW_AT_byte_size   : 8
    <e2f>   DW_AT_encoding    : 5	(signed)
    <e30>   DW_AT_name        : (indirect string, offset: 0x231e): long long int
 <1><e34>: Abbrev Number: 2 (DW_TAG_base_type)
    <e35>   DW_AT_byte_size   : 8
    <e36>   DW_AT_encoding    : 7	(unsigned)
    <e37>   DW_AT_name        : (indirect string, offset: 0x372e): long long unsigned int
 <1><e3b>: Abbrev Number: 18 (DW_TAG_base_type)
    <e3c>   DW_AT_byte_size   : 4
    <e3d>   DW_AT_encoding    : 5	(signed)
    <e3e>   DW_AT_name        : int
 <1><e42>: Abbrev Number: 2 (DW_TAG_base_type)
    <e43>   DW_AT_byte_size   : 4
    <e44>   DW_AT_encoding    : 7	(unsigned)
    <e45>   DW_AT_name        : (indirect string, offset: 0x33f3): unsigned int
 <1><e49>: Abbrev Number: 3 (DW_TAG_typedef)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x2cfb): uint8_t
    <e4e>   DW_AT_decl_file   : 3
    <e4f>   DW_AT_decl_line   : 24
    <e50>   DW_AT_decl_column : 19
    <e51>   DW_AT_type        : <0xde6>
 <1><e55>: Abbrev Number: 3 (DW_TAG_typedef)
    <e56>   DW_AT_name        : (indirect string, offset: 0x6b268): uint16_t
    <e5a>   DW_AT_decl_file   : 3
    <e5b>   DW_AT_decl_line   : 36
    <e5c>   DW_AT_decl_column : 20
    <e5d>   DW_AT_type        : <0xe00>
 <1><e61>: Abbrev Number: 3 (DW_TAG_typedef)
    <e62>   DW_AT_name        : (indirect string, offset: 0x6ab23): uint32_t
    <e66>   DW_AT_decl_file   : 3
    <e67>   DW_AT_decl_line   : 48
    <e68>   DW_AT_decl_column : 20
    <e69>   DW_AT_type        : <0xe1a>
 <1><e6d>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <e6e>   DW_AT_type        : <0xe61>
 <1><e72>: Abbrev Number: 9 (DW_TAG_array_type)
    <e73>   DW_AT_type        : <0xe61>
    <e77>   DW_AT_sibling     : <0xe82>
 <2><e7b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e7c>   DW_AT_type        : <0xe42>
    <e80>   DW_AT_upper_bound : 0
 <2><e81>: Abbrev Number: 0
 <1><e82>: Abbrev Number: 9 (DW_TAG_array_type)
    <e83>   DW_AT_type        : <0xe61>
    <e87>   DW_AT_sibling     : <0xe92>
 <2><e8b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e8c>   DW_AT_type        : <0xe42>
    <e90>   DW_AT_upper_bound : 1
 <2><e91>: Abbrev Number: 0
 <1><e92>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e93>   DW_AT_byte_size   : 40
    <e94>   DW_AT_decl_file   : 4
    <e94>   DW_AT_decl_line   : 265
    <e96>   DW_AT_decl_column : 9
    <e96>   DW_AT_sibling     : <0xf07>
 <2><e9a>: Abbrev Number: 1 (DW_TAG_member)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x93085): MODER
    <e9f>   DW_AT_decl_file   : 4
    <e9f>   DW_AT_decl_line   : 267
    <ea1>   DW_AT_decl_column : 17
    <ea1>   DW_AT_type        : <0xe6d>
    <ea5>   DW_AT_data_member_location: 0
 <2><ea6>: Abbrev Number: 1 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x92ffb): OTYPER
    <eab>   DW_AT_decl_file   : 4
    <eab>   DW_AT_decl_line   : 268
    <ead>   DW_AT_decl_column : 17
    <ead>   DW_AT_type        : <0xe6d>
    <eb1>   DW_AT_data_member_location: 4
 <2><eb2>: Abbrev Number: 1 (DW_TAG_member)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x92fee): OSPEEDR
    <eb7>   DW_AT_decl_file   : 4
    <eb7>   DW_AT_decl_line   : 269
    <eb9>   DW_AT_decl_column : 17
    <eb9>   DW_AT_type        : <0xe6d>
    <ebd>   DW_AT_data_member_location: 8
 <2><ebe>: Abbrev Number: 1 (DW_TAG_member)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x93103): PUPDR
    <ec3>   DW_AT_decl_file   : 4
    <ec3>   DW_AT_decl_line   : 270
    <ec5>   DW_AT_decl_column : 17
    <ec5>   DW_AT_type        : <0xe6d>
    <ec9>   DW_AT_data_member_location: 12
 <2><eca>: Abbrev Number: 5 (DW_TAG_member)
    <ecb>   DW_AT_name        : IDR
    <ecf>   DW_AT_decl_file   : 4
    <ecf>   DW_AT_decl_line   : 271
    <ed1>   DW_AT_decl_column : 17
    <ed1>   DW_AT_type        : <0xe6d>
    <ed5>   DW_AT_data_member_location: 16
 <2><ed6>: Abbrev Number: 5 (DW_TAG_member)
    <ed7>   DW_AT_name        : ODR
    <edb>   DW_AT_decl_file   : 4
    <edb>   DW_AT_decl_line   : 272
    <edd>   DW_AT_decl_column : 17
    <edd>   DW_AT_type        : <0xe6d>
    <ee1>   DW_AT_data_member_location: 20
 <2><ee2>: Abbrev Number: 1 (DW_TAG_member)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x93071): BSRR
    <ee7>   DW_AT_decl_file   : 4
    <ee7>   DW_AT_decl_line   : 273
    <ee9>   DW_AT_decl_column : 17
    <ee9>   DW_AT_type        : <0xe6d>
    <eed>   DW_AT_data_member_location: 24
 <2><eee>: Abbrev Number: 1 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0x92fba): LCKR
    <ef3>   DW_AT_decl_file   : 4
    <ef3>   DW_AT_decl_line   : 274
    <ef5>   DW_AT_decl_column : 17
    <ef5>   DW_AT_type        : <0xe6d>
    <ef9>   DW_AT_data_member_location: 28
 <2><efa>: Abbrev Number: 5 (DW_TAG_member)
    <efb>   DW_AT_name        : AFR
    <eff>   DW_AT_decl_file   : 4
    <eff>   DW_AT_decl_line   : 275
    <f01>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0xf17>
    <f05>   DW_AT_data_member_location: 32
 <2><f06>: Abbrev Number: 0
 <1><f07>: Abbrev Number: 9 (DW_TAG_array_type)
    <f08>   DW_AT_type        : <0xe6d>
    <f0c>   DW_AT_sibling     : <0xf17>
 <2><f10>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f11>   DW_AT_type        : <0xe42>
    <f15>   DW_AT_upper_bound : 1
 <2><f16>: Abbrev Number: 0
 <1><f17>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <f18>   DW_AT_type        : <0xf07>
 <1><f1c>: Abbrev Number: 13 (DW_TAG_typedef)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x930bf): GPIO_TypeDef
    <f21>   DW_AT_decl_file   : 4
    <f21>   DW_AT_decl_line   : 276
    <f23>   DW_AT_decl_column : 3
    <f23>   DW_AT_type        : <0xe92>
 <1><f27>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f28>   DW_AT_byte_size   : 144
    <f29>   DW_AT_decl_file   : 4
    <f29>   DW_AT_decl_line   : 336
    <f2b>   DW_AT_decl_column : 9
    <f2b>   DW_AT_sibling     : <0x10af>
 <2><f2f>: Abbrev Number: 5 (DW_TAG_member)
    <f30>   DW_AT_name        : CR
    <f33>   DW_AT_decl_file   : 4
    <f33>   DW_AT_decl_line   : 338
    <f35>   DW_AT_decl_column : 17
    <f35>   DW_AT_type        : <0xe6d>
    <f39>   DW_AT_data_member_location: 0
 <2><f3a>: Abbrev Number: 1 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x93002): PLLCFGR
    <f3f>   DW_AT_decl_file   : 4
    <f3f>   DW_AT_decl_line   : 339
    <f41>   DW_AT_decl_column : 17
    <f41>   DW_AT_type        : <0xe6d>
    <f45>   DW_AT_data_member_location: 4
 <2><f46>: Abbrev Number: 1 (DW_TAG_member)
    <f47>   DW_AT_name        : (indirect string, offset: 0x9308e): CFGR
    <f4b>   DW_AT_decl_file   : 4
    <f4b>   DW_AT_decl_line   : 340
    <f4d>   DW_AT_decl_column : 17
    <f4d>   DW_AT_type        : <0xe6d>
    <f51>   DW_AT_data_member_location: 8
 <2><f52>: Abbrev Number: 5 (DW_TAG_member)
    <f53>   DW_AT_name        : CIR
    <f57>   DW_AT_decl_file   : 4
    <f57>   DW_AT_decl_line   : 341
    <f59>   DW_AT_decl_column : 17
    <f59>   DW_AT_type        : <0xe6d>
    <f5d>   DW_AT_data_member_location: 12
 <2><f5e>: Abbrev Number: 1 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x9305e): AHB1RSTR
    <f63>   DW_AT_decl_file   : 4
    <f63>   DW_AT_decl_line   : 342
    <f65>   DW_AT_decl_column : 17
    <f65>   DW_AT_type        : <0xe6d>
    <f69>   DW_AT_data_member_location: 16
 <2><f6a>: Abbrev Number: 1 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x930b6): AHB2RSTR
    <f6f>   DW_AT_decl_file   : 4
    <f6f>   DW_AT_decl_line   : 343
    <f71>   DW_AT_decl_column : 17
    <f71>   DW_AT_type        : <0xe6d>
    <f75>   DW_AT_data_member_location: 20
 <2><f76>: Abbrev Number: 1 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x930f0): AHB3RSTR
    <f7b>   DW_AT_decl_file   : 4
    <f7b>   DW_AT_decl_line   : 344
    <f7d>   DW_AT_decl_column : 17
    <f7d>   DW_AT_type        : <0xe6d>
    <f81>   DW_AT_data_member_location: 24
 <2><f82>: Abbrev Number: 1 (DW_TAG_member)
    <f83>   DW_AT_name        : (indirect string, offset: 0x92f75): RESERVED0
    <f87>   DW_AT_decl_file   : 4
    <f87>   DW_AT_decl_line   : 345
    <f89>   DW_AT_decl_column : 17
    <f89>   DW_AT_type        : <0xe61>
    <f8d>   DW_AT_data_member_location: 28
 <2><f8e>: Abbrev Number: 1 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x92f9b): APB1RSTR
    <f93>   DW_AT_decl_file   : 4
    <f93>   DW_AT_decl_line   : 346
    <f95>   DW_AT_decl_column : 17
    <f95>   DW_AT_type        : <0xe6d>
    <f99>   DW_AT_data_member_location: 32
 <2><f9a>: Abbrev Number: 1 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x92f61): APB2RSTR
    <f9f>   DW_AT_decl_file   : 4
    <f9f>   DW_AT_decl_line   : 347
    <fa1>   DW_AT_decl_column : 17
    <fa1>   DW_AT_type        : <0xe6d>
    <fa5>   DW_AT_data_member_location: 36
 <2><fa6>: Abbrev Number: 1 (DW_TAG_member)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x92f7f): RESERVED1
    <fab>   DW_AT_decl_file   : 4
    <fab>   DW_AT_decl_line   : 348
    <fad>   DW_AT_decl_column : 17
    <fad>   DW_AT_type        : <0xe82>
    <fb1>   DW_AT_data_member_location: 40
 <2><fb2>: Abbrev Number: 1 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x930a7): AHB1ENR
    <fb7>   DW_AT_decl_file   : 4
    <fb7>   DW_AT_decl_line   : 349
    <fb9>   DW_AT_decl_column : 17
    <fb9>   DW_AT_type        : <0xe6d>
    <fbd>   DW_AT_data_member_location: 48
 <2><fbe>: Abbrev Number: 1 (DW_TAG_member)
    <fbf>   DW_AT_name        : (indirect string, offset: 0x92f93): AHB2ENR
    <fc3>   DW_AT_decl_file   : 4
    <fc3>   DW_AT_decl_line   : 350
    <fc5>   DW_AT_decl_column : 17
    <fc5>   DW_AT_type        : <0xe6d>
    <fc9>   DW_AT_data_member_location: 52
 <2><fca>: Abbrev Number: 1 (DW_TAG_member)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x92f26): AHB3ENR
    <fcf>   DW_AT_decl_file   : 4
    <fcf>   DW_AT_decl_line   : 351
    <fd1>   DW_AT_decl_column : 17
    <fd1>   DW_AT_type        : <0xe6d>
    <fd5>   DW_AT_data_member_location: 56
 <2><fd6>: Abbrev Number: 1 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x92f89): RESERVED2
    <fdb>   DW_AT_decl_file   : 4
    <fdb>   DW_AT_decl_line   : 352
    <fdd>   DW_AT_decl_column : 17
    <fdd>   DW_AT_type        : <0xe61>
    <fe1>   DW_AT_data_member_location: 60
 <2><fe2>: Abbrev Number: 1 (DW_TAG_member)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x92fd6): APB1ENR
    <fe7>   DW_AT_decl_file   : 4
    <fe7>   DW_AT_decl_line   : 353
    <fe9>   DW_AT_decl_column : 17
    <fe9>   DW_AT_type        : <0xe6d>
    <fed>   DW_AT_data_member_location: 64
 <2><fee>: Abbrev Number: 1 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0x93056): APB2ENR
    <ff3>   DW_AT_decl_file   : 4
    <ff3>   DW_AT_decl_line   : 354
    <ff5>   DW_AT_decl_column : 17
    <ff5>   DW_AT_type        : <0xe6d>
    <ff9>   DW_AT_data_member_location: 68
 <2><ffa>: Abbrev Number: 1 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x9302e): RESERVED3
    <fff>   DW_AT_decl_file   : 4
    <fff>   DW_AT_decl_line   : 355
    <1001>   DW_AT_decl_column : 17
    <1001>   DW_AT_type        : <0xe82>
    <1005>   DW_AT_data_member_location: 72
 <2><1006>: Abbrev Number: 1 (DW_TAG_member)
    <1007>   DW_AT_name        : (indirect string, offset: 0x92fcc): AHB1LPENR
    <100b>   DW_AT_decl_file   : 4
    <100b>   DW_AT_decl_line   : 356
    <100d>   DW_AT_decl_column : 17
    <100d>   DW_AT_type        : <0xe6d>
    <1011>   DW_AT_data_member_location: 80
 <2><1012>: Abbrev Number: 1 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0x93067): AHB2LPENR
    <1017>   DW_AT_decl_file   : 4
    <1017>   DW_AT_decl_line   : 357
    <1019>   DW_AT_decl_column : 17
    <1019>   DW_AT_type        : <0xe6d>
    <101d>   DW_AT_data_member_location: 84
 <2><101e>: Abbrev Number: 1 (DW_TAG_member)
    <101f>   DW_AT_name        : (indirect string, offset: 0x93093): AHB3LPENR
    <1023>   DW_AT_decl_file   : 4
    <1023>   DW_AT_decl_line   : 358
    <1025>   DW_AT_decl_column : 17
    <1025>   DW_AT_type        : <0xe6d>
    <1029>   DW_AT_data_member_location: 88
 <2><102a>: Abbrev Number: 1 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0x93038): RESERVED4
    <102f>   DW_AT_decl_file   : 4
    <102f>   DW_AT_decl_line   : 359
    <1031>   DW_AT_decl_column : 17
    <1031>   DW_AT_type        : <0xe61>
    <1035>   DW_AT_data_member_location: 92
 <2><1036>: Abbrev Number: 1 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0x9309d): APB1LPENR
    <103b>   DW_AT_decl_file   : 4
    <103b>   DW_AT_decl_line   : 360
    <103d>   DW_AT_decl_column : 17
    <103d>   DW_AT_type        : <0xe6d>
    <1041>   DW_AT_data_member_location: 96
 <2><1042>: Abbrev Number: 1 (DW_TAG_member)
    <1043>   DW_AT_name        : (indirect string, offset: 0x930f9): APB2LPENR
    <1047>   DW_AT_decl_file   : 4
    <1047>   DW_AT_decl_line   : 361
    <1049>   DW_AT_decl_column : 17
    <1049>   DW_AT_type        : <0xe6d>
    <104d>   DW_AT_data_member_location: 100
 <2><104e>: Abbrev Number: 1 (DW_TAG_member)
    <104f>   DW_AT_name        : (indirect string, offset: 0x93042): RESERVED5
    <1053>   DW_AT_decl_file   : 4
    <1053>   DW_AT_decl_line   : 362
    <1055>   DW_AT_decl_column : 17
    <1055>   DW_AT_type        : <0xe82>
    <1059>   DW_AT_data_member_location: 104
 <2><105a>: Abbrev Number: 1 (DW_TAG_member)
    <105b>   DW_AT_name        : (indirect string, offset: 0x93109): BDCR
    <105f>   DW_AT_decl_file   : 4
    <105f>   DW_AT_decl_line   : 363
    <1061>   DW_AT_decl_column : 17
    <1061>   DW_AT_type        : <0xe6d>
    <1065>   DW_AT_data_member_location: 112
 <2><1066>: Abbrev Number: 5 (DW_TAG_member)
    <1067>   DW_AT_name        : CSR
    <106b>   DW_AT_decl_file   : 4
    <106b>   DW_AT_decl_line   : 364
    <106d>   DW_AT_decl_column : 17
    <106d>   DW_AT_type        : <0xe6d>
    <1071>   DW_AT_data_member_location: 116
 <2><1072>: Abbrev Number: 1 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0x93024): RESERVED6
    <1077>   DW_AT_decl_file   : 4
    <1077>   DW_AT_decl_line   : 365
    <1079>   DW_AT_decl_column : 17
    <1079>   DW_AT_type        : <0xe82>
    <107d>   DW_AT_data_member_location: 120
 <2><107e>: Abbrev Number: 1 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0x930cc): SSCGR
    <1083>   DW_AT_decl_file   : 4
    <1083>   DW_AT_decl_line   : 366
    <1085>   DW_AT_decl_column : 17
    <1085>   DW_AT_type        : <0xe6d>
    <1089>   DW_AT_data_member_location: 128
 <2><108a>: Abbrev Number: 1 (DW_TAG_member)
    <108b>   DW_AT_name        : (indirect string, offset: 0x92f6a): PLLI2SCFGR
    <108f>   DW_AT_decl_file   : 4
    <108f>   DW_AT_decl_line   : 367
    <1091>   DW_AT_decl_column : 17
    <1091>   DW_AT_type        : <0xe6d>
    <1095>   DW_AT_data_member_location: 132
 <2><1096>: Abbrev Number: 1 (DW_TAG_member)
    <1097>   DW_AT_name        : (indirect string, offset: 0x9304c): RESERVED7
    <109b>   DW_AT_decl_file   : 4
    <109b>   DW_AT_decl_line   : 368
    <109d>   DW_AT_decl_column : 17
    <109d>   DW_AT_type        : <0xe72>
    <10a1>   DW_AT_data_member_location: 136
 <2><10a2>: Abbrev Number: 1 (DW_TAG_member)
    <10a3>   DW_AT_name        : (indirect string, offset: 0x9308b): DCKCFGR
    <10a7>   DW_AT_decl_file   : 4
    <10a7>   DW_AT_decl_line   : 369
    <10a9>   DW_AT_decl_column : 17
    <10a9>   DW_AT_type        : <0xe6d>
    <10ad>   DW_AT_data_member_location: 140
 <2><10ae>: Abbrev Number: 0
 <1><10af>: Abbrev Number: 13 (DW_TAG_typedef)
    <10b0>   DW_AT_name        : (indirect string, offset: 0x92fa4): RCC_TypeDef
    <10b4>   DW_AT_decl_file   : 4
    <10b4>   DW_AT_decl_line   : 370
    <10b6>   DW_AT_decl_column : 3
    <10b6>   DW_AT_type        : <0xf27>
