Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1e5 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2d34): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x11ea): ../Core/Src/fonts.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x29db): C:/Users/kille/Desktop/Master_provisional/STM32_project/Debug
    <1a>   DW_AT_stmt_list   : 0
    <1e>   DW_AT_macros      : 0
 <1><22>: Abbrev Number: 1 (DW_TAG_base_type)
    <23>   DW_AT_byte_size   : 1
    <24>   DW_AT_encoding    : 6	(signed char)
    <25>   DW_AT_name        : (indirect string, offset: 0x2a94): signed char
 <1><29>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indirect string, offset: 0x2d2a): __uint8_t
    <2e>   DW_AT_decl_file   : 2
    <2f>   DW_AT_decl_line   : 43
    <30>   DW_AT_decl_column : 24
    <31>   DW_AT_type        : <0x35>
 <1><35>: Abbrev Number: 1 (DW_TAG_base_type)
    <36>   DW_AT_byte_size   : 1
    <37>   DW_AT_encoding    : 8	(unsigned char)
    <38>   DW_AT_name        : (indirect string, offset: 0x2ca7): unsigned char
 <1><3c>: Abbrev Number: 1 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 2
    <3e>   DW_AT_encoding    : 5	(signed)
    <3f>   DW_AT_name        : (indirect string, offset: 0x7b8): short int
 <1><43>: Abbrev Number: 3 (DW_TAG_typedef)
    <44>   DW_AT_name        : (indirect string, offset: 0x1189): __uint16_t
    <48>   DW_AT_decl_file   : 2
    <49>   DW_AT_decl_line   : 57
    <4a>   DW_AT_decl_column : 25
    <4b>   DW_AT_type        : <0x4f>
 <1><4f>: Abbrev Number: 1 (DW_TAG_base_type)
    <50>   DW_AT_byte_size   : 2
    <51>   DW_AT_encoding    : 7	(unsigned)
    <52>   DW_AT_name        : (indirect string, offset: 0x5f6): short unsigned int
 <1><56>: Abbrev Number: 1 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 4
    <58>   DW_AT_encoding    : 5	(signed)
    <59>   DW_AT_name        : (indirect string, offset: 0x28e9): long int
 <1><5d>: Abbrev Number: 1 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 7	(unsigned)
    <60>   DW_AT_name        : (indirect string, offset: 0x25e6): long unsigned int
 <1><64>: Abbrev Number: 1 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 8
    <66>   DW_AT_encoding    : 5	(signed)
    <67>   DW_AT_name        : (indirect string, offset: 0x233c): long long int
 <1><6b>: Abbrev Number: 1 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 7	(unsigned)
    <6e>   DW_AT_name        : (indirect string, offset: 0x3761): long long unsigned int
 <1><72>: Abbrev Number: 12 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 4
    <74>   DW_AT_encoding    : 5	(signed)
    <75>   DW_AT_name        : int
 <1><79>: Abbrev Number: 1 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 7	(unsigned)
    <7c>   DW_AT_name        : (indirect string, offset: 0x3426): unsigned int
 <1><80>: Abbrev Number: 3 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x2d2c): uint8_t
    <85>   DW_AT_decl_file   : 3
    <86>   DW_AT_decl_line   : 24
    <87>   DW_AT_decl_column : 19
    <88>   DW_AT_type        : <0x29>
 <1><8c>: Abbrev Number: 2 (DW_TAG_const_type)
    <8d>   DW_AT_type        : <0x80>
 <1><91>: Abbrev Number: 3 (DW_TAG_typedef)
    <92>   DW_AT_name        : (indirect string, offset: 0x6bc68): uint16_t
    <96>   DW_AT_decl_file   : 3
    <97>   DW_AT_decl_line   : 36
    <98>   DW_AT_decl_column : 20
    <99>   DW_AT_type        : <0x43>
 <1><9d>: Abbrev Number: 2 (DW_TAG_const_type)
    <9e>   DW_AT_type        : <0x91>
 <1><a2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a3>   DW_AT_byte_size   : 8
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 6
    <a6>   DW_AT_decl_column : 9
    <a7>   DW_AT_sibling     : <0xd0>
 <2><ab>: Abbrev Number: 6 (DW_TAG_member)
    <ac>   DW_AT_name        : (indirect string, offset: 0x1521): width
    <b0>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 7
    <b1>   DW_AT_decl_column : 19
    <b2>   DW_AT_type        : <0x8c>
    <b6>   DW_AT_data_member_location: 0
 <2><b7>: Abbrev Number: 6 (DW_TAG_member)
    <b8>   DW_AT_name        : (indirect string, offset: 0x2404): height
    <bc>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 8
    <bd>   DW_AT_decl_column : 13
    <be>   DW_AT_type        : <0x80>
    <c2>   DW_AT_data_member_location: 1
 <2><c3>: Abbrev Number: 6 (DW_TAG_member)
    <c4>   DW_AT_name        : (indirect string, offset: 0x68040): data
    <c8>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 9
    <c9>   DW_AT_decl_column : 21
    <ca>   DW_AT_type        : <0xd0>
    <ce>   DW_AT_data_member_location: 4
 <2><cf>: Abbrev Number: 0
 <1><d0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d1>   DW_AT_byte_size   : 4
    <d2>   DW_AT_type        : <0x9d>
 <1><d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7>   DW_AT_name        : (indirect string, offset: 0xd9): FontDef
    <db>   DW_AT_decl_file   : 4
    <dc>   DW_AT_decl_line   : 10
    <dd>   DW_AT_decl_column : 3
    <de>   DW_AT_type        : <0xa2>
 <1><e2>: Abbrev Number: 5 (DW_TAG_variable)
    <e3>   DW_AT_name        : (indirect string, offset: 0x6d5): Font_7x10
    <e7>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 13
    <e8>   DW_AT_decl_column : 16
    <e9>   DW_AT_type        : <0xd6>
    <ed>   DW_AT_external    : 1
    <ed>   DW_AT_declaration : 1
 <1><ed>: Abbrev Number: 5 (DW_TAG_variable)
    <ee>   DW_AT_name        : (indirect string, offset: 0x3a82): Font_11x18
    <f2>   DW_AT_decl_file   : 4
    <f2>   DW_AT_decl_line   : 14
    <f3>   DW_AT_decl_column : 16
    <f4>   DW_AT_type        : <0xd6>
    <f8>   DW_AT_external    : 1
    <f8>   DW_AT_declaration : 1
 <1><f8>: Abbrev Number: 5 (DW_TAG_variable)
    <f9>   DW_AT_name        : (indirect string, offset: 0x32b4): Font_16x26
    <fd>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 15
    <fe>   DW_AT_decl_column : 16
    <ff>   DW_AT_type        : <0xd6>
    <103>   DW_AT_external    : 1
    <103>   DW_AT_declaration : 1
 <1><103>: Abbrev Number: 4 (DW_TAG_array_type)
    <104>   DW_AT_type        : <0x9d>
    <108>   DW_AT_sibling     : <0x113>
 <2><10c>: Abbrev Number: 15 (DW_TAG_subrange_type)
 <2><10d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <10e>   DW_AT_type        : <0x79>
    <112>   DW_AT_upper_bound : 127
 <2><112>: Abbrev Number: 0
 <1><113>: Abbrev Number: 2 (DW_TAG_const_type)
    <114>   DW_AT_type        : <0x103>
 <1><118>: Abbrev Number: 5 (DW_TAG_variable)
    <119>   DW_AT_name        : (indirect string, offset: 0x1586): saber
    <11d>   DW_AT_decl_file   : 4
    <11d>   DW_AT_decl_line   : 27
    <11e>   DW_AT_decl_column : 23
    <11f>   DW_AT_type        : <0x113>
    <123>   DW_AT_external    : 1
    <123>   DW_AT_declaration : 1
 <1><123>: Abbrev Number: 4 (DW_TAG_array_type)
    <124>   DW_AT_type        : <0x9d>
    <128>   DW_AT_sibling     : <0x134>
 <2><12c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <12d>   DW_AT_type        : <0x79>
    <131>   DW_AT_upper_bound : 949
 <2><133>: Abbrev Number: 0
 <1><134>: Abbrev Number: 2 (DW_TAG_const_type)
    <135>   DW_AT_type        : <0x123>
 <1><139>: Abbrev Number: 9 (DW_TAG_variable)
    <13a>   DW_AT_name        : (indirect string, offset: 0x7a0): Font7x10
    <13e>   DW_AT_decl_file   : 1
    <13e>   DW_AT_decl_line   : 3
    <13f>   DW_AT_decl_column : 23
    <13f>   DW_AT_type        : <0x134>
    <143>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><149>: Abbrev Number: 4 (DW_TAG_array_type)
    <14a>   DW_AT_type        : <0x9d>
    <14e>   DW_AT_sibling     : <0x15a>
 <2><152>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <153>   DW_AT_type        : <0x79>
    <157>   DW_AT_upper_bound : 1709
 <2><159>: Abbrev Number: 0
 <1><15a>: Abbrev Number: 2 (DW_TAG_const_type)
    <15b>   DW_AT_type        : <0x149>
 <1><15f>: Abbrev Number: 9 (DW_TAG_variable)
    <160>   DW_AT_name        : (indirect string, offset: 0x2cf): Font11x18
    <164>   DW_AT_decl_file   : 1
    <164>   DW_AT_decl_line   : 101
    <165>   DW_AT_decl_column : 23
    <165>   DW_AT_type        : <0x15a>
    <169>   DW_AT_location    : 5 byte block: 3 8c 8 1 8 	(DW_OP_addr: 801088c)
 <1><16f>: Abbrev Number: 4 (DW_TAG_array_type)
    <170>   DW_AT_type        : <0x9d>
    <174>   DW_AT_sibling     : <0x180>
 <2><178>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <179>   DW_AT_type        : <0x79>
    <17d>   DW_AT_upper_bound : 2469
 <2><17f>: Abbrev Number: 0
 <1><180>: Abbrev Number: 2 (DW_TAG_const_type)
    <181>   DW_AT_type        : <0x16f>
 <1><185>: Abbrev Number: 9 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x287f): Font16x26
    <18a>   DW_AT_decl_file   : 1
    <18a>   DW_AT_decl_line   : 199
    <18b>   DW_AT_decl_column : 23
    <18b>   DW_AT_type        : <0x180>
    <18f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><195>: Abbrev Number: 4 (DW_TAG_array_type)
    <196>   DW_AT_type        : <0x9d>
    <19a>   DW_AT_sibling     : <0x1a9>
 <2><19e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <19f>   DW_AT_type        : <0x79>
    <1a3>   DW_AT_upper_bound : 127
 <2><1a3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1a4>   DW_AT_type        : <0x79>
    <1a8>   DW_AT_upper_bound : 127
 <2><1a8>: Abbrev Number: 0
 <1><1a9>: Abbrev Number: 2 (DW_TAG_const_type)
    <1aa>   DW_AT_type        : <0x195>
 <1><1ae>: Abbrev Number: 16 (DW_TAG_variable)
    <1af>   DW_AT_specification: <0x118>
    <1b3>   DW_AT_decl_file   : 1
    <1b4>   DW_AT_decl_line   : 297
    <1b6>   DW_AT_decl_column : 16
    <1b7>   DW_AT_type        : <0x1a9>
    <1bb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1c1>: Abbrev Number: 10 (DW_TAG_variable)
    <1c2>   DW_AT_specification: <0xe2>
    <1c6>   DW_AT_decl_file   : 1
    <1c6>   DW_AT_decl_line   : 1160
    <1c8>   DW_AT_decl_column : 9
    <1c8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1ce>: Abbrev Number: 10 (DW_TAG_variable)
    <1cf>   DW_AT_specification: <0xed>
    <1d3>   DW_AT_decl_file   : 1
    <1d3>   DW_AT_decl_line   : 1161
    <1d5>   DW_AT_decl_column : 9
    <1d5>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1db>: Abbrev Number: 10 (DW_TAG_variable)
    <1dc>   DW_AT_specification: <0xf8>
    <1e0>   DW_AT_decl_file   : 1
    <1e0>   DW_AT_decl_line   : 1162
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1e8>: Abbrev Number: 0
  Compilation Unit @ offset 0x1e9:
   Length:        0xcf0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xd3
   Pointer Size:  4
 <0><1f5>: Abbrev Number: 28 (DW_TAG_compile_unit)
    <1f6>   DW_AT_producer    : (indirect string, offset: 0x2d34): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1fa>   DW_AT_language    : 29	(C11)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x91826): ../Core/Src/freertos.c
    <1ff>   DW_AT_comp_dir    : (indirect string, offset: 0x29db): C:/Users/kille/Desktop/Master_provisional/STM32_project/Debug
    <203>   DW_AT_ranges      : 0xc
    <207>   DW_AT_low_pc      : 0
    <20b>   DW_AT_stmt_list   : 0x40a
    <20f>   DW_AT_macros      : 0xf92
 <1><213>: Abbrev Number: 29 (DW_TAG_base_type)
    <214>   DW_AT_byte_size   : 4
    <215>   DW_AT_encoding    : 5	(signed)
    <216>   DW_AT_name        : int
 <1><21a>: Abbrev Number: 7 (DW_TAG_base_type)
    <21b>   DW_AT_byte_size   : 4
    <21c>   DW_AT_encoding    : 7	(unsigned)
    <21d>   DW_AT_name        : (indirect string, offset: 0x3426): unsigned int
 <1><221>: Abbrev Number: 7 (DW_TAG_base_type)
    <222>   DW_AT_byte_size   : 8
    <223>   DW_AT_encoding    : 5	(signed)
    <224>   DW_AT_name        : (indirect string, offset: 0x233c): long long int
 <1><228>: Abbrev Number: 7 (DW_TAG_base_type)
    <229>   DW_AT_byte_size   : 8
    <22a>   DW_AT_encoding    : 4	(float)
    <22b>   DW_AT_name        : (indirect string, offset: 0x7965f): long double
 <1><22f>: Abbrev Number: 7 (DW_TAG_base_type)
    <230>   DW_AT_byte_size   : 1
    <231>   DW_AT_encoding    : 6	(signed char)
    <232>   DW_AT_name        : (indirect string, offset: 0x2a94): signed char
 <1><236>: Abbrev Number: 5 (DW_TAG_typedef)
    <237>   DW_AT_name        : (indirect string, offset: 0x2d2a): __uint8_t
    <23b>   DW_AT_decl_file   : 2
    <23c>   DW_AT_decl_line   : 43
    <23d>   DW_AT_decl_column : 24
    <23e>   DW_AT_type        : <0x242>
 <1><242>: Abbrev Number: 7 (DW_TAG_base_type)
    <243>   DW_AT_byte_size   : 1
    <244>   DW_AT_encoding    : 8	(unsigned char)
    <245>   DW_AT_name        : (indirect string, offset: 0x2ca7): unsigned char
 <1><249>: Abbrev Number: 7 (DW_TAG_base_type)
    <24a>   DW_AT_byte_size   : 2
    <24b>   DW_AT_encoding    : 5	(signed)
    <24c>   DW_AT_name        : (indirect string, offset: 0x7b8): short int
 <1><250>: Abbrev Number: 5 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0x1189): __uint16_t
    <255>   DW_AT_decl_file   : 2
    <256>   DW_AT_decl_line   : 57
    <257>   DW_AT_decl_column : 25
    <258>   DW_AT_type        : <0x25c>
 <1><25c>: Abbrev Number: 7 (DW_TAG_base_type)
    <25d>   DW_AT_byte_size   : 2
    <25e>   DW_AT_encoding    : 7	(unsigned)
    <25f>   DW_AT_name        : (indirect string, offset: 0x5f6): short unsigned int
 <1><263>: Abbrev Number: 7 (DW_TAG_base_type)
    <264>   DW_AT_byte_size   : 4
    <265>   DW_AT_encoding    : 5	(signed)
    <266>   DW_AT_name        : (indirect string, offset: 0x28e9): long int
 <1><26a>: Abbrev Number: 5 (DW_TAG_typedef)
    <26b>   DW_AT_name        : (indirect string, offset: 0x5e6fa): __uint32_t
    <26f>   DW_AT_decl_file   : 2
    <270>   DW_AT_decl_line   : 79
    <271>   DW_AT_decl_column : 25
    <272>   DW_AT_type        : <0x276>
 <1><276>: Abbrev Number: 7 (DW_TAG_base_type)
    <277>   DW_AT_byte_size   : 4
    <278>   DW_AT_encoding    : 7	(unsigned)
    <279>   DW_AT_name        : (indirect string, offset: 0x25e6): long unsigned int
 <1><27d>: Abbrev Number: 7 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 8
    <27f>   DW_AT_encoding    : 7	(unsigned)
    <280>   DW_AT_name        : (indirect string, offset: 0x3761): long long unsigned int
 <1><284>: Abbrev Number: 5 (DW_TAG_typedef)
    <285>   DW_AT_name        : (indirect string, offset: 0x2d2c): uint8_t
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 24
    <28b>   DW_AT_decl_column : 19
    <28c>   DW_AT_type        : <0x236>
 <1><290>: Abbrev Number: 16 (DW_TAG_const_type)
    <291>   DW_AT_type        : <0x284>
 <1><295>: Abbrev Number: 5 (DW_TAG_typedef)
    <296>   DW_AT_name        : (indirect string, offset: 0x6bc68): uint16_t
    <29a>   DW_AT_decl_file   : 3
    <29b>   DW_AT_decl_line   : 36
    <29c>   DW_AT_decl_column : 20
    <29d>   DW_AT_type        : <0x250>
 <1><2a1>: Abbrev Number: 16 (DW_TAG_const_type)
    <2a2>   DW_AT_type        : <0x295>
 <1><2a6>: Abbrev Number: 5 (DW_TAG_typedef)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x6b4bb): uint32_t
    <2ab>   DW_AT_decl_file   : 3
    <2ac>   DW_AT_decl_line   : 48
    <2ad>   DW_AT_decl_column : 20
    <2ae>   DW_AT_type        : <0x26a>
 <1><2b2>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <2b3>   DW_AT_byte_size   : 4
 <1><2b4>: Abbrev Number: 5 (DW_TAG_typedef)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x6bfc6): StackType_t
    <2b9>   DW_AT_decl_file   : 4
    <2ba>   DW_AT_decl_line   : 55
    <2bb>   DW_AT_decl_column : 24
    <2bc>   DW_AT_type        : <0x2a6>
 <1><2c0>: Abbrev Number: 5 (DW_TAG_typedef)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x87fd0): UBaseType_t
    <2c5>   DW_AT_decl_file   : 4
    <2c6>   DW_AT_decl_line   : 57
    <2c7>   DW_AT_decl_column : 23
    <2c8>   DW_AT_type        : <0x276>
 <1><2cc>: Abbrev Number: 5 (DW_TAG_typedef)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x527c2): TickType_t
    <2d1>   DW_AT_decl_file   : 4
    <2d2>   DW_AT_decl_line   : 63
    <2d3>   DW_AT_decl_column : 19
    <2d4>   DW_AT_type        : <0x2a6>
 <1><2d8>: Abbrev Number: 12 (DW_TAG_typedef)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x6cd3f): wint_t
    <2dd>   DW_AT_decl_file   : 5
    <2de>   DW_AT_decl_line   : 359
    <2e0>   DW_AT_decl_column : 23
    <2e1>   DW_AT_type        : <0x21a>
 <1><2e5>: Abbrev Number: 5 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x963cc): _off_t
    <2ea>   DW_AT_decl_file   : 6
    <2eb>   DW_AT_decl_line   : 46
    <2ec>   DW_AT_decl_column : 14
    <2ed>   DW_AT_type        : <0x263>
 <1><2f1>: Abbrev Number: 5 (DW_TAG_typedef)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x232fe): _fpos_t
    <2f6>   DW_AT_decl_file   : 6
    <2f7>   DW_AT_decl_line   : 116
    <2f8>   DW_AT_decl_column : 14
    <2f9>   DW_AT_type        : <0x263>
 <1><2fd>: Abbrev Number: 31 (DW_TAG_union_type)
    <2fe>   DW_AT_byte_size   : 4
    <2ff>   DW_AT_decl_file   : 6
    <300>   DW_AT_decl_line   : 165
    <301>   DW_AT_decl_column : 3
    <302>   DW_AT_sibling     : <0x31d>
 <2><306>: Abbrev Number: 24 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0x714b0): __wch
    <30b>   DW_AT_decl_file   : 6
    <30b>   DW_AT_decl_line   : 167
    <30c>   DW_AT_decl_column : 12
    <30d>   DW_AT_type        : <0x2d8>
 <2><311>: Abbrev Number: 24 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x4d190): __wchb
    <316>   DW_AT_decl_file   : 6
    <316>   DW_AT_decl_line   : 168
    <317>   DW_AT_decl_column : 19
    <318>   DW_AT_type        : <0x31d>
 <2><31c>: Abbrev Number: 0
 <1><31d>: Abbrev Number: 8 (DW_TAG_array_type)
    <31e>   DW_AT_type        : <0x242>
    <322>   DW_AT_sibling     : <0x32d>
 <2><326>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <327>   DW_AT_type        : <0x21a>
    <32b>   DW_AT_upper_bound : 3
 <2><32c>: Abbrev Number: 0
 <1><32d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <32e>   DW_AT_byte_size   : 8
    <32e>   DW_AT_decl_file   : 6
    <32f>   DW_AT_decl_line   : 162
    <330>   DW_AT_decl_column : 9
    <330>   DW_AT_sibling     : <0x34f>
 <2><334>: Abbrev Number: 2 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0x2b68f): __count
    <339>   DW_AT_decl_file   : 6
    <33a>   DW_AT_decl_line   : 164
    <33b>   DW_AT_decl_column : 7
    <33c>   DW_AT_type        : <0x213>
    <340>   DW_AT_data_member_location: 0
 <2><341>: Abbrev Number: 2 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x55b14): __value
    <346>   DW_AT_decl_file   : 6
    <347>   DW_AT_decl_line   : 169
    <348>   DW_AT_decl_column : 5
    <349>   DW_AT_type        : <0x2fd>
    <34d>   DW_AT_data_member_location: 4
 <2><34e>: Abbrev Number: 0
 <1><34f>: Abbrev Number: 5 (DW_TAG_typedef)
    <350>   DW_AT_name        : (indirect string, offset: 0x4e548): _mbstate_t
    <354>   DW_AT_decl_file   : 6
    <355>   DW_AT_decl_line   : 170
    <356>   DW_AT_decl_column : 3
    <357>   DW_AT_type        : <0x32d>
 <1><35b>: Abbrev Number: 5 (DW_TAG_typedef)
    <35c>   DW_AT_name        : (indirect string, offset: 0x50d82): __ULong
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 23
    <362>   DW_AT_decl_column : 25
    <363>   DW_AT_type        : <0x276>
 <1><367>: Abbrev Number: 5 (DW_TAG_typedef)
    <368>   DW_AT_name        : (indirect string, offset: 0x52396): _LOCK_T
    <36c>   DW_AT_decl_file   : 8
    <36d>   DW_AT_decl_line   : 34
    <36e>   DW_AT_decl_column : 25
    <36f>   DW_AT_type        : <0x373>
 <1><373>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <374>   DW_AT_byte_size   : 4
    <374>   DW_AT_type        : <0x378>
 <1><378>: Abbrev Number: 20 (DW_TAG_structure_type)
    <379>   DW_AT_name        : (indirect string, offset: 0x2f949): __lock
    <37d>   DW_AT_declaration : 1
 <1><37d>: Abbrev Number: 5 (DW_TAG_typedef)
    <37e>   DW_AT_name        : (indirect string, offset: 0x4a14d): _flock_t
    <382>   DW_AT_decl_file   : 7
    <383>   DW_AT_decl_line   : 36
    <384>   DW_AT_decl_column : 27
    <385>   DW_AT_type        : <0x367>
 <1><389>: Abbrev Number: 17 (DW_TAG_structure_type)
    <38a>   DW_AT_name        : (indirect string, offset: 0x34fdb): _Bigint
    <38e>   DW_AT_byte_size   : 24
    <38f>   DW_AT_decl_file   : 7
    <38f>   DW_AT_decl_line   : 53
    <390>   DW_AT_decl_column : 8
    <390>   DW_AT_sibling     : <0x3df>
 <2><394>: Abbrev Number: 2 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x58a50): _next
    <399>   DW_AT_decl_file   : 7
    <39a>   DW_AT_decl_line   : 55
    <39b>   DW_AT_decl_column : 19
    <39c>   DW_AT_type        : <0x3df>
    <3a0>   DW_AT_data_member_location: 0
 <2><3a1>: Abbrev Number: 10 (DW_TAG_member)
    <3a2>   DW_AT_name        : _k
    <3a5>   DW_AT_decl_file   : 7
    <3a5>   DW_AT_decl_line   : 56
    <3a6>   DW_AT_decl_column : 7
    <3a7>   DW_AT_type        : <0x213>
    <3ab>   DW_AT_data_member_location: 4
 <2><3ac>: Abbrev Number: 2 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x69c60): _maxwds
    <3b1>   DW_AT_decl_file   : 7
    <3b2>   DW_AT_decl_line   : 56
    <3b3>   DW_AT_decl_column : 11
    <3b4>   DW_AT_type        : <0x213>
    <3b8>   DW_AT_data_member_location: 8
 <2><3b9>: Abbrev Number: 2 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x4f90f): _sign
    <3be>   DW_AT_decl_file   : 7
    <3bf>   DW_AT_decl_line   : 56
    <3c0>   DW_AT_decl_column : 20
    <3c1>   DW_AT_type        : <0x213>
    <3c5>   DW_AT_data_member_location: 12
 <2><3c6>: Abbrev Number: 2 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x4f50e): _wds
    <3cb>   DW_AT_decl_file   : 7
    <3cc>   DW_AT_decl_line   : 56
    <3cd>   DW_AT_decl_column : 27
    <3ce>   DW_AT_type        : <0x213>
    <3d2>   DW_AT_data_member_location: 16
 <2><3d3>: Abbrev Number: 10 (DW_TAG_member)
    <3d4>   DW_AT_name        : _x
    <3d7>   DW_AT_decl_file   : 7
    <3d7>   DW_AT_decl_line   : 57
    <3d8>   DW_AT_decl_column : 11
    <3d9>   DW_AT_type        : <0x3e4>
    <3dd>   DW_AT_data_member_location: 20
 <2><3de>: Abbrev Number: 0
 <1><3df>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3e0>   DW_AT_byte_size   : 4
    <3e0>   DW_AT_type        : <0x389>
 <1><3e4>: Abbrev Number: 8 (DW_TAG_array_type)
    <3e5>   DW_AT_type        : <0x35b>
    <3e9>   DW_AT_sibling     : <0x3f4>
 <2><3ed>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <3ee>   DW_AT_type        : <0x21a>
    <3f2>   DW_AT_upper_bound : 0
 <2><3f3>: Abbrev Number: 0
 <1><3f4>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x2a522): __tm
    <3f9>   DW_AT_byte_size   : 36
    <3fa>   DW_AT_decl_file   : 7
    <3fa>   DW_AT_decl_line   : 61
    <3fb>   DW_AT_decl_column : 8
    <3fb>   DW_AT_sibling     : <0x475>
 <2><3ff>: Abbrev Number: 2 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x7917b): __tm_sec
    <404>   DW_AT_decl_file   : 7
    <405>   DW_AT_decl_line   : 63
    <406>   DW_AT_decl_column : 9
    <407>   DW_AT_type        : <0x213>
    <40b>   DW_AT_data_member_location: 0
 <2><40c>: Abbrev Number: 2 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x46bb): __tm_min
    <411>   DW_AT_decl_file   : 7
    <412>   DW_AT_decl_line   : 64
    <413>   DW_AT_decl_column : 9
    <414>   DW_AT_type        : <0x213>
    <418>   DW_AT_data_member_location: 4
 <2><419>: Abbrev Number: 2 (DW_TAG_member)
    <41a>   DW_AT_name        : (indirect string, offset: 0x21f48): __tm_hour
    <41e>   DW_AT_decl_file   : 7
    <41f>   DW_AT_decl_line   : 65
    <420>   DW_AT_decl_column : 9
    <421>   DW_AT_type        : <0x213>
    <425>   DW_AT_data_member_location: 8
 <2><426>: Abbrev Number: 2 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0x576ec): __tm_mday
    <42b>   DW_AT_decl_file   : 7
    <42c>   DW_AT_decl_line   : 66
    <42d>   DW_AT_decl_column : 9
    <42e>   DW_AT_type        : <0x213>
    <432>   DW_AT_data_member_location: 12
 <2><433>: Abbrev Number: 2 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x6180): __tm_mon
    <438>   DW_AT_decl_file   : 7
    <439>   DW_AT_decl_line   : 67
    <43a>   DW_AT_decl_column : 9
    <43b>   DW_AT_type        : <0x213>
    <43f>   DW_AT_data_member_location: 16
 <2><440>: Abbrev Number: 2 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0x8963a): __tm_year
    <445>   DW_AT_decl_file   : 7
    <446>   DW_AT_decl_line   : 68
    <447>   DW_AT_decl_column : 9
    <448>   DW_AT_type        : <0x213>
    <44c>   DW_AT_data_member_location: 20
 <2><44d>: Abbrev Number: 2 (DW_TAG_member)
    <44e>   DW_AT_name        : (indirect string, offset: 0x3f7fd): __tm_wday
    <452>   DW_AT_decl_file   : 7
    <453>   DW_AT_decl_line   : 69
    <454>   DW_AT_decl_column : 9
    <455>   DW_AT_type        : <0x213>
    <459>   DW_AT_data_member_location: 24
 <2><45a>: Abbrev Number: 2 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0x755f3): __tm_yday
    <45f>   DW_AT_decl_file   : 7
    <460>   DW_AT_decl_line   : 70
    <461>   DW_AT_decl_column : 9
    <462>   DW_AT_type        : <0x213>
    <466>   DW_AT_data_member_location: 28
 <2><467>: Abbrev Number: 2 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0x85133): __tm_isdst
    <46c>   DW_AT_decl_file   : 7
    <46d>   DW_AT_decl_line   : 71
    <46e>   DW_AT_decl_column : 9
    <46f>   DW_AT_type        : <0x213>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 0
 <1><475>: Abbrev Number: 17 (DW_TAG_structure_type)
    <476>   DW_AT_name        : (indirect string, offset: 0x62b50): __sbuf
    <47a>   DW_AT_byte_size   : 8
    <47b>   DW_AT_decl_file   : 7
    <47b>   DW_AT_decl_line   : 116
    <47c>   DW_AT_decl_column : 8
    <47c>   DW_AT_sibling     : <0x49b>
 <2><480>: Abbrev Number: 2 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0x925e7): _base
    <485>   DW_AT_decl_file   : 7
    <486>   DW_AT_decl_line   : 117
    <487>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0x49b>
    <48c>   DW_AT_data_member_location: 0
 <2><48d>: Abbrev Number: 2 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0x9bc49): _size
    <492>   DW_AT_decl_file   : 7
    <493>   DW_AT_decl_line   : 118
    <494>   DW_AT_decl_column : 6
    <495>   DW_AT_type        : <0x213>
    <499>   DW_AT_data_member_location: 4
 <2><49a>: Abbrev Number: 0
 <1><49b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <49c>   DW_AT_byte_size   : 4
    <49c>   DW_AT_type        : <0x242>
 <1><4a0>: Abbrev Number: 17 (DW_TAG_structure_type)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x7118d): __sFILE
    <4a5>   DW_AT_byte_size   : 104
    <4a6>   DW_AT_decl_file   : 7
    <4a6>   DW_AT_decl_line   : 153
    <4a7>   DW_AT_decl_column : 8
    <4a7>   DW_AT_sibling     : <0x5d9>
 <2><4ab>: Abbrev Number: 10 (DW_TAG_member)
    <4ac>   DW_AT_name        : _p
    <4af>   DW_AT_decl_file   : 7
    <4af>   DW_AT_decl_line   : 154
    <4b0>   DW_AT_decl_column : 18
    <4b1>   DW_AT_type        : <0x49b>
    <4b5>   DW_AT_data_member_location: 0
 <2><4b6>: Abbrev Number: 10 (DW_TAG_member)
    <4b7>   DW_AT_name        : _r
    <4ba>   DW_AT_decl_file   : 7
    <4ba>   DW_AT_decl_line   : 155
    <4bb>   DW_AT_decl_column : 7
    <4bc>   DW_AT_type        : <0x213>
    <4c0>   DW_AT_data_member_location: 4
 <2><4c1>: Abbrev Number: 10 (DW_TAG_member)
    <4c2>   DW_AT_name        : _w
    <4c5>   DW_AT_decl_file   : 7
    <4c5>   DW_AT_decl_line   : 156
    <4c6>   DW_AT_decl_column : 7
    <4c7>   DW_AT_type        : <0x213>
    <4cb>   DW_AT_data_member_location: 8
 <2><4cc>: Abbrev Number: 2 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x4481f): _flags
    <4d1>   DW_AT_decl_file   : 7
    <4d2>   DW_AT_decl_line   : 157
    <4d3>   DW_AT_decl_column : 9
    <4d4>   DW_AT_type        : <0x249>
    <4d8>   DW_AT_data_member_location: 12
 <2><4d9>: Abbrev Number: 2 (DW_TAG_member)
    <4da>   DW_AT_name        : (indirect string, offset: 0x196e9): _file
    <4de>   DW_AT_decl_file   : 7
    <4df>   DW_AT_decl_line   : 158
    <4e0>   DW_AT_decl_column : 9
    <4e1>   DW_AT_type        : <0x249>
    <4e5>   DW_AT_data_member_location: 14
 <2><4e6>: Abbrev Number: 10 (DW_TAG_member)
    <4e7>   DW_AT_name        : _bf
    <4eb>   DW_AT_decl_file   : 7
    <4eb>   DW_AT_decl_line   : 159
    <4ec>   DW_AT_decl_column : 17
    <4ed>   DW_AT_type        : <0x475>
    <4f1>   DW_AT_data_member_location: 16
 <2><4f2>: Abbrev Number: 2 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x44e56): _lbfsize
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 160
    <4f9>   DW_AT_decl_column : 7
    <4fa>   DW_AT_type        : <0x213>
    <4fe>   DW_AT_data_member_location: 24
 <2><4ff>: Abbrev Number: 2 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x6803f): _data
    <504>   DW_AT_decl_file   : 7
    <505>   DW_AT_decl_line   : 163
    <506>   DW_AT_decl_column : 18
    <507>   DW_AT_type        : <0x6f2>
    <50b>   DW_AT_data_member_location: 28
 <2><50c>: Abbrev Number: 2 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0x83e23): _cookie
    <511>   DW_AT_decl_file   : 7
    <512>   DW_AT_decl_line   : 167
    <513>   DW_AT_decl_column : 10
    <514>   DW_AT_type        : <0x2b2>
    <518>   DW_AT_data_member_location: 32
 <2><519>: Abbrev Number: 2 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0x74b27): _read
    <51e>   DW_AT_decl_file   : 7
    <51f>   DW_AT_decl_line   : 169
    <520>   DW_AT_decl_column : 29
    <521>   DW_AT_type        : <0x726>
    <525>   DW_AT_data_member_location: 36
 <2><526>: Abbrev Number: 2 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0x15295): _write
    <52b>   DW_AT_decl_file   : 7
    <52c>   DW_AT_decl_line   : 171
    <52d>   DW_AT_decl_column : 29
    <52e>   DW_AT_type        : <0x74e>
    <532>   DW_AT_data_member_location: 40
 <2><533>: Abbrev Number: 2 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x90b3f): _seek
    <538>   DW_AT_decl_file   : 7
    <539>   DW_AT_decl_line   : 174
    <53a>   DW_AT_decl_column : 13
    <53b>   DW_AT_type        : <0x771>
    <53f>   DW_AT_data_member_location: 44
 <2><540>: Abbrev Number: 2 (DW_TAG_member)
    <541>   DW_AT_name        : (indirect string, offset: 0x41f94): _close
    <545>   DW_AT_decl_file   : 7
    <546>   DW_AT_decl_line   : 175
    <547>   DW_AT_decl_column : 9
    <548>   DW_AT_type        : <0x78a>
    <54c>   DW_AT_data_member_location: 48
 <2><54d>: Abbrev Number: 10 (DW_TAG_member)
    <54e>   DW_AT_name        : _ub
    <552>   DW_AT_decl_file   : 7
    <552>   DW_AT_decl_line   : 178
    <553>   DW_AT_decl_column : 17
    <554>   DW_AT_type        : <0x475>
    <558>   DW_AT_data_member_location: 52
 <2><559>: Abbrev Number: 10 (DW_TAG_member)
    <55a>   DW_AT_name        : _up
    <55e>   DW_AT_decl_file   : 7
    <55e>   DW_AT_decl_line   : 179
    <55f>   DW_AT_decl_column : 18
    <560>   DW_AT_type        : <0x49b>
    <564>   DW_AT_data_member_location: 60
 <2><565>: Abbrev Number: 10 (DW_TAG_member)
    <566>   DW_AT_name        : _ur
    <56a>   DW_AT_decl_file   : 7
    <56a>   DW_AT_decl_line   : 180
    <56b>   DW_AT_decl_column : 7
    <56c>   DW_AT_type        : <0x213>
    <570>   DW_AT_data_member_location: 64
 <2><571>: Abbrev Number: 2 (DW_TAG_member)
    <572>   DW_AT_name        : (indirect string, offset: 0x2a0fa): _ubuf
    <576>   DW_AT_decl_file   : 7
    <577>   DW_AT_decl_line   : 183
    <578>   DW_AT_decl_column : 17
    <579>   DW_AT_type        : <0x78f>
    <57d>   DW_AT_data_member_location: 68
 <2><57e>: Abbrev Number: 2 (DW_TAG_member)
    <57f>   DW_AT_name        : (indirect string, offset: 0x648ad): _nbuf
    <583>   DW_AT_decl_file   : 7
    <584>   DW_AT_decl_line   : 184
    <585>   DW_AT_decl_column : 17
    <586>   DW_AT_type        : <0x79f>
    <58a>   DW_AT_data_member_location: 71
 <2><58b>: Abbrev Number: 10 (DW_TAG_member)
    <58c>   DW_AT_name        : _lb
    <590>   DW_AT_decl_file   : 7
    <590>   DW_AT_decl_line   : 187
    <591>   DW_AT_decl_column : 17
    <592>   DW_AT_type        : <0x475>
    <596>   DW_AT_data_member_location: 72
 <2><597>: Abbrev Number: 2 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0x956c6): _blksize
    <59c>   DW_AT_decl_file   : 7
    <59d>   DW_AT_decl_line   : 190
    <59e>   DW_AT_decl_column : 7
    <59f>   DW_AT_type        : <0x213>
    <5a3>   DW_AT_data_member_location: 80
 <2><5a4>: Abbrev Number: 2 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x31671): _offset
    <5a9>   DW_AT_decl_file   : 7
    <5aa>   DW_AT_decl_line   : 191
    <5ab>   DW_AT_decl_column : 10
    <5ac>   DW_AT_type        : <0x2e5>
    <5b0>   DW_AT_data_member_location: 84
 <2><5b1>: Abbrev Number: 2 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x2f94a): _lock
    <5b6>   DW_AT_decl_file   : 7
    <5b7>   DW_AT_decl_line   : 198
    <5b8>   DW_AT_decl_column : 12
    <5b9>   DW_AT_type        : <0x37d>
    <5bd>   DW_AT_data_member_location: 88
 <2><5be>: Abbrev Number: 2 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x13ca1): _mbstate
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 200
    <5c5>   DW_AT_decl_column : 14
    <5c6>   DW_AT_type        : <0x34f>
    <5ca>   DW_AT_data_member_location: 92
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x784c2): _flags2
    <5d0>   DW_AT_decl_file   : 7
    <5d1>   DW_AT_decl_line   : 201
    <5d2>   DW_AT_decl_column : 9
    <5d3>   DW_AT_type        : <0x213>
    <5d7>   DW_AT_data_member_location: 100
 <2><5d8>: Abbrev Number: 0
 <1><5d9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5da>   DW_AT_name        : (indirect string, offset: 0xa05a5): _reent
    <5de>   DW_AT_byte_size   : 76
    <5df>   DW_AT_decl_file   : 7
    <5e0>   DW_AT_decl_line   : 379
    <5e2>   DW_AT_decl_column : 8
    <5e3>   DW_AT_sibling     : <0x6f2>
 <2><5e7>: Abbrev Number: 1 (DW_TAG_member)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x95e04): _errno
    <5ec>   DW_AT_decl_file   : 7
    <5ed>   DW_AT_decl_line   : 383
    <5ef>   DW_AT_decl_column : 7
    <5f0>   DW_AT_type        : <0x213>
    <5f4>   DW_AT_data_member_location: 0
 <2><5f5>: Abbrev Number: 1 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x4be21): _stdin
    <5fa>   DW_AT_decl_file   : 7
    <5fb>   DW_AT_decl_line   : 388
    <5fd>   DW_AT_decl_column : 11
    <5fe>   DW_AT_type        : <0x7bc>
    <602>   DW_AT_data_member_location: 4
 <2><603>: Abbrev Number: 1 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x65ac3): _stdout
    <608>   DW_AT_decl_file   : 7
    <609>   DW_AT_decl_line   : 388
    <60b>   DW_AT_decl_column : 20
    <60c>   DW_AT_type        : <0x7bc>
    <610>   DW_AT_data_member_location: 8
 <2><611>: Abbrev Number: 1 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0x868b4): _stderr
    <616>   DW_AT_decl_file   : 7
    <617>   DW_AT_decl_line   : 388
    <619>   DW_AT_decl_column : 30
    <61a>   DW_AT_type        : <0x7bc>
    <61e>   DW_AT_data_member_location: 12
 <2><61f>: Abbrev Number: 1 (DW_TAG_member)
    <620>   DW_AT_name        : (indirect string, offset: 0x5e0b6): _inc
    <624>   DW_AT_decl_file   : 7
    <625>   DW_AT_decl_line   : 390
    <627>   DW_AT_decl_column : 8
    <628>   DW_AT_type        : <0x213>
    <62c>   DW_AT_data_member_location: 16
 <2><62d>: Abbrev Number: 1 (DW_TAG_member)
    <62e>   DW_AT_name        : (indirect string, offset: 0x751cb): _emergency
    <632>   DW_AT_decl_file   : 7
    <633>   DW_AT_decl_line   : 392
    <635>   DW_AT_decl_column : 9
    <636>   DW_AT_type        : <0x715>
    <63a>   DW_AT_data_member_location: 20
 <2><63b>: Abbrev Number: 1 (DW_TAG_member)
    <63c>   DW_AT_name        : (indirect string, offset: 0x83261): _locale
    <640>   DW_AT_decl_file   : 7
    <641>   DW_AT_decl_line   : 398
    <643>   DW_AT_decl_column : 22
    <644>   DW_AT_type        : <0x922>
    <648>   DW_AT_data_member_location: 24
 <2><649>: Abbrev Number: 32 (DW_TAG_member)
    <64a>   DW_AT_name        : _mp
    <64e>   DW_AT_decl_file   : 7
    <64f>   DW_AT_decl_line   : 400
    <651>   DW_AT_decl_column : 18
    <652>   DW_AT_type        : <0x927>
    <656>   DW_AT_data_member_location: 28
 <2><657>: Abbrev Number: 1 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0x19dbf): __cleanup
    <65c>   DW_AT_decl_file   : 7
    <65d>   DW_AT_decl_line   : 402
    <65f>   DW_AT_decl_column : 10
    <660>   DW_AT_type        : <0x937>
    <664>   DW_AT_data_member_location: 32
 <2><665>: Abbrev Number: 1 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0xd658): _gamma_signgam
    <66a>   DW_AT_decl_file   : 7
    <66b>   DW_AT_decl_line   : 404
    <66d>   DW_AT_decl_column : 7
    <66e>   DW_AT_type        : <0x213>
    <672>   DW_AT_data_member_location: 36
 <2><673>: Abbrev Number: 1 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x6ca03): _cvtlen
    <678>   DW_AT_decl_file   : 7
    <679>   DW_AT_decl_line   : 407
    <67b>   DW_AT_decl_column : 7
    <67c>   DW_AT_type        : <0x213>
    <680>   DW_AT_data_member_location: 40
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x456e8): _cvtbuf
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 408
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x715>
    <68e>   DW_AT_data_member_location: 44
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x6e742): _r48
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 410
    <697>   DW_AT_decl_column : 19
    <698>   DW_AT_type        : <0x93c>
    <69c>   DW_AT_data_member_location: 48
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x7b041): _localtime_buf
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 411
    <6a5>   DW_AT_decl_column : 16
    <6a6>   DW_AT_type        : <0x941>
    <6aa>   DW_AT_data_member_location: 52
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x2521b): _asctime_buf
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 412
    <6b3>   DW_AT_decl_column : 9
    <6b4>   DW_AT_type        : <0x715>
    <6b8>   DW_AT_data_member_location: 56
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xaaf5): _sig_func
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 415
    <6c1>   DW_AT_decl_column : 12
    <6c2>   DW_AT_type        : <0x951>
    <6c6>   DW_AT_data_member_location: 60
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x29f8e): __sf
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 423
    <6cf>   DW_AT_decl_column : 11
    <6d0>   DW_AT_type        : <0x7bc>
    <6d4>   DW_AT_data_member_location: 64
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x43cda): _misc
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 424
    <6dd>   DW_AT_decl_column : 23
    <6de>   DW_AT_type        : <0x95b>
    <6e2>   DW_AT_data_member_location: 68
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x5c80e): _signal_buf
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 425
    <6eb>   DW_AT_decl_column : 9
    <6ec>   DW_AT_type        : <0x715>
    <6f0>   DW_AT_data_member_location: 72
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <6f3>   DW_AT_byte_size   : 4
    <6f3>   DW_AT_type        : <0x5d9>
 <1><6f7>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <6f8>   DW_AT_prototyped  : 1
    <6f8>   DW_AT_type        : <0x213>
    <6fc>   DW_AT_sibling     : <0x715>
 <2><700>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <701>   DW_AT_type        : <0x6f2>
 <2><705>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <706>   DW_AT_type        : <0x2b2>
 <2><70a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <70b>   DW_AT_type        : <0x715>
 <2><70f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <710>   DW_AT_type        : <0x213>
 <2><714>: Abbrev Number: 0
 <1><715>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <716>   DW_AT_byte_size   : 4
    <716>   DW_AT_type        : <0x71a>
 <1><71a>: Abbrev Number: 7 (DW_TAG_base_type)
    <71b>   DW_AT_byte_size   : 1
    <71c>   DW_AT_encoding    : 8	(unsigned char)
    <71d>   DW_AT_name        : (indirect string, offset: 0x31a59): char
 <1><721>: Abbrev Number: 16 (DW_TAG_const_type)
    <722>   DW_AT_type        : <0x71a>
 <1><726>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <727>   DW_AT_byte_size   : 4
    <727>   DW_AT_type        : <0x6f7>
 <1><72b>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <72c>   DW_AT_prototyped  : 1
    <72c>   DW_AT_type        : <0x213>
    <730>   DW_AT_sibling     : <0x749>
 <2><734>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <735>   DW_AT_type        : <0x6f2>
 <2><739>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73a>   DW_AT_type        : <0x2b2>
 <2><73e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73f>   DW_AT_type        : <0x749>
 <2><743>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <744>   DW_AT_type        : <0x213>
 <2><748>: Abbrev Number: 0
 <1><749>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <74a>   DW_AT_byte_size   : 4
    <74a>   DW_AT_type        : <0x721>
 <1><74e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <74f>   DW_AT_byte_size   : 4
    <74f>   DW_AT_type        : <0x72b>
 <1><753>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <754>   DW_AT_prototyped  : 1
    <754>   DW_AT_type        : <0x2f1>
    <758>   DW_AT_sibling     : <0x771>
 <2><75c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <75d>   DW_AT_type        : <0x6f2>
 <2><761>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <762>   DW_AT_type        : <0x2b2>
 <2><766>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <767>   DW_AT_type        : <0x2f1>
 <2><76b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <76c>   DW_AT_type        : <0x213>
 <2><770>: Abbrev Number: 0
 <1><771>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <772>   DW_AT_byte_size   : 4
    <772>   DW_AT_type        : <0x753>
 <1><776>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <777>   DW_AT_prototyped  : 1
    <777>   DW_AT_type        : <0x213>
    <77b>   DW_AT_sibling     : <0x78a>
 <2><77f>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <780>   DW_AT_type        : <0x6f2>
 <2><784>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <785>   DW_AT_type        : <0x2b2>
 <2><789>: Abbrev Number: 0
 <1><78a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <78b>   DW_AT_byte_size   : 4
    <78b>   DW_AT_type        : <0x776>
 <1><78f>: Abbrev Number: 8 (DW_TAG_array_type)
    <790>   DW_AT_type        : <0x242>
    <794>   DW_AT_sibling     : <0x79f>
 <2><798>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <799>   DW_AT_type        : <0x21a>
    <79d>   DW_AT_upper_bound : 2
 <2><79e>: Abbrev Number: 0
 <1><79f>: Abbrev Number: 8 (DW_TAG_array_type)
    <7a0>   DW_AT_type        : <0x242>
    <7a4>   DW_AT_sibling     : <0x7af>
 <2><7a8>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <7a9>   DW_AT_type        : <0x21a>
    <7ad>   DW_AT_upper_bound : 0
 <2><7ae>: Abbrev Number: 0
 <1><7af>: Abbrev Number: 12 (DW_TAG_typedef)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x5e4c7): __FILE
    <7b4>   DW_AT_decl_file   : 7
    <7b5>   DW_AT_decl_line   : 270
    <7b7>   DW_AT_decl_column : 26
    <7b8>   DW_AT_type        : <0x4a0>
 <1><7bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7bd>   DW_AT_byte_size   : 4
    <7bd>   DW_AT_type        : <0x7af>
 <1><7c1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x34d4a): _rand48
    <7c6>   DW_AT_byte_size   : 24
    <7c7>   DW_AT_decl_file   : 7
    <7c8>   DW_AT_decl_line   : 306
    <7ca>   DW_AT_decl_column : 8
    <7cb>   DW_AT_sibling     : <0x808>
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x2cdcf): _seed
    <7d4>   DW_AT_decl_file   : 7
    <7d5>   DW_AT_decl_line   : 307
    <7d7>   DW_AT_decl_column : 18
    <7d8>   DW_AT_type        : <0x808>
    <7dc>   DW_AT_data_member_location: 0
 <2><7dd>: Abbrev Number: 1 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xf649): _mult
    <7e2>   DW_AT_decl_file   : 7
    <7e3>   DW_AT_decl_line   : 308
    <7e5>   DW_AT_decl_column : 18
    <7e6>   DW_AT_type        : <0x808>
    <7ea>   DW_AT_data_member_location: 6
 <2><7eb>: Abbrev Number: 1 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x4d226): _add
    <7f0>   DW_AT_decl_file   : 7
    <7f1>   DW_AT_decl_line   : 309
    <7f3>   DW_AT_decl_column : 18
    <7f4>   DW_AT_type        : <0x25c>
    <7f8>   DW_AT_data_member_location: 12
 <2><7f9>: Abbrev Number: 1 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x58a4b): _rand_next
    <7fe>   DW_AT_decl_file   : 7
    <7ff>   DW_AT_decl_line   : 312
    <801>   DW_AT_decl_column : 36
    <802>   DW_AT_type        : <0x27d>
    <806>   DW_AT_data_member_location: 16
 <2><807>: Abbrev Number: 0
 <1><808>: Abbrev Number: 8 (DW_TAG_array_type)
    <809>   DW_AT_type        : <0x25c>
    <80d>   DW_AT_sibling     : <0x818>
 <2><811>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <812>   DW_AT_type        : <0x21a>
    <816>   DW_AT_upper_bound : 2
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 11 (DW_TAG_structure_type)
    <819>   DW_AT_name        : (indirect string, offset: 0x70683): _mprec
    <81d>   DW_AT_byte_size   : 16
    <81e>   DW_AT_decl_file   : 7
    <81f>   DW_AT_decl_line   : 348
    <821>   DW_AT_decl_column : 8
    <822>   DW_AT_sibling     : <0x85f>
 <2><826>: Abbrev Number: 1 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0x92dd3): _result
    <82b>   DW_AT_decl_file   : 7
    <82c>   DW_AT_decl_line   : 351
    <82e>   DW_AT_decl_column : 19
    <82f>   DW_AT_type        : <0x3df>
    <833>   DW_AT_data_member_location: 0
 <2><834>: Abbrev Number: 1 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x701fb): _result_k
    <839>   DW_AT_decl_file   : 7
    <83a>   DW_AT_decl_line   : 352
    <83c>   DW_AT_decl_column : 7
    <83d>   DW_AT_type        : <0x213>
    <841>   DW_AT_data_member_location: 4
 <2><842>: Abbrev Number: 1 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x4795f): _p5s
    <847>   DW_AT_decl_file   : 7
    <848>   DW_AT_decl_line   : 353
    <84a>   DW_AT_decl_column : 19
    <84b>   DW_AT_type        : <0x3df>
    <84f>   DW_AT_data_member_location: 8
 <2><850>: Abbrev Number: 1 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x565c1): _freelist
    <855>   DW_AT_decl_file   : 7
    <856>   DW_AT_decl_line   : 354
    <858>   DW_AT_decl_column : 20
    <859>   DW_AT_type        : <0x85f>
    <85d>   DW_AT_data_member_location: 12
 <2><85e>: Abbrev Number: 0
 <1><85f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <860>   DW_AT_byte_size   : 4
    <860>   DW_AT_type        : <0x3df>
 <1><864>: Abbrev Number: 11 (DW_TAG_structure_type)
    <865>   DW_AT_name        : (indirect string, offset: 0x4792f): _misc_reent
    <869>   DW_AT_byte_size   : 80
    <86a>   DW_AT_decl_file   : 7
    <86b>   DW_AT_decl_line   : 358
    <86d>   DW_AT_decl_column : 8
    <86e>   DW_AT_sibling     : <0x90d>
 <2><872>: Abbrev Number: 1 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x86f31): _strtok_last
    <877>   DW_AT_decl_file   : 7
    <878>   DW_AT_decl_line   : 361
    <87a>   DW_AT_decl_column : 9
    <87b>   DW_AT_type        : <0x715>
    <87f>   DW_AT_data_member_location: 0
 <2><880>: Abbrev Number: 1 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x41975): _mblen_state
    <885>   DW_AT_decl_file   : 7
    <886>   DW_AT_decl_line   : 362
    <888>   DW_AT_decl_column : 14
    <889>   DW_AT_type        : <0x34f>
    <88d>   DW_AT_data_member_location: 4
 <2><88e>: Abbrev Number: 1 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x86f60): _wctomb_state
    <893>   DW_AT_decl_file   : 7
    <894>   DW_AT_decl_line   : 363
    <896>   DW_AT_decl_column : 14
    <897>   DW_AT_type        : <0x34f>
    <89b>   DW_AT_data_member_location: 12
 <2><89c>: Abbrev Number: 1 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x7e0f3): _mbtowc_state
    <8a1>   DW_AT_decl_file   : 7
    <8a2>   DW_AT_decl_line   : 364
    <8a4>   DW_AT_decl_column : 14
    <8a5>   DW_AT_type        : <0x34f>
    <8a9>   DW_AT_data_member_location: 20
 <2><8aa>: Abbrev Number: 1 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x4c056): _l64a_buf
    <8af>   DW_AT_decl_file   : 7
    <8b0>   DW_AT_decl_line   : 365
    <8b2>   DW_AT_decl_column : 8
    <8b3>   DW_AT_type        : <0x90d>
    <8b7>   DW_AT_data_member_location: 28
 <2><8b8>: Abbrev Number: 1 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x86032): _getdate_err
    <8bd>   DW_AT_decl_file   : 7
    <8be>   DW_AT_decl_line   : 366
    <8c0>   DW_AT_decl_column : 7
    <8c1>   DW_AT_type        : <0x213>
    <8c5>   DW_AT_data_member_location: 36
 <2><8c6>: Abbrev Number: 1 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x48864): _mbrlen_state
    <8cb>   DW_AT_decl_file   : 7
    <8cc>   DW_AT_decl_line   : 367
    <8ce>   DW_AT_decl_column : 14
    <8cf>   DW_AT_type        : <0x34f>
    <8d3>   DW_AT_data_member_location: 40
 <2><8d4>: Abbrev Number: 1 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x22b20): _mbrtowc_state
    <8d9>   DW_AT_decl_file   : 7
    <8da>   DW_AT_decl_line   : 368
    <8dc>   DW_AT_decl_column : 14
    <8dd>   DW_AT_type        : <0x34f>
    <8e1>   DW_AT_data_member_location: 48
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x61f3b): _mbsrtowcs_state
    <8e7>   DW_AT_decl_file   : 7
    <8e8>   DW_AT_decl_line   : 369
    <8ea>   DW_AT_decl_column : 14
    <8eb>   DW_AT_type        : <0x34f>
    <8ef>   DW_AT_data_member_location: 56
 <2><8f0>: Abbrev Number: 1 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x2f655): _wcrtomb_state
    <8f5>   DW_AT_decl_file   : 7
    <8f6>   DW_AT_decl_line   : 370
    <8f8>   DW_AT_decl_column : 14
    <8f9>   DW_AT_type        : <0x34f>
    <8fd>   DW_AT_data_member_location: 64
 <2><8fe>: Abbrev Number: 1 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x54e8a): _wcsrtombs_state
    <903>   DW_AT_decl_file   : 7
    <904>   DW_AT_decl_line   : 371
    <906>   DW_AT_decl_column : 14
    <907>   DW_AT_type        : <0x34f>
    <90b>   DW_AT_data_member_location: 72
 <2><90c>: Abbrev Number: 0
 <1><90d>: Abbrev Number: 8 (DW_TAG_array_type)
    <90e>   DW_AT_type        : <0x71a>
    <912>   DW_AT_sibling     : <0x91d>
 <2><916>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <917>   DW_AT_type        : <0x21a>
    <91b>   DW_AT_upper_bound : 7
 <2><91c>: Abbrev Number: 0
 <1><91d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <91e>   DW_AT_name        : (indirect string, offset: 0x7ea73): __locale_t
    <922>   DW_AT_declaration : 1
 <1><922>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <923>   DW_AT_byte_size   : 4
    <923>   DW_AT_type        : <0x91d>
 <1><927>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <928>   DW_AT_byte_size   : 4
    <928>   DW_AT_type        : <0x818>
 <1><92c>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <92d>   DW_AT_prototyped  : 1
    <92d>   DW_AT_sibling     : <0x937>
 <2><931>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <932>   DW_AT_type        : <0x6f2>
 <2><936>: Abbrev Number: 0
 <1><937>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <938>   DW_AT_byte_size   : 4
    <938>   DW_AT_type        : <0x92c>
 <1><93c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <93d>   DW_AT_byte_size   : 4
    <93d>   DW_AT_type        : <0x7c1>
 <1><941>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <942>   DW_AT_byte_size   : 4
    <942>   DW_AT_type        : <0x3f4>
 <1><946>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <947>   DW_AT_prototyped  : 1
    <947>   DW_AT_sibling     : <0x951>
 <2><94b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <94c>   DW_AT_type        : <0x213>
 <2><950>: Abbrev Number: 0
 <1><951>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <952>   DW_AT_byte_size   : 4
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <957>   DW_AT_byte_size   : 4
    <957>   DW_AT_type        : <0x946>
 <1><95b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <95c>   DW_AT_byte_size   : 4
    <95c>   DW_AT_type        : <0x864>
 <1><960>: Abbrev Number: 11 (DW_TAG_structure_type)
    <961>   DW_AT_name        : (indirect string, offset: 0x7ba01): xSTATIC_LIST_ITEM
    <965>   DW_AT_byte_size   : 20
    <966>   DW_AT_decl_file   : 9
    <967>   DW_AT_decl_line   : 1061
    <969>   DW_AT_decl_column : 8
    <96a>   DW_AT_sibling     : <0x98b>
 <2><96e>: Abbrev Number: 1 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x9dd4a): xDummy2
    <973>   DW_AT_decl_file   : 9
    <974>   DW_AT_decl_line   : 1066
    <976>   DW_AT_decl_column : 13
    <977>   DW_AT_type        : <0x2cc>
    <97b>   DW_AT_data_member_location: 0
 <2><97c>: Abbrev Number: 1 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x36a26): pvDummy3
    <981>   DW_AT_decl_file   : 9
    <982>   DW_AT_decl_line   : 1067
    <984>   DW_AT_decl_column : 8
    <985>   DW_AT_type        : <0x98b>
    <989>   DW_AT_data_member_location: 4
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 8 (DW_TAG_array_type)
    <98c>   DW_AT_type        : <0x2b2>
    <990>   DW_AT_sibling     : <0x99b>
 <2><994>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <995>   DW_AT_type        : <0x21a>
    <999>   DW_AT_upper_bound : 3
 <2><99a>: Abbrev Number: 0
 <1><99b>: Abbrev Number: 12 (DW_TAG_typedef)
    <99c>   DW_AT_name        : (indirect string, offset: 0x36c75): StaticListItem_t
    <9a0>   DW_AT_decl_file   : 9
    <9a1>   DW_AT_decl_line   : 1072
    <9a3>   DW_AT_decl_column : 34
    <9a4>   DW_AT_type        : <0x960>
 <1><9a8>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x55961): xSTATIC_TCB
    <9ad>   DW_AT_byte_size   : 160
    <9ae>   DW_AT_decl_file   : 9
    <9af>   DW_AT_decl_line   : 1112
    <9b1>   DW_AT_decl_column : 16
    <9b2>   DW_AT_sibling     : <0xa43>
 <2><9b6>: Abbrev Number: 1 (DW_TAG_member)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x2084a): pxDummy1
    <9bb>   DW_AT_decl_file   : 9
    <9bc>   DW_AT_decl_line   : 1114
    <9be>   DW_AT_decl_column : 11
    <9bf>   DW_AT_type        : <0x2b2>
    <9c3>   DW_AT_data_member_location: 0
 <2><9c4>: Abbrev Number: 1 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x1ec7b): xDummy3
    <9c9>   DW_AT_decl_file   : 9
    <9ca>   DW_AT_decl_line   : 1118
    <9cc>   DW_AT_decl_column : 19
    <9cd>   DW_AT_type        : <0xa43>
    <9d1>   DW_AT_data_member_location: 4
 <2><9d2>: Abbrev Number: 1 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x17440): uxDummy5
    <9d7>   DW_AT_decl_file   : 9
    <9d8>   DW_AT_decl_line   : 1119
    <9da>   DW_AT_decl_column : 16
    <9db>   DW_AT_type        : <0x2c0>
    <9df>   DW_AT_data_member_location: 44
 <2><9e0>: Abbrev Number: 1 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x20853): pxDummy6
    <9e5>   DW_AT_decl_file   : 9
    <9e6>   DW_AT_decl_line   : 1120
    <9e8>   DW_AT_decl_column : 11
    <9e9>   DW_AT_type        : <0x2b2>
    <9ed>   DW_AT_data_member_location: 48
 <2><9ee>: Abbrev Number: 1 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x35b17): ucDummy7
    <9f3>   DW_AT_decl_file   : 9
    <9f4>   DW_AT_decl_line   : 1121
    <9f6>   DW_AT_decl_column : 13
    <9f7>   DW_AT_type        : <0xa53>
    <9fb>   DW_AT_data_member_location: 52
 <2><9fc>: Abbrev Number: 1 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x85837): uxDummy12
    <a01>   DW_AT_decl_file   : 9
    <a02>   DW_AT_decl_line   : 1132
    <a04>   DW_AT_decl_column : 16
    <a05>   DW_AT_type        : <0xa63>
    <a09>   DW_AT_data_member_location: 68
 <2><a0a>: Abbrev Number: 1 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x763e3): xDummy17
    <a0f>   DW_AT_decl_file   : 9
    <a10>   DW_AT_decl_line   : 1144
    <a12>   DW_AT_decl_column : 17
    <a13>   DW_AT_type        : <0x5d9>
    <a17>   DW_AT_data_member_location: 76
 <2><a18>: Abbrev Number: 1 (DW_TAG_member)
    <a19>   DW_AT_name        : (indirect string, offset: 0x183f3): ulDummy18
    <a1d>   DW_AT_decl_file   : 9
    <a1e>   DW_AT_decl_line   : 1147
    <a20>   DW_AT_decl_column : 14
    <a21>   DW_AT_type        : <0x2a6>
    <a25>   DW_AT_data_member_location: 152
 <2><a26>: Abbrev Number: 1 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0x90c7c): ucDummy19
    <a2b>   DW_AT_decl_file   : 9
    <a2c>   DW_AT_decl_line   : 1148
    <a2e>   DW_AT_decl_column : 13
    <a2f>   DW_AT_type        : <0x284>
    <a33>   DW_AT_data_member_location: 156
 <2><a34>: Abbrev Number: 1 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0x85b83): uxDummy20
    <a39>   DW_AT_decl_file   : 9
    <a3a>   DW_AT_decl_line   : 1151
    <a3c>   DW_AT_decl_column : 13
    <a3d>   DW_AT_type        : <0x284>
    <a41>   DW_AT_data_member_location: 157
 <2><a42>: Abbrev Number: 0
 <1><a43>: Abbrev Number: 8 (DW_TAG_array_type)
    <a44>   DW_AT_type        : <0x99b>
    <a48>   DW_AT_sibling     : <0xa53>
 <2><a4c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a4d>   DW_AT_type        : <0x21a>
    <a51>   DW_AT_upper_bound : 1
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 8 (DW_TAG_array_type)
    <a54>   DW_AT_type        : <0x284>
    <a58>   DW_AT_sibling     : <0xa63>
 <2><a5c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a5d>   DW_AT_type        : <0x21a>
    <a61>   DW_AT_upper_bound : 15
 <2><a62>: Abbrev Number: 0
 <1><a63>: Abbrev Number: 8 (DW_TAG_array_type)
    <a64>   DW_AT_type        : <0x2c0>
    <a68>   DW_AT_sibling     : <0xa73>
 <2><a6c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a6d>   DW_AT_type        : <0x21a>
    <a71>   DW_AT_upper_bound : 1
 <2><a72>: Abbrev Number: 0
 <1><a73>: Abbrev Number: 12 (DW_TAG_typedef)
    <a74>   DW_AT_name        : (indirect string, offset: 0x4a3b1): StaticTask_t
    <a78>   DW_AT_decl_file   : 9
    <a79>   DW_AT_decl_line   : 1160
    <a7b>   DW_AT_decl_column : 3
    <a7c>   DW_AT_type        : <0x9a8>
 <1><a80>: Abbrev Number: 5 (DW_TAG_typedef)
    <a81>   DW_AT_name        : (indirect string, offset: 0x80746): TaskHandle_t
    <a85>   DW_AT_decl_file   : 10
    <a86>   DW_AT_decl_line   : 70
    <a87>   DW_AT_decl_column : 37
    <a88>   DW_AT_type        : <0xa8c>
 <1><a8c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a8d>   DW_AT_byte_size   : 4
    <a8d>   DW_AT_type        : <0xa91>
 <1><a91>: Abbrev Number: 20 (DW_TAG_structure_type)
    <a92>   DW_AT_name        : (indirect string, offset: 0x7da28): tskTaskControlBlock
    <a96>   DW_AT_declaration : 1
 <1><a96>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a97>   DW_AT_byte_size   : 4
    <a97>   DW_AT_type        : <0x2b4>
 <1><a9b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a9c>   DW_AT_encoding    : 5	(signed)
    <a9d>   DW_AT_byte_size   : 2
    <a9e>   DW_AT_type        : <0x249>
    <aa2>   DW_AT_decl_file   : 11
    <aa2>   DW_AT_decl_line   : 172
    <aa3>   DW_AT_decl_column : 15
    <aa3>   DW_AT_sibling     : <0xad8>
 <2><aa7>: Abbrev Number: 22 (DW_TAG_enumerator)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x80341): osPriorityIdle
    <aac>   DW_AT_const_value : -3
 <2><aad>: Abbrev Number: 22 (DW_TAG_enumerator)
    <aae>   DW_AT_name        : (indirect string, offset: 0x8836a): osPriorityLow
    <ab2>   DW_AT_const_value : -2
 <2><ab3>: Abbrev Number: 22 (DW_TAG_enumerator)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x8dc11): osPriorityBelowNormal
    <ab8>   DW_AT_const_value : -1
 <2><ab9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <aba>   DW_AT_name        : (indirect string, offset: 0x9d32b): osPriorityNormal
    <abe>   DW_AT_const_value : 0
 <2><abf>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x5efb1): osPriorityAboveNormal
    <ac4>   DW_AT_const_value : 1
 <2><ac5>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x36108): osPriorityHigh
    <aca>   DW_AT_const_value : 2
 <2><acb>: Abbrev Number: 6 (DW_TAG_enumerator)
    <acc>   DW_AT_name        : (indirect string, offset: 0x85ec5): osPriorityRealtime
    <ad0>   DW_AT_const_value : 3
 <2><ad1>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x82dbc): osPriorityError
    <ad6>   DW_AT_const_value : 132
 <2><ad7>: Abbrev Number: 0
 <1><ad8>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x9e64c): osPriority
    <add>   DW_AT_decl_file   : 11
    <ade>   DW_AT_decl_line   : 181
    <adf>   DW_AT_decl_column : 3
    <ae0>   DW_AT_type        : <0xa9b>
 <1><ae4>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <ae5>   DW_AT_encoding    : 7	(unsigned)
    <ae6>   DW_AT_byte_size   : 4
    <ae7>   DW_AT_type        : <0x21a>
    <aeb>   DW_AT_decl_file   : 11
    <aeb>   DW_AT_decl_line   : 189
    <aec>   DW_AT_decl_column : 15
    <aec>   DW_AT_sibling     : <0xb4e>
 <2><af0>: Abbrev Number: 6 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x82bbf): osOK
    <af5>   DW_AT_const_value : 0
 <2><af6>: Abbrev Number: 6 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x6c62e): osEventSignal
    <afb>   DW_AT_const_value : 8
 <2><afc>: Abbrev Number: 6 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x4c52): osEventMessage
    <b01>   DW_AT_const_value : 16
 <2><b02>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x5eca5): osEventMail
    <b07>   DW_AT_const_value : 32
 <2><b08>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x1bed5): osEventTimeout
    <b0d>   DW_AT_const_value : 64
 <2><b0e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x28568): osErrorParameter
    <b13>   DW_AT_const_value : 128
 <2><b14>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b15>   DW_AT_name        : (indirect string, offset: 0x60a35): osErrorResource
    <b19>   DW_AT_const_value : 129
 <2><b1a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x6748a): osErrorTimeoutResource
    <b1f>   DW_AT_const_value : 193
 <2><b20>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b21>   DW_AT_name        : (indirect string, offset: 0x29d9f): osErrorISR
    <b25>   DW_AT_const_value : 130
 <2><b26>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b27>   DW_AT_name        : (indirect string, offset: 0x78abe): osErrorISRRecursive
    <b2b>   DW_AT_const_value : 131
 <2><b2c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x8c9c0): osErrorPriority
    <b31>   DW_AT_const_value : 132
 <2><b32>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x1c843): osErrorNoMemory
    <b37>   DW_AT_const_value : 133
 <2><b38>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x668b1): osErrorValue
    <b3d>   DW_AT_const_value : 134
 <2><b3e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x4f984): osErrorOS
    <b43>   DW_AT_const_value : 255
 <2><b44>: Abbrev Number: 33 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x31784): os_status_reserved
    <b49>   DW_AT_const_value : 0x7fffffff
 <2><b4d>: Abbrev Number: 0
 <1><b4e>: Abbrev Number: 5 (DW_TAG_typedef)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x1a448): osStatus
    <b53>   DW_AT_decl_file   : 11
    <b54>   DW_AT_decl_line   : 205
    <b55>   DW_AT_decl_column : 3
    <b56>   DW_AT_type        : <0xae4>
 <1><b5a>: Abbrev Number: 5 (DW_TAG_typedef)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x49d2c): os_pthread
    <b5f>   DW_AT_decl_file   : 11
    <b60>   DW_AT_decl_line   : 228
    <b61>   DW_AT_decl_column : 16
    <b62>   DW_AT_type        : <0xb66>
 <1><b66>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b67>   DW_AT_byte_size   : 4
    <b67>   DW_AT_type        : <0xb6b>
 <1><b6b>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <b6c>   DW_AT_prototyped  : 1
    <b6c>   DW_AT_sibling     : <0xb76>
 <2><b70>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <b71>   DW_AT_type        : <0xb76>
 <2><b75>: Abbrev Number: 0
 <1><b76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <b77>   DW_AT_byte_size   : 4
    <b77>   DW_AT_type        : <0xb7b>
 <1><b7b>: Abbrev Number: 34 (DW_TAG_const_type)
 <1><b7c>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x1d95d): osThreadId
    <b81>   DW_AT_decl_file   : 11
    <b82>   DW_AT_decl_line   : 238
    <b83>   DW_AT_decl_column : 22
    <b84>   DW_AT_type        : <0xa80>
 <1><b88>: Abbrev Number: 12 (DW_TAG_typedef)
    <b89>   DW_AT_name        : (indirect string, offset: 0x5c9f7): osStaticThreadDef_t
    <b8d>   DW_AT_decl_file   : 11
    <b8e>   DW_AT_decl_line   : 267
    <b90>   DW_AT_decl_column : 36
    <b91>   DW_AT_type        : <0xa73>
 <1><b95>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b96>   DW_AT_name        : (indirect string, offset: 0x207af): os_thread_def
    <b9a>   DW_AT_byte_size   : 28
    <b9b>   DW_AT_decl_file   : 11
    <b9c>   DW_AT_decl_line   : 280
    <b9e>   DW_AT_decl_column : 16
    <b9f>   DW_AT_sibling     : <0xc06>
 <2><ba3>: Abbrev Number: 1 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x626b2): name
    <ba8>   DW_AT_decl_file   : 11
    <ba9>   DW_AT_decl_line   : 281
    <bab>   DW_AT_decl_column : 27
    <bac>   DW_AT_type        : <0x715>
    <bb0>   DW_AT_data_member_location: 0
 <2><bb1>: Abbrev Number: 1 (DW_TAG_member)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x49d2f): pthread
    <bb6>   DW_AT_decl_file   : 11
    <bb7>   DW_AT_decl_line   : 282
    <bb9>   DW_AT_decl_column : 26
    <bba>   DW_AT_type        : <0xb5a>
    <bbe>   DW_AT_data_member_location: 4
 <2><bbf>: Abbrev Number: 1 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x6af2a): tpriority
    <bc4>   DW_AT_decl_file   : 11
    <bc5>   DW_AT_decl_line   : 283
    <bc7>   DW_AT_decl_column : 26
    <bc8>   DW_AT_type        : <0xad8>
    <bcc>   DW_AT_data_member_location: 8
 <2><bcd>: Abbrev Number: 1 (DW_TAG_member)
    <bce>   DW_AT_name        : (indirect string, offset: 0x3e857): instances
    <bd2>   DW_AT_decl_file   : 11
    <bd3>   DW_AT_decl_line   : 284
    <bd5>   DW_AT_decl_column : 26
    <bd6>   DW_AT_type        : <0x2a6>
    <bda>   DW_AT_data_member_location: 12
 <2><bdb>: Abbrev Number: 1 (DW_TAG_member)
    <bdc>   DW_AT_name        : (indirect string, offset: 0xeb26): stacksize
    <be0>   DW_AT_decl_file   : 11
    <be1>   DW_AT_decl_line   : 285
    <be3>   DW_AT_decl_column : 26
    <be4>   DW_AT_type        : <0x2a6>
    <be8>   DW_AT_data_member_location: 16
 <2><be9>: Abbrev Number: 1 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0x84373): buffer
    <bee>   DW_AT_decl_file   : 11
    <bef>   DW_AT_decl_line   : 287
    <bf1>   DW_AT_decl_column : 27
    <bf2>   DW_AT_type        : <0xc06>
    <bf6>   DW_AT_data_member_location: 20
 <2><bf7>: Abbrev Number: 1 (DW_TAG_member)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x830e3): controlblock
    <bfc>   DW_AT_decl_file   : 11
    <bfd>   DW_AT_decl_line   : 288
    <bff>   DW_AT_decl_column : 27
    <c00>   DW_AT_type        : <0xc0b>
    <c04>   DW_AT_data_member_location: 24
 <2><c05>: Abbrev Number: 0
 <1><c06>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c07>   DW_AT_byte_size   : 4
    <c07>   DW_AT_type        : <0x2a6>
 <1><c0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c0c>   DW_AT_byte_size   : 4
    <c0c>   DW_AT_type        : <0xb88>
 <1><c10>: Abbrev Number: 12 (DW_TAG_typedef)
    <c11>   DW_AT_name        : (indirect string, offset: 0xe6a8): osThreadDef_t
    <c15>   DW_AT_decl_file   : 11
    <c16>   DW_AT_decl_line   : 290
    <c18>   DW_AT_decl_column : 3
    <c19>   DW_AT_type        : <0xb95>
 <1><c1d>: Abbrev Number: 16 (DW_TAG_const_type)
    <c1e>   DW_AT_type        : <0xc10>
 <1><c22>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c23>   DW_AT_byte_size   : 8
    <c23>   DW_AT_decl_file   : 12
    <c24>   DW_AT_decl_line   : 6
    <c25>   DW_AT_decl_column : 9
    <c25>   DW_AT_sibling     : <0xc51>
 <2><c29>: Abbrev Number: 2 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x1521): width
    <c2e>   DW_AT_decl_file   : 12
    <c2f>   DW_AT_decl_line   : 7
    <c30>   DW_AT_decl_column : 19
    <c31>   DW_AT_type        : <0x290>
    <c35>   DW_AT_data_member_location: 0
 <2><c36>: Abbrev Number: 2 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0x2404): height
    <c3b>   DW_AT_decl_file   : 12
    <c3c>   DW_AT_decl_line   : 8
    <c3d>   DW_AT_decl_column : 13
    <c3e>   DW_AT_type        : <0x284>
    <c42>   DW_AT_data_member_location: 1
 <2><c43>: Abbrev Number: 2 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0x68040): data
    <c48>   DW_AT_decl_file   : 12
    <c49>   DW_AT_decl_line   : 9
    <c4a>   DW_AT_decl_column : 21
    <c4b>   DW_AT_type        : <0xc51>
    <c4f>   DW_AT_data_member_location: 4
 <2><c50>: Abbrev Number: 0
 <1><c51>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c52>   DW_AT_byte_size   : 4
    <c52>   DW_AT_type        : <0x2a1>
 <1><c56>: Abbrev Number: 5 (DW_TAG_typedef)
    <c57>   DW_AT_name        : (indirect string, offset: 0xd9): FontDef
    <c5b>   DW_AT_decl_file   : 12
    <c5c>   DW_AT_decl_line   : 10
    <c5d>   DW_AT_decl_column : 3
    <c5e>   DW_AT_type        : <0xc22>
 <1><c62>: Abbrev Number: 35 (DW_TAG_variable)
    <c63>   DW_AT_name        : (indirect string, offset: 0x3a82): Font_11x18
    <c67>   DW_AT_decl_file   : 12
    <c68>   DW_AT_decl_line   : 14
    <c69>   DW_AT_decl_column : 16
    <c6a>   DW_AT_type        : <0xc56>
    <c6e>   DW_AT_external    : 1
    <c6e>   DW_AT_declaration : 1
 <1><c6e>: Abbrev Number: 13 (DW_TAG_variable)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x9132a): voltaje
    <c73>   DW_AT_decl_file   : 1
    <c73>   DW_AT_decl_line   : 49
    <c74>   DW_AT_decl_column : 7
    <c75>   DW_AT_type        : <0xc7f>
    <c79>   DW_AT_external    : 1
    <c79>   DW_AT_location    : 5 byte block: 3 1c 2 0 20 	(DW_OP_addr: 2000021c)
 <1><c7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <c80>   DW_AT_byte_size   : 4
    <c81>   DW_AT_encoding    : 4	(float)
    <c82>   DW_AT_name        : (indirect string, offset: 0x7eca7): float
 <1><c86>: Abbrev Number: 13 (DW_TAG_variable)
    <c87>   DW_AT_name        : (indirect string, offset: 0x6822d): porcentaje_bateria
    <c8b>   DW_AT_decl_file   : 1
    <c8b>   DW_AT_decl_line   : 50
    <c8c>   DW_AT_decl_column : 7
    <c8d>   DW_AT_type        : <0xc7f>
    <c91>   DW_AT_external    : 1
    <c91>   DW_AT_location    : 5 byte block: 3 20 2 0 20 	(DW_OP_addr: 20000220)
 <1><c97>: Abbrev Number: 13 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x65e42): consumo
    <c9c>   DW_AT_decl_file   : 1
    <c9c>   DW_AT_decl_line   : 51
    <c9d>   DW_AT_decl_column : 7
    <c9e>   DW_AT_type        : <0xc7f>
    <ca2>   DW_AT_external    : 1
    <ca2>   DW_AT_location    : 5 byte block: 3 24 2 0 20 	(DW_OP_addr: 20000224)
 <1><ca8>: Abbrev Number: 13 (DW_TAG_variable)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x3bdff): defaultTaskHandle
    <cad>   DW_AT_decl_file   : 1
    <cad>   DW_AT_decl_line   : 53
    <cae>   DW_AT_decl_column : 12
    <caf>   DW_AT_type        : <0xb7c>
    <cb3>   DW_AT_external    : 1
    <cb3>   DW_AT_location    : 5 byte block: 3 28 2 0 20 	(DW_OP_addr: 20000228)
 <1><cb9>: Abbrev Number: 13 (DW_TAG_variable)
    <cba>   DW_AT_name        : (indirect string, offset: 0x647fc): batterygau_taskHandle
    <cbe>   DW_AT_decl_file   : 1
    <cbe>   DW_AT_decl_line   : 54
    <cbf>   DW_AT_decl_column : 12
    <cc0>   DW_AT_type        : <0xb7c>
    <cc4>   DW_AT_external    : 1
    <cc4>   DW_AT_location    : 5 byte block: 3 2c 2 0 20 	(DW_OP_addr: 2000022c)
 <1><cca>: Abbrev Number: 13 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x27efa): LCD_taskHandle
    <ccf>   DW_AT_decl_file   : 1
    <ccf>   DW_AT_decl_line   : 55
    <cd0>   DW_AT_decl_column : 12
    <cd1>   DW_AT_type        : <0xb7c>
    <cd5>   DW_AT_external    : 1
    <cd5>   DW_AT_location    : 5 byte block: 3 30 2 0 20 	(DW_OP_addr: 20000230)
 <1><cdb>: Abbrev Number: 14 (DW_TAG_variable)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x4ef17): xIdleTaskTCBBuffer
    <ce0>   DW_AT_decl_file   : 1
    <ce0>   DW_AT_decl_line   : 73
    <ce1>   DW_AT_decl_column : 21
    <ce2>   DW_AT_type        : <0xa73>
    <ce6>   DW_AT_location    : 5 byte block: 3 34 2 0 20 	(DW_OP_addr: 20000234)
 <1><cec>: Abbrev Number: 8 (DW_TAG_array_type)
    <ced>   DW_AT_type        : <0x2b4>
    <cf1>   DW_AT_sibling     : <0xcfc>
 <2><cf5>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <cf6>   DW_AT_type        : <0x21a>
    <cfa>   DW_AT_upper_bound : 127
 <2><cfb>: Abbrev Number: 0
 <1><cfc>: Abbrev Number: 14 (DW_TAG_variable)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x38ae6): xIdleStack
    <d01>   DW_AT_decl_file   : 1
    <d01>   DW_AT_decl_line   : 74
    <d02>   DW_AT_decl_column : 20
    <d03>   DW_AT_type        : <0xcec>
    <d07>   DW_AT_location    : 5 byte block: 3 d4 2 0 20 	(DW_OP_addr: 200002d4)
 <1><d0d>: Abbrev Number: 36 (DW_TAG_subprogram)
    <d0e>   DW_AT_external    : 1
    <d0e>   DW_AT_name        : (indirect string, offset: 0x819bb): sprintf
    <d12>   DW_AT_decl_file   : 14
    <d13>   DW_AT_decl_line   : 250
    <d14>   DW_AT_decl_column : 5
    <d15>   DW_AT_prototyped  : 1
    <d15>   DW_AT_type        : <0x213>
    <d19>   DW_AT_declaration : 1
    <d19>   DW_AT_sibling     : <0xd29>
 <2><d1d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d1e>   DW_AT_type        : <0x715>
 <2><d22>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d23>   DW_AT_type        : <0x749>
 <2><d27>: Abbrev Number: 37 (DW_TAG_unspecified_parameters)
 <2><d28>: Abbrev Number: 0
 <1><d29>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d2a>   DW_AT_external    : 1
    <d2a>   DW_AT_name        : (indirect string, offset: 0x4253b): ST7789_DrawLine
    <d2e>   DW_AT_decl_file   : 13
    <d2e>   DW_AT_decl_line   : 240
    <d2f>   DW_AT_decl_column : 6
    <d2f>   DW_AT_prototyped  : 1
    <d2f>   DW_AT_declaration : 1
    <d2f>   DW_AT_sibling     : <0xd4d>
 <2><d33>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d34>   DW_AT_type        : <0x295>
 <2><d38>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d39>   DW_AT_type        : <0x295>
 <2><d3d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d3e>   DW_AT_type        : <0x295>
 <2><d42>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d43>   DW_AT_type        : <0x295>
 <2><d47>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d48>   DW_AT_type        : <0x295>
 <2><d4c>: Abbrev Number: 0
 <1><d4d>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d4e>   DW_AT_external    : 1
    <d4e>   DW_AT_name        : (indirect string, offset: 0x8210c): ST7789_WriteString
    <d52>   DW_AT_decl_file   : 13
    <d52>   DW_AT_decl_line   : 248
    <d53>   DW_AT_decl_column : 6
    <d53>   DW_AT_prototyped  : 1
    <d53>   DW_AT_declaration : 1
    <d53>   DW_AT_sibling     : <0xd76>
 <2><d57>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d58>   DW_AT_type        : <0x295>
 <2><d5c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d5d>   DW_AT_type        : <0x295>
 <2><d61>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d62>   DW_AT_type        : <0x749>
 <2><d66>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d67>   DW_AT_type        : <0xc56>
 <2><d6b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d6c>   DW_AT_type        : <0x295>
 <2><d70>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d71>   DW_AT_type        : <0x295>
 <2><d75>: Abbrev Number: 0
 <1><d76>: Abbrev Number: 23 (DW_TAG_subprogram)
    <d77>   DW_AT_external    : 1
    <d77>   DW_AT_name        : (indirect string, offset: 0x8acb8): ST7789_Fill_Color
    <d7b>   DW_AT_decl_file   : 13
    <d7b>   DW_AT_decl_line   : 234
    <d7c>   DW_AT_decl_column : 6
    <d7c>   DW_AT_prototyped  : 1
    <d7c>   DW_AT_declaration : 1
    <d7c>   DW_AT_sibling     : <0xd86>
 <2><d80>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d81>   DW_AT_type        : <0x295>
 <2><d85>: Abbrev Number: 0
 <1><d86>: Abbrev Number: 27 (DW_TAG_subprogram)
    <d87>   DW_AT_external    : 1
    <d87>   DW_AT_name        : (indirect string, offset: 0x6c674): osDelay
    <d8b>   DW_AT_decl_file   : 11
    <d8b>   DW_AT_decl_line   : 478
    <d8d>   DW_AT_decl_column : 10
    <d8e>   DW_AT_prototyped  : 1
    <d8e>   DW_AT_type        : <0xb4e>
    <d92>   DW_AT_declaration : 1
    <d92>   DW_AT_sibling     : <0xd9c>
 <2><d96>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d97>   DW_AT_type        : <0x2a6>
 <2><d9b>: Abbrev Number: 0
 <1><d9c>: Abbrev Number: 38 (DW_TAG_subprogram)
    <d9d>   DW_AT_external    : 1
    <d9d>   DW_AT_name        : (indirect string, offset: 0xec78): MX_USB_HOST_Init
    <da1>   DW_AT_decl_file   : 1
    <da2>   DW_AT_decl_line   : 66
    <da3>   DW_AT_decl_column : 13
    <da4>   DW_AT_prototyped  : 1
    <da4>   DW_AT_declaration : 1
 <1><da4>: Abbrev Number: 27 (DW_TAG_subprogram)
    <da5>   DW_AT_external    : 1
    <da5>   DW_AT_name        : (indirect string, offset: 0x39375): osThreadCreate
    <da9>   DW_AT_decl_file   : 11
    <da9>   DW_AT_decl_line   : 441
    <dab>   DW_AT_decl_column : 12
    <dac>   DW_AT_prototyped  : 1
    <dac>   DW_AT_type        : <0xb7c>
    <db0>   DW_AT_declaration : 1
    <db0>   DW_AT_sibling     : <0xdbf>
 <2><db4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <db5>   DW_AT_type        : <0xdbf>
 <2><db9>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dba>   DW_AT_type        : <0x2b2>
 <2><dbe>: Abbrev Number: 0
 <1><dbf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dc0>   DW_AT_byte_size   : 4
    <dc0>   DW_AT_type        : <0xc1d>
 <1><dc4>: Abbrev Number: 19 (DW_TAG_subprogram)
    <dc5>   DW_AT_external    : 1
    <dc5>   DW_AT_name        : (indirect string, offset: 0x5c447): StartLCD_task
    <dc9>   DW_AT_decl_file   : 1
    <dc9>   DW_AT_decl_line   : 175
    <dca>   DW_AT_decl_column : 6
    <dca>   DW_AT_prototyped  : 1
    <dca>   DW_AT_low_pc      : 0x8000fd0
    <dce>   DW_AT_high_pc     : 0x110
    <dd2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd4>   DW_AT_call_all_tail_calls: 1
    <dd4>   DW_AT_sibling     : <0xdf5>
 <2><dd8>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x22197): argument
    <ddd>   DW_AT_decl_file   : 1
    <ddd>   DW_AT_decl_line   : 175
    <dde>   DW_AT_decl_column : 33
    <ddf>   DW_AT_type        : <0xb76>
    <de3>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><de6>: Abbrev Number: 14 (DW_TAG_variable)
    <de7>   DW_AT_name        : (indirect string, offset: 0x8436f): str_buffer
    <deb>   DW_AT_decl_file   : 1
    <deb>   DW_AT_decl_line   : 178
    <dec>   DW_AT_decl_column : 8
    <ded>   DW_AT_type        : <0xdf5>
    <df1>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><df4>: Abbrev Number: 0
 <1><df5>: Abbrev Number: 8 (DW_TAG_array_type)
    <df6>   DW_AT_type        : <0x71a>
    <dfa>   DW_AT_sibling     : <0xe05>
 <2><dfe>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <dff>   DW_AT_type        : <0x21a>
    <e03>   DW_AT_upper_bound : 31
 <2><e04>: Abbrev Number: 0
 <1><e05>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e06>   DW_AT_external    : 1
    <e06>   DW_AT_name        : (indirect string, offset: 0x36f34): StartGaulge_task
    <e0a>   DW_AT_decl_file   : 1
    <e0a>   DW_AT_decl_line   : 157
    <e0b>   DW_AT_decl_column : 6
    <e0b>   DW_AT_prototyped  : 1
    <e0b>   DW_AT_low_pc      : 0x8000fc0
    <e0f>   DW_AT_high_pc     : 0x10
    <e13>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e15>   DW_AT_call_all_tail_calls: 1
    <e15>   DW_AT_sibling     : <0xe28>
 <2><e19>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x22197): argument
    <e1e>   DW_AT_decl_file   : 1
    <e1e>   DW_AT_decl_line   : 157
    <e1f>   DW_AT_decl_column : 36
    <e20>   DW_AT_type        : <0xb76>
    <e24>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e27>: Abbrev Number: 0
 <1><e28>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e29>   DW_AT_external    : 1
    <e29>   DW_AT_name        : (indirect string, offset: 0x233a2): StartDefaultTask
    <e2d>   DW_AT_decl_file   : 1
    <e2d>   DW_AT_decl_line   : 137
    <e2e>   DW_AT_decl_column : 6
    <e2e>   DW_AT_prototyped  : 1
    <e2e>   DW_AT_low_pc      : 0x8000fac
    <e32>   DW_AT_high_pc     : 0x14
    <e36>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e38>   DW_AT_call_all_tail_calls: 1
    <e38>   DW_AT_sibling     : <0xe4b>
 <2><e3c>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x22197): argument
    <e41>   DW_AT_decl_file   : 1
    <e41>   DW_AT_decl_line   : 137
    <e42>   DW_AT_decl_column : 36
    <e43>   DW_AT_type        : <0xb76>
    <e47>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e4a>: Abbrev Number: 0
 <1><e4b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e4c>   DW_AT_external    : 1
    <e4c>   DW_AT_name        : (indirect string, offset: 0x24c79): MX_FREERTOS_Init
    <e50>   DW_AT_decl_file   : 1
    <e50>   DW_AT_decl_line   : 90
    <e51>   DW_AT_decl_column : 6
    <e51>   DW_AT_prototyped  : 1
    <e51>   DW_AT_low_pc      : 0x8000f18
    <e55>   DW_AT_high_pc     : 0x94
    <e59>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5b>   DW_AT_call_all_tail_calls: 1
    <e5b>   DW_AT_sibling     : <0xe8c>
 <2><e5f>: Abbrev Number: 14 (DW_TAG_variable)
    <e60>   DW_AT_name        : (indirect string, offset: 0x6f3dd): os_thread_def_defaultTask
    <e64>   DW_AT_decl_file   : 1
    <e64>   DW_AT_decl_line   : 113
    <e65>   DW_AT_decl_column : 3
    <e66>   DW_AT_type        : <0xc1d>
    <e6a>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><e6d>: Abbrev Number: 14 (DW_TAG_variable)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x53854): os_thread_def_batterygau_task
    <e72>   DW_AT_decl_file   : 1
    <e72>   DW_AT_decl_line   : 117
    <e73>   DW_AT_decl_column : 3
    <e74>   DW_AT_type        : <0xc1d>
    <e78>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><e7c>: Abbrev Number: 14 (DW_TAG_variable)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x80675): os_thread_def_LCD_task
    <e81>   DW_AT_decl_file   : 1
    <e81>   DW_AT_decl_line   : 121
    <e82>   DW_AT_decl_column : 3
    <e83>   DW_AT_type        : <0xc1d>
    <e87>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><e8b>: Abbrev Number: 0
 <1><e8c>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e8d>   DW_AT_external    : 1
    <e8d>   DW_AT_name        : (indirect string, offset: 0x125c5): vApplicationGetIdleTaskMemory
    <e91>   DW_AT_decl_file   : 1
    <e92>   DW_AT_decl_line   : 76
    <e93>   DW_AT_decl_column : 6
    <e94>   DW_AT_prototyped  : 1
    <e94>   DW_AT_low_pc      : 0x8000ee4
    <e98>   DW_AT_high_pc     : 0x34
    <e9c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e9e>   DW_AT_call_all_calls: 1
    <e9e>   DW_AT_sibling     : <0xecd>
 <2><ea2>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x4ef15): ppxIdleTaskTCBBuffer
    <ea7>   DW_AT_decl_file   : 1
    <ea7>   DW_AT_decl_line   : 76
    <ea8>   DW_AT_decl_column : 52
    <ea9>   DW_AT_type        : <0xecd>
    <ead>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><eb0>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x5683f): ppxIdleTaskStackBuffer
    <eb5>   DW_AT_decl_file   : 1
    <eb5>   DW_AT_decl_line   : 76
    <eb6>   DW_AT_decl_column : 88
    <eb7>   DW_AT_type        : <0xed7>
    <ebb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ebe>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x5b9fb): pulIdleTaskStackSize
    <ec3>   DW_AT_decl_file   : 1
    <ec3>   DW_AT_decl_line   : 76
    <ec4>   DW_AT_decl_column : 122
    <ec5>   DW_AT_type        : <0xc06>
    <ec9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ecc>: Abbrev Number: 0
 <1><ecd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ece>   DW_AT_byte_size   : 4
    <ece>   DW_AT_type        : <0xed2>
 <1><ed2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ed3>   DW_AT_byte_size   : 4
    <ed3>   DW_AT_type        : <0xa73>
 <1><ed7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <ed8>   DW_AT_byte_size   : 4
    <ed8>   DW_AT_type        : <0xa96>
 <1><edc>: Abbrev Number: 0
  Compilation Unit @ offset 0xedd:
   Length:        0x47f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x31a
   Pointer Size:  4
 <0><ee9>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <eea>   DW_AT_producer    : (indirect string, offset: 0x2d34): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <eee>   DW_AT_language    : 29	(C11)
    <eef>   DW_AT_name        : (indirect string, offset: 0x93c99): ../Core/Src/gpio.c
    <ef3>   DW_AT_comp_dir    : (indirect string, offset: 0x29db): C:/Users/kille/Desktop/Master_provisional/STM32_project/Debug
    <ef7>   DW_AT_ranges      : 0x39
    <efb>   DW_AT_low_pc      : 0
    <eff>   DW_AT_stmt_list   : 0xf33
    <f03>   DW_AT_macros      : 0x16498
 <1><f07>: Abbrev Number: 2 (DW_TAG_base_type)
    <f08>   DW_AT_byte_size   : 1
    <f09>   DW_AT_encoding    : 6	(signed char)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x2a94): signed char
 <1><f0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x2d2a): __uint8_t
    <f13>   DW_AT_decl_file   : 2
    <f14>   DW_AT_decl_line   : 43
    <f15>   DW_AT_decl_column : 24
    <f16>   DW_AT_type        : <0xf1a>
 <1><f1a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f1b>   DW_AT_byte_size   : 1
    <f1c>   DW_AT_encoding    : 8	(unsigned char)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x2ca7): unsigned char
 <1><f21>: Abbrev Number: 2 (DW_TAG_base_type)
    <f22>   DW_AT_byte_size   : 2
    <f23>   DW_AT_encoding    : 5	(signed)
    <f24>   DW_AT_name        : (indirect string, offset: 0x7b8): short int
 <1><f28>: Abbrev Number: 3 (DW_TAG_typedef)
    <f29>   DW_AT_name        : (indirect string, offset: 0x1189): __uint16_t
    <f2d>   DW_AT_decl_file   : 2
    <f2e>   DW_AT_decl_line   : 57
    <f2f>   DW_AT_decl_column : 25
    <f30>   DW_AT_type        : <0xf34>
 <1><f34>: Abbrev Number: 2 (DW_TAG_base_type)
    <f35>   DW_AT_byte_size   : 2
    <f36>   DW_AT_encoding    : 7	(unsigned)
    <f37>   DW_AT_name        : (indirect string, offset: 0x5f6): short unsigned int
 <1><f3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3c>   DW_AT_byte_size   : 4
    <f3d>   DW_AT_encoding    : 5	(signed)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x28e9): long int
 <1><f42>: Abbrev Number: 3 (DW_TAG_typedef)
    <f43>   DW_AT_name        : (indirect string, offset: 0x5e6fa): __uint32_t
    <f47>   DW_AT_decl_file   : 2
    <f48>   DW_AT_decl_line   : 79
    <f49>   DW_AT_decl_column : 25
    <f4a>   DW_AT_type        : <0xf4e>
 <1><f4e>: Abbrev Number: 2 (DW_TAG_base_type)
    <f4f>   DW_AT_byte_size   : 4
    <f50>   DW_AT_encoding    : 7	(unsigned)
    <f51>   DW_AT_name        : (indirect string, offset: 0x25e6): long unsigned int
 <1><f55>: Abbrev Number: 2 (DW_TAG_base_type)
    <f56>   DW_AT_byte_size   : 8
    <f57>   DW_AT_encoding    : 5	(signed)
    <f58>   DW_AT_name        : (indirect string, offset: 0x233c): long long int
 <1><f5c>: Abbrev Number: 2 (DW_TAG_base_type)
    <f5d>   DW_AT_byte_size   : 8
    <f5e>   DW_AT_encoding    : 7	(unsigned)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x3761): long long unsigned int
 <1><f63>: Abbrev Number: 18 (DW_TAG_base_type)
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_encoding    : 5	(signed)
    <f66>   DW_AT_name        : int
 <1><f6a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f6b>   DW_AT_byte_size   : 4
    <f6c>   DW_AT_encoding    : 7	(unsigned)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x3426): unsigned int
 <1><f71>: Abbrev Number: 3 (DW_TAG_typedef)
    <f72>   DW_AT_name        : (indirect string, offset: 0x2d2c): uint8_t
    <f76>   DW_AT_decl_file   : 3
    <f77>   DW_AT_decl_line   : 24
    <f78>   DW_AT_decl_column : 19
    <f79>   DW_AT_type        : <0xf0e>
 <1><f7d>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x6bc68): uint16_t
    <f82>   DW_AT_decl_file   : 3
    <f83>   DW_AT_decl_line   : 36
    <f84>   DW_AT_decl_column : 20
    <f85>   DW_AT_type        : <0xf28>
 <1><f89>: Abbrev Number: 3 (DW_TAG_typedef)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x6b4bb): uint32_t
    <f8e>   DW_AT_decl_file   : 3
    <f8f>   DW_AT_decl_line   : 48
    <f90>   DW_AT_decl_column : 20
    <f91>   DW_AT_type        : <0xf42>
 <1><f95>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <f96>   DW_AT_type        : <0xf89>
 <1><f9a>: Abbrev Number: 9 (DW_TAG_array_type)
    <f9b>   DW_AT_type        : <0xf89>
    <f9f>   DW_AT_sibling     : <0xfaa>
 <2><fa3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fa4>   DW_AT_type        : <0xf6a>
    <fa8>   DW_AT_upper_bound : 0
 <2><fa9>: Abbrev Number: 0
 <1><faa>: Abbrev Number: 9 (DW_TAG_array_type)
    <fab>   DW_AT_type        : <0xf89>
    <faf>   DW_AT_sibling     : <0xfba>
 <2><fb3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fb4>   DW_AT_type        : <0xf6a>
    <fb8>   DW_AT_upper_bound : 1
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 12 (DW_TAG_structure_type)
    <fbb>   DW_AT_byte_size   : 40
    <fbc>   DW_AT_decl_file   : 4
    <fbc>   DW_AT_decl_line   : 265
    <fbe>   DW_AT_decl_column : 9
    <fbe>   DW_AT_sibling     : <0x102f>
 <2><fc2>: Abbrev Number: 1 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x93df0): MODER
    <fc7>   DW_AT_decl_file   : 4
    <fc7>   DW_AT_decl_line   : 267
    <fc9>   DW_AT_decl_column : 17
    <fc9>   DW_AT_type        : <0xf95>
    <fcd>   DW_AT_data_member_location: 0
 <2><fce>: Abbrev Number: 1 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x93d66): OTYPER
    <fd3>   DW_AT_decl_file   : 4
    <fd3>   DW_AT_decl_line   : 268
    <fd5>   DW_AT_decl_column : 17
    <fd5>   DW_AT_type        : <0xf95>
    <fd9>   DW_AT_data_member_location: 4
 <2><fda>: Abbrev Number: 1 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x93d59): OSPEEDR
    <fdf>   DW_AT_decl_file   : 4
    <fdf>   DW_AT_decl_line   : 269
    <fe1>   DW_AT_decl_column : 17
    <fe1>   DW_AT_type        : <0xf95>
    <fe5>   DW_AT_data_member_location: 8
 <2><fe6>: Abbrev Number: 1 (DW_TAG_member)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x93e6e): PUPDR
    <feb>   DW_AT_decl_file   : 4
    <feb>   DW_AT_decl_line   : 270
    <fed>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xf95>
    <ff1>   DW_AT_data_member_location: 12
 <2><ff2>: Abbrev Number: 5 (DW_TAG_member)
    <ff3>   DW_AT_name        : IDR
    <ff7>   DW_AT_decl_file   : 4
    <ff7>   DW_AT_decl_line   : 271
    <ff9>   DW_AT_decl_column : 17
    <ff9>   DW_AT_type        : <0xf95>
    <ffd>   DW_AT_data_member_location: 16
 <2><ffe>: Abbrev Number: 5 (DW_TAG_member)
    <fff>   DW_AT_name        : ODR
    <1003>   DW_AT_decl_file   : 4
    <1003>   DW_AT_decl_line   : 272
    <1005>   DW_AT_decl_column : 17
    <1005>   DW_AT_type        : <0xf95>
    <1009>   DW_AT_data_member_location: 20
 <2><100a>: Abbrev Number: 1 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x93ddc): BSRR
    <100f>   DW_AT_decl_file   : 4
    <100f>   DW_AT_decl_line   : 273
    <1011>   DW_AT_decl_column : 17
    <1011>   DW_AT_type        : <0xf95>
    <1015>   DW_AT_data_member_location: 24
 <2><1016>: Abbrev Number: 1 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0x93d25): LCKR
    <101b>   DW_AT_decl_file   : 4
    <101b>   DW_AT_decl_line   : 274
    <101d>   DW_AT_decl_column : 17
    <101d>   DW_AT_type        : <0xf95>
    <1021>   DW_AT_data_member_location: 28
 <2><1022>: Abbrev Number: 5 (DW_TAG_member)
    <1023>   DW_AT_name        : AFR
    <1027>   DW_AT_decl_file   : 4
    <1027>   DW_AT_decl_line   : 275
    <1029>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0x103f>
    <102d>   DW_AT_data_member_location: 32
 <2><102e>: Abbrev Number: 0
 <1><102f>: Abbrev Number: 9 (DW_TAG_array_type)
    <1030>   DW_AT_type        : <0xf95>
    <1034>   DW_AT_sibling     : <0x103f>
 <2><1038>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1039>   DW_AT_type        : <0xf6a>
    <103d>   DW_AT_upper_bound : 1
 <2><103e>: Abbrev Number: 0
 <1><103f>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <1040>   DW_AT_type        : <0x102f>
 <1><1044>: Abbrev Number: 13 (DW_TAG_typedef)
    <1045>   DW_AT_name        : (indirect string, offset: 0x93e2a): GPIO_TypeDef
    <1049>   DW_AT_decl_file   : 4
    <1049>   DW_AT_decl_line   : 276
    <104b>   DW_AT_decl_column : 3
    <104b>   DW_AT_type        : <0xfba>
 <1><104f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1050>   DW_AT_byte_size   : 144
    <1051>   DW_AT_decl_file   : 4
    <1051>   DW_AT_decl_line   : 336
    <1053>   DW_AT_decl_column : 9
    <1053>   DW_AT_sibling     : <0x11d7>
 <2><1057>: Abbrev Number: 5 (DW_TAG_member)
    <1058>   DW_AT_name        : CR
    <105b>   DW_AT_decl_file   : 4
    <105b>   DW_AT_decl_line   : 338
    <105d>   DW_AT_decl_column : 17
    <105d>   DW_AT_type        : <0xf95>
    <1061>   DW_AT_data_member_location: 0
 <2><1062>: Abbrev Number: 1 (DW_TAG_member)
    <1063>   DW_AT_name        : (indirect string, offset: 0x93d6d): PLLCFGR
    <1067>   DW_AT_decl_file   : 4
    <1067>   DW_AT_decl_line   : 339
    <1069>   DW_AT_decl_column : 17
    <1069>   DW_AT_type        : <0xf95>
    <106d>   DW_AT_data_member_location: 4
 <2><106e>: Abbrev Number: 1 (DW_TAG_member)
    <106f>   DW_AT_name        : (indirect string, offset: 0x93df9): CFGR
    <1073>   DW_AT_decl_file   : 4
    <1073>   DW_AT_decl_line   : 340
    <1075>   DW_AT_decl_column : 17
    <1075>   DW_AT_type        : <0xf95>
    <1079>   DW_AT_data_member_location: 8
 <2><107a>: Abbrev Number: 5 (DW_TAG_member)
    <107b>   DW_AT_name        : CIR
    <107f>   DW_AT_decl_file   : 4
    <107f>   DW_AT_decl_line   : 341
    <1081>   DW_AT_decl_column : 17
    <1081>   DW_AT_type        : <0xf95>
    <1085>   DW_AT_data_member_location: 12
 <2><1086>: Abbrev Number: 1 (DW_TAG_member)
    <1087>   DW_AT_name        : (indirect string, offset: 0x93dc9): AHB1RSTR
    <108b>   DW_AT_decl_file   : 4
    <108b>   DW_AT_decl_line   : 342
    <108d>   DW_AT_decl_column : 17
    <108d>   DW_AT_type        : <0xf95>
    <1091>   DW_AT_data_member_location: 16
 <2><1092>: Abbrev Number: 1 (DW_TAG_member)
    <1093>   DW_AT_name        : (indirect string, offset: 0x93e21): AHB2RSTR
    <1097>   DW_AT_decl_file   : 4
    <1097>   DW_AT_decl_line   : 343
    <1099>   DW_AT_decl_column : 17
    <1099>   DW_AT_type        : <0xf95>
    <109d>   DW_AT_data_member_location: 20
 <2><109e>: Abbrev Number: 1 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0x93e5b): AHB3RSTR
    <10a3>   DW_AT_decl_file   : 4
    <10a3>   DW_AT_decl_line   : 344
    <10a5>   DW_AT_decl_column : 17
    <10a5>   DW_AT_type        : <0xf95>
    <10a9>   DW_AT_data_member_location: 24
 <2><10aa>: Abbrev Number: 1 (DW_TAG_member)
    <10ab>   DW_AT_name        : (indirect string, offset: 0x93ce0): RESERVED0
    <10af>   DW_AT_decl_file   : 4
    <10af>   DW_AT_decl_line   : 345
    <10b1>   DW_AT_decl_column : 17
    <10b1>   DW_AT_type        : <0xf89>
    <10b5>   DW_AT_data_member_location: 28
 <2><10b6>: Abbrev Number: 1 (DW_TAG_member)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x93d06): APB1RSTR
    <10bb>   DW_AT_decl_file   : 4
    <10bb>   DW_AT_decl_line   : 346
    <10bd>   DW_AT_decl_column : 17
    <10bd>   DW_AT_type        : <0xf95>
    <10c1>   DW_AT_data_member_location: 32
 <2><10c2>: Abbrev Number: 1 (DW_TAG_member)
    <10c3>   DW_AT_name        : (indirect string, offset: 0x93ccc): APB2RSTR
    <10c7>   DW_AT_decl_file   : 4
